{
  "dataset_id": "ds003751",
  "num_citations": 7,
  "date_last_updated": "2025-07-26T18:48:08.818468+00:00",
  "metadata": {
    "total_cumulative_citations": 69,
    "fetch_date": "2025-07-26T18:48:08.818468+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Dataset on Emotions using Naturalistic Stimuli (DENS)",
      "author": "S Mishraa, M Asifa, US Tiwaya",
      "venue": "NA",
      "year": 0,
      "url": "https://www.academia.edu/download/87563808/2021.08.04.455041.full.pdf",
      "cited_by": 1,
      "abstract": "Emotion is a constructed phenomenon that emerges from the dynamic interaction of multiple  components neurologically, physiologically and behaviorally. Such dynamics can not be",
      "short_author": "S Mishraa, M Asifa, US Tiwaya"
    },
    {
      "title": "Brain-Computer Interfaces for Emotional Regulation in Patients with Various Disorders",
      "author": "V Mehta",
      "venue": "arXiv preprint arXiv:2411.14666",
      "year": 2024,
      "url": "https://arxiv.org/abs/2411.14666",
      "cited_by": 0,
      "abstract": "Neurological and Physiological Disorders that impact emotional regulation each have their  own unique characteristics which are important to understand in order to create a",
      "short_author": "V Mehta"
    },
    {
      "title": "Emotion recognition using temporally localized emotional events in EEG with naturalistic context: DENS# dataset",
      "author": "M Asif, S Mishra, MT Vinodbhai, US Tiwary",
      "venue": "IEEE Access",
      "year": 2023,
      "url": "https://ieeexplore.ieee.org/abstract/document/10101783/",
      "cited_by": 21,
      "abstract": "Emotion recognition using EEG signals is an emerging area of research due to its broad  applicability in Brain-Computer Interfaces. Emotional feelings are hard to stimulate in the lab.",
      "short_author": "M Asif, S Mishra, MT Vinodbhai, US Tiwary"
    },
    {
      "title": "Dataset on emotion with naturalistic stimuli (DENS) on Indian samples",
      "author": "S Mishra, M Asif, N Srinivasan, US Tiwary",
      "venue": "bioRxiv",
      "year": 2021,
      "url": "https://www.biorxiv.org/content/10.1101/2021.08.04.455041.abstract",
      "cited_by": 14,
      "abstract": "Emotions are constructed and emerge through the dynamic interaction of multiple components.  It is difficult to capture the dynamics using static or artificial stimuli. Hence, there is a need",
      "short_author": "S Mishra, M Asif, N Srinivasan, US Tiwary"
    },
    {
      "title": "Naturalistic paradigm reveals multi-component emotion dynamics in theta and beta bands using DENS dataset",
      "author": "S Mishra, M Asif, US Tiwary",
      "venue": "bioRxiv",
      "year": 2021,
      "url": "https://www.biorxiv.org/content/10.1101/2021.08.05.455187.abstract",
      "cited_by": 0,
      "abstract": "The emotion research with artificial stimuli does not represent the dynamic processing of  emotions in real-life situations. The lack of data on emotion with the ecologically valid",
      "short_author": "S Mishra, M Asif, US Tiwary"
    },
    {
      "title": "Dynamic functional connectivity of emotion processing in beta band with naturalistic emotion stimuli",
      "author": "S Mishra, N Srinivasan, US Tiwary",
      "venue": "Brain sciences",
      "year": 2022,
      "url": "https://www.mdpi.com/2076-3425/12/8/1106",
      "cited_by": 16,
      "abstract": "While naturalistic stimuli, such as movies, better represent the complexity of the real world  and are perhaps crucial to understanding the dynamics of emotion processing, there is limited",
      "short_author": "S Mishra, N Srinivasan, US Tiwary"
    },
    {
      "title": "Cardiac–brain dynamics depend on context familiarity and their interaction predicts experience of emotional arousal",
      "author": "S Mishra, N Srinivasan, US Tiwary",
      "venue": "Brain Sciences",
      "year": 2022,
      "url": "https://www.mdpi.com/2076-3425/12/6/702",
      "cited_by": 17,
      "abstract": "Our brain continuously interacts with the body as we engage with the world. Although we  are mostly unaware of internal bodily processes, such as our heartbeats, they may be",
      "short_author": "S Mishra, N Srinivasan, US Tiwary"
    }
  ]
}