{
  "dataset_id": "ds003490",
  "num_citations": 4,
  "date_last_updated": "2025-07-26T18:48:08.876989+00:00",
  "metadata": {
    "total_cumulative_citations": 16,
    "fetch_date": "2025-07-26T18:48:08.876989+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Dynamic channelwise functional-connectivity states extracted from resting-state EEG signals of patients with Parkinson’s disease",
      "author": "H Ding, X Weng, M Xu, J Shen, Z Wu",
      "venue": "The Egyptian Journal of Neurology, Psychiatry and Neurosurgery",
      "year": 2024,
      "url": "https://link.springer.com/article/10.1186/s41983-024-00839-3",
      "cited_by": 2,
      "abstract": "Background Parkinson’s disease (PD) is a progressive neurodegenerative disease that  usually happens to elderly people, with a wide range of motor and dementia symptoms. An",
      "short_author": "H Ding, X Weng, M Xu, et al.",
      "publisher": "Springer",
      "pages": "62",
      "volume": "60",
      "journal": "The Egyptian Journal of Neurology, Psychiatry and Neurosurgery",
      "pub_type": "article",
      "bib_id": "ding2024dynamic"
    },
    {
      "title": "Transfreq: A Python package for computing the theta-to-alpha transition frequency from resting state EEG data",
      "author": "E Vallarino, S Sommariva, D Arnaldi, F Famà, M Piana",
      "venue": "bioRxiv",
      "year": 2021,
      "url": "https://www.biorxiv.org/content/10.1101/2021.12.03.471064.abstract",
      "cited_by": 4,
      "abstract": "A classic approach to estimate the individual theta-to-alpha transition frequency requires two  electroencephalographic (EEG) recordings, one acquired in restingstate condition and one",
      "short_author": "E Vallarino, S Sommariva, D Arnaldi, et al."
    },
    {
      "title": "The more, the better? Evaluating the role of EEG preprocessing for deep learning applications",
      "author": "F Del Pup, A Zanola, LF Tshimanga, A Bertoldo",
      "venue": "arXiv preprint arXiv:2411.18392",
      "year": 2024,
      "url": "https://arxiv.org/abs/2411.18392",
      "cited_by": 2,
      "abstract": "Consequently, it makes possible the merging of the ds002778 and ds003490 datasets for  the Parkinson’s task. For dataset ds004362 (EEGMMI - motor imagery task), whose records",
      "short_author": "F Del Pup, A Zanola, LF Tshimanga, A Bertoldo",
      "journal": "arXiv preprint arXiv:2411.18392",
      "pub_type": "article",
      "bib_id": "del2024more"
    },
    {
      "title": "Parkinson's disease is characterized by sub-second resting-state spatio-oscillatory patterns: A contribution from deep convolutional neural network",
      "author": "M Shabanpour, N Kaboodvand, B Iravani",
      "venue": "NeuroImage: Clinical",
      "year": 2022,
      "url": "https://www.sciencedirect.com/science/article/pii/S221315822200331X",
      "cited_by": 8,
      "abstract": "Deep convolutional neural network (DCNN) provides a multivariate framework to detect relevant  spatio-oscillatory patterns in the data beyond common mass-univariate statistics. Yet, its",
      "short_author": "M Shabanpour, N Kaboodvand, B Iravani"
    }
  ]
}