{
  "dataset_id": "ds003474",
  "num_citations": 9,
  "date_last_updated": "2025-07-24T22:17:25.952336+00:00",
  "metadata": {
    "total_cumulative_citations": 19,
    "fetch_date": "2025-07-24T22:17:25.952336+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Analysis of depressive EEG signals via symbolic phase transfer entropy with an adaptive template method",
      "author": "H Wang, Q Zhang, Y Luo, Q Wang, S Zhu, W Yi",
      "venue": "AIP Advances",
      "year": 2024,
      "url": "https://pubs.aip.org/aip/adv/article/14/6/065115/3297622",
      "cited_by": 1,
      "abstract": "Depression is a prevalent mental disorder in contemporary society. Symbolic phase transfer  entropy can quantify the dynamic interaction and information flow between",
      "short_author": "H Wang, Q Zhang, Y Luo, et al."
    },
    {
      "title": "Spectral, phase, and their interacting components for complexity analysis of depression electroencephalogram",
      "author": "Y Luo, S Zhu, J Yu, J Ding, Z Xia, W Lu, Q Wang, W Yi",
      "venue": "AIP Advances",
      "year": 2025,
      "url": "https://pubs.aip.org/aip/adv/article/15/3/035023/3339539",
      "cited_by": 0,
      "abstract": "Depression is a severe mental disorder, and patients suffering from depression differ  significantly from those in the control group in terms of electroencephalogram (EEG) signal",
      "short_author": "Y Luo, S Zhu, J Yu, et al."
    },
    {
      "title": "Excessive propagation of right frontal beta oscillations in patients with a history of major depressive disorder",
      "author": "D Sihn, SP Kim",
      "venue": "Biomedical Engineering Letters",
      "year": 2025,
      "url": "https://link.springer.com/article/10.1007/s13534-024-00433-9",
      "cited_by": 0,
      "abstract": "Patients suffering from various neurological disorders, including major depressive disorder (MDD),  often exhibit abnormal brain connectivity. In particular, patients with MDD show",
      "short_author": "D Sihn, SP Kim"
    },
    {
      "title": "A novel approach to learning models on EEG data using graph theory features—A comparative study",
      "author": "B Prakash, GK Baboo, V Baths",
      "venue": "Big Data and Cognitive Computing",
      "year": 2021,
      "url": "https://www.mdpi.com/2504-2289/5/3/39",
      "cited_by": 8,
      "abstract": "Brain connectivity is studied as a functionally connected network using statistical methods  such as measuring correlation or covariance. The non-invasive neuroimaging techniques",
      "short_author": "B Prakash, GK Baboo, V Baths"
    },
    {
      "title": "Application of Graph Theory Features towards EEG Data Classification Models for Working Memory and The Emotional States",
      "author": "G KB, B Prakash, V Baths",
      "venue": "Journal Not Specified",
      "year": 2021,
      "url": "https://www.preprints.org/frontend/manuscript/5dd86102fce52ab85658b51b06191dbd/download_pub",
      "cited_by": 0,
      "abstract": "Functional Connectivity analysis using Electroencephalography signals is a common 1 practice.  The EEG signals, converted to networks by transforming the signals into a correlation 2",
      "short_author": "G KB, B Prakash, V Baths"
    },
    {
      "title": "EEG datasets for healthcare: A scoping review",
      "author": "C Peres da Silva, S Tedesco, B O'Flynn",
      "venue": "NA",
      "year": 2024,
      "url": "https://cora.ucc.ie/items/e4c14a93-4db4-4788-852e-1c9e44132270",
      "cited_by": 0,
      "abstract": "The rapidly evolving landscape of artificial intelligence (AI) and machine learning has placed  data at the forefront of healthcare innovation. Electroencephalography (EEG) has gained",
      "short_author": "C Peres da Silva, S Tedesco, B O'Flynn"
    },
    {
      "title": "EEG datasets for healthcare: a scoping review",
      "author": "CP Da Silva, S Tedesco, B O'Flynn",
      "venue": "IEEE Access",
      "year": 2024,
      "url": "https://ieeexplore.ieee.org/abstract/document/10466559/",
      "cited_by": 7,
      "abstract": "The rapidly evolving landscape of artificial intelligence (AI) and machine learning has placed  data at the forefront of healthcare innovation. Electroencephalography (EEG) has gained",
      "short_author": "CP Da Silva, S Tedesco, B O'Flynn"
    },
    {
      "title": "ARTEFACTS REMOVAL FROM BRAIN EEG SIGNALS USING ADAPTIVE ALGORITHMS",
      "author": "J HATALA",
      "venue": "NA",
      "year": 0,
      "url": "https://theses.cz/id/i4p8dx/bachelor_thesis_Archive.pdf",
      "cited_by": 0,
      "abstract": "This thesis covers the problem of artifacts in electroencephalography (EEG) data and the  methods used to remove them with a focus on adaptive filtering. Artifacts are an unavoid able",
      "short_author": "J HATALA"
    },
    {
      "title": "The deep learning method for predict beck's depression inventory score using EEG",
      "author": "M Kang, SH Oh, KS Oh, S Kang",
      "venue": "2021 International Conference on Information and Communication Technology Convergence (ICTC)",
      "year": 2021,
      "url": "https://ieeexplore.ieee.org/abstract/document/9620922/",
      "cited_by": 3,
      "abstract": "Early diagnosis of depression is very important. In particular, predicting the severity of  depression is very important as it can provide appropriate treatment for people with depression.",
      "short_author": "M Kang, SH Oh, KS Oh, S Kang",
      "pages": "490--493",
      "pub_type": "inproceedings",
      "bib_id": "kang2021deep"
    }
  ]
}