{
  "dataset_id": "ds004752",
  "num_citations": 4,
  "date_last_updated": "2025-07-24T22:17:25.908028+00:00",
  "metadata": {
    "total_cumulative_citations": 1,
    "fetch_date": "2025-07-24T22:17:25.908028+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Identifying Epileptogenic Brain Tissue by Automated Detection of Biomarkers in Electrophysiological Recordings in Epilepsy Patients",
      "author": "V Dimakopoulos",
      "venue": "NA",
      "year": 2024,
      "url": "https://www.zora.uzh.ch/id/eprint/262035/",
      "cited_by": 0,
      "abstract": "In selected patients with drug-resistant focal epilepsy, epilepsy surgery is the treatment of  choice and may eliminate the occurrence of seizures completely. High frequency oscillations (",
      "short_author": "V Dimakopoulos"
    },
    {
      "title": "Re-evaluating human MTL in working memory: insights from intracranial recordings",
      "author": "J Li, D Cao, W Li, J Sarnthein, T Jiang",
      "venue": "Trends in Cognitive Sciences",
      "year": 2024,
      "url": "https://www.cell.com/trends/cognitive-sciences/abstract/S1364-6613(24)00195-5",
      "cited_by": 0,
      "abstract": "The study of human working memory (WM) holds significant importance in neuroscience; yet,  exploring the role of the medial temporal lobe (MTL) in WM has been limited by the",
      "short_author": "J Li, D Cao, W Li, et al."
    },
    {
      "title": "Electrophysiological Brain Network Estimation with Simultaneous Scalp EEG and Intracranial EEG: Inference Algorithm and Applications",
      "author": "S Yang, F Liu",
      "venue": "bioRxiv",
      "year": 2024,
      "url": "https://www.biorxiv.org/content/10.1101/2024.04.16.589846.abstract",
      "cited_by": 0,
      "abstract": "Activity in the human brain is composed of complex firing patterns and interactions among  neurons and neuronal circuits. The neuroimaging field underwent a paradigm shift over the",
      "short_author": "S Yang, F Liu"
    },
    {
      "title": "Dataset of Intracranial EEG, Scalp EEG and Beamforming Sources from Epilepsy Patients Performing a Verbal Working Memory Task",
      "author": "V Dimakopoulos, L Stieglitz, L Imbach, J Sarnthein",
      "venue": "NA",
      "year": 0,
      "url": "n/a",
      "cited_by": 1,
      "short_author": "V Dimakopoulos, L Stieglitz, L Imbach, J Sarnthein"
    }
  ]
}