{
  "dataset_id": "ds004389",
  "num_citations": 3,
  "date_last_updated": "2025-07-26T18:48:08.866193+00:00",
  "metadata": {
    "total_cumulative_citations": 5,
    "fetch_date": "2025-07-26T18:48:08.866193+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Somatosensory high frequency oscillations across the human central nervous system",
      "author": "E Bailey, B Nierula, T Stephani, V Nikulin, F Eippert",
      "venue": "bioRxiv",
      "year": 2024,
      "url": "https://www.biorxiv.org/content/10.1101/2024.11.16.622608.abstract",
      "cited_by": 0,
      "abstract": "Sensory information processing in the central nervous system (CNS) requires both post-synaptic  responses and spiking activity, with human electroencephalography (EEG) research",
      "short_author": "E Bailey, B Nierula, T Stephani, et al."
    },
    {
      "title": "A multichannel electrophysiological approach to noninvasively and precisely record human spinal cord activity",
      "author": "B Nierula, T Stephani, E Bailey, M Kaptan",
      "venue": "Plos Biology",
      "year": 2024,
      "url": "https://journals.plos.org/Plosbiology/article?id=10.1371/journal.pbio.3002828",
      "cited_by": 0,
      "abstract": "The spinal cord is of fundamental importance for integrative processing in brain–body  communication, yet routine noninvasive recordings in humans are hindered by vast",
      "short_author": "B Nierula, T Stephani, E Bailey, M Kaptan",
      "publisher": "Public Library of Science San Francisco, CA USA",
      "pages": "e3002828",
      "volume": "22",
      "journal": "Plos Biology",
      "pub_type": "article",
      "bib_id": "nierula2024multichannel"
    },
    {
      "title": "Non-invasive multi-channel electrophysiology of the human spinal cord–assessing somatosensory processing from periphery to cortex",
      "author": "B Nierula, T Stephani, M Kaptan, A Mouraux, B Maess",
      "venue": "bioRxiv",
      "year": 2022,
      "url": "https://www.biorxiv.org/content/10.1101/2022.12.05.519148.abstract",
      "cited_by": 5,
      "abstract": "The spinal cord is of fundamental importance for somatosensory processing and plays a  significant role in various pathologies, such as chronic pain. However, knowledge on spinal",
      "short_author": "B Nierula, T Stephani, M Kaptan, et al."
    }
  ]
}