{
  "dataset_id": "ds003670",
  "num_citations": 7,
  "date_last_updated": "2025-07-24T22:17:25.942613+00:00",
  "metadata": {
    "total_cumulative_citations": 22,
    "fetch_date": "2025-07-24T22:17:25.942613+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "A Scalable framework for closed-loop neuromodulation with deep learning",
      "author": "N Gebodh, V Miskovic, S Laszlo, A Datta, M Bikson",
      "venue": "bioRxiv",
      "year": 2023,
      "url": "https://pmc.ncbi.nlm.nih.gov/articles/PMC9882307/",
      "cited_by": 1,
      "abstract": "Closed-loop neuromodulation measures dynamic neural or physiological activity to optimize  interventions for clinical and nonclinical behavioral, cognitive, wellness, attentional, or",
      "short_author": "N Gebodh, V Miskovic, S Laszlo, et al."
    },
    {
      "title": "A Scalable Framework for Closed-Loop Neuromodulation with",
      "author": "N Gebodh, V Miskovic, S Laszlo, A Datta, M Bikson",
      "venue": "Sciences",
      "year": 2022,
      "url": "https://drive.google.com/file/d/12QccdMCam6Xc1rgkTsWHt1HRlXzH7WQY/view",
      "cited_by": 0,
      "abstract": "Closed-loop neuromodulation measures dynamic neural or physiological activity to optimize  2 interventions for clinical and nonclinical behavioral, cognitive, wellness, attentional, or",
      "short_author": "N Gebodh, V Miskovic, S Laszlo, et al."
    },
    {
      "title": "Dataset of concurrent EEG, ECG, and behavior with multiple doses of transcranial electrical stimulation",
      "author": "N Gebodh, Z Esmaeilpour, A Datta, M Bikson",
      "venue": "Scientific Data",
      "year": 2021,
      "url": "https://www.nature.com/articles/s41597-021-01046-y",
      "cited_by": 18,
      "abstract": "We present a dataset combining human-participant high-density electroencephalography (EEG)  with physiological and continuous behavioral metrics during transcranial electrical",
      "short_author": "N Gebodh, Z Esmaeilpour, A Datta, M Bikson"
    },
    {
      "title": "Modulation of vigilance/alertness using beta (30 Hz) transcranial alternating current stimulation",
      "author": "Z Chu, R Wang, T Zhou",
      "venue": "Frontiers in Neuroscience",
      "year": 2025,
      "url": "https://www.frontiersin.org/journals/neuroscience/articles/10.3389/fnins.2025.1445006/full",
      "cited_by": 0,
      "abstract": "Vigilance refers to the ability to maintain alertness and sustain attention for prolonged  periods to detect and respond to subtle changes in the environment. Previous research has",
      "short_author": "Z Chu, R Wang, T Zhou"
    },
    {
      "title": "DLMEKL: Design of an Efficient Deep Learning Model for Analyzing the Effect of ECG and EEG Disturbances on Kidney, Lungs and Liver Functions",
      "author": "S Nair",
      "venue": "International Conference on Advanced Communication and Intelligent Systems",
      "year": 2023,
      "url": "https://link.springer.com/chapter/10.1007/978-3-031-45124-9_6",
      "cited_by": 0,
      "abstract": "Correlative analysisfor identification of body organ malfunction is a complex multidomain  task, that involves collection and processing of correlative parameters for different organs. To",
      "short_author": "S Nair",
      "pages": "70--84",
      "pub_type": "inproceedings",
      "bib_id": "nair2023dlmekl"
    },
    {
      "title": "ARTEFACTS REMOVAL FROM BRAIN EEG SIGNALS USING ADAPTIVE ALGORITHMS",
      "author": "J HATALA",
      "venue": "NA",
      "year": 0,
      "url": "https://theses.cz/id/i4p8dx/bachelor_thesis_Archive.pdf",
      "cited_by": 0,
      "abstract": "This thesis covers the problem of artifacts in electroencephalography (EEG) data and the  methods used to remove them with a focus on adaptive filtering. Artifacts are an unavoid able",
      "short_author": "J HATALA"
    },
    {
      "title": "Dataset of concurrent EEG, ECG, and behavior with multiple doses of transcranial electrical stimulation-BIDS",
      "author": "N Gebodh, Z Esmaeilpour, A Datta, M Bikson",
      "venue": "NA",
      "year": 0,
      "url": "n/a",
      "cited_by": 3,
      "short_author": "N Gebodh, Z Esmaeilpour, A Datta, M Bikson"
    }
  ]
}