{
  "dataset_id": "ds004771",
  "num_citations": 4,
  "date_last_updated": "2025-07-26T18:48:08.930424+00:00",
  "metadata": {
    "total_cumulative_citations": 5,
    "fetch_date": "2025-07-26T18:48:08.930424+00:00",
    "processing_version": "1.0"
  },
  "citation_details": [
    {
      "title": "Computer programmers show distinct, expertise-dependent brain responses to violations in form and meaning when reading code",
      "author": "CH Kuo, CS Prat",
      "venue": "Scientific Reports",
      "year": 2024,
      "url": "https://www.nature.com/articles/s41598-024-56090-6",
      "cited_by": 4,
      "abstract": "As computer programming becomes more central to the workforce, the need for better models  of how it is effectively learned has become more apparent. The current study addressed",
      "short_author": "CH Kuo, CS Prat"
    },
    {
      "title": "Programmers show distinct, language-like brain responses to violations in form and meaning when reading code",
      "author": "CH Kuo, C Prat",
      "venue": "NA",
      "year": 2023,
      "url": "https://www.researchsquare.com/article/rs-3396298/latest",
      "cited_by": 1,
      "abstract": "As computer programming becomes more central to the workforce, the need for better models  of how it is effectively taught and learned has become more apparent. The current study",
      "short_author": "CH Kuo, C Prat"
    },
    {
      "title": "EEG Transformer for Classifying Students' Epistemic Cognition States in Educational Contexts",
      "author": "RYY Chan",
      "venue": "IEEE Access",
      "year": 2025,
      "url": "https://ieeexplore.ieee.org/abstract/document/10870110/",
      "cited_by": 0,
      "abstract": "Epistemic cognition encompasses the processes by which individuals achieve knowledge  and understanding and is pivotal in human learning, typically in educational settings. Despite",
      "short_author": "RYY Chan"
    },
    {
      "title": "Beatrix: Out-of-Distribution Generalization of Large EEG Model via Invariant Contrastive Fine-Tuning",
      "author": "R Zheng, D Zhang, Z Yuan, J Chen, Y Yang",
      "venue": "NA",
      "year": 0,
      "url": "https://openreview.net/forum?id=IjBndR92Zy",
      "cited_by": 0,
      "abstract": "The advent of large-scale foundation models has revolutionized EEG analysis; however,  their ability to generalize to Out-of-Distribution (OoD) brain signals remains limited due to the",
      "short_author": "R Zheng, D Zhang, Z Yuan, et al."
    }
  ]
}