{
  "dataset_id": "ds002336",
  "date_retrieved": "2025-07-31T00:20:18.149295+00:00",
  "dataset_description": {
    "ReferencesAndLinks": [
      "Perronnet, Lorraine, L Anatole, Marsel Mano, Elise Bannier, Maureen Clerc, Christian Barillot, Lorraine Perronnet, et al. 2017. “Unimodal Versus Bimodal EEG-FMRI Neurofeedback of a Motor Imagery Task.” Frontiers in Human Neuroscience 11 (193). https://doi.org/10.3389/fnhum.2017.00193.",
      "Giulia Lioi, Claire Cury, Lorraine Perronnet, Marsel Mano, Elise Bannier, Anatole Lecuyer, Christian Barillot. Simultaneous MRI-EEG during a motor imagery neurofeedback task: an open access brain imaging dataset for multi-modal data integration.  bioRxiv 862375; doi: https://doi.org/10.1101/862375"
    ],
    "Funding": [
      "This work was supported by the French Natinal Research Agency under the reference ANR-10-LABX-07-01"
    ],
    "Name": "A multi-modal human neuroimaging dataset for data integration: simultaneous EEG and fMRI acquisition during a motor imagery neurofeedback task: XP1",
    "License": "CC0",
    "BIDSVersion": "1.2.0",
    "Authors": [
      "Giulia Lioi",
      "Claire Cury",
      "Lorraine Perronnet",
      "Marsel Mano",
      "Elise Bannier",
      "Anatole Lecuyer",
      "Christian Barillot"
    ],
    "Acknowledgments": "MRI data acquisition was supported by the Neurinfo MRI research facility at the University Hospital of Rennes, which is granted by the European Union and the French Gouvernment.",
    "HowToAcknowledge": "",
    "Acknowledgements": "MRI data acquisition was supported by the Neurinfo MRI research facility at the University Hospital of Rennes, which is granted by the European Union and the French Gouvernment",
    "DatasetDOI": "10.18112/openneuro.ds002336.v2.0.2"
  },
  "readme_content": "————————————————————————————————\nORIGINAL PAPERS\n————————————————————————————————\n\nLioi, G., Cury, C., Perronnet, L., Mano, M., Bannier, E., Lécuyer, A., & Barillot, C. (2019). Simultaneous MRI-EEG during a motor imagery neurofeedback task: an open access brain imaging dataset for multi-modal data integration Authors. BioRxiv. https://doi.org/https://doi.org/10.1101/862375\n\nMano, Marsel, Anatole Lécuyer, Elise Bannier, Lorraine Perronnet, Saman Noorzadeh, and Christian Barillot. 2017. “How to Build a Hybrid Neurofeedback Platform Combining EEG and FMRI.” Frontiers in Neuroscience 11 (140). https://doi.org/10.3389/fnins.2017.00140\nPerronnet, Lorraine, L Anatole, Marsel Mano, Elise Bannier, Maureen Clerc, Christian Barillot, Lorraine Perronnet, et al. 2017. “Unimodal Versus Bimodal EEG-FMRI Neurofeedback of a Motor Imagery Task.” Frontiers in Human Neuroscience 11 (193). https://doi.org/10.3389/fnhum.2017.00193.\n\nThis dataset named XP1 can be pull together with the dataset XP2, available here : https://openneuro.org/datasets/ds002338.\nData acquisition methods have been described in Perronnet et al. (2017, Frontiers in Human Neuroscience).\nSimultaneous 64 channels EEG and fMRI during right-hand motor imagery and neurofeedback (NF) were acquired in this study (as well as in XP2). For this study, 10 subjects performed three types of NF runs (bimodal EEG-fMRI NF, unimodal EEG-NF and fMRI-NF). \n\n————————————————————————————————\nEXPERIMENTAL PARADIGM\n————————————————————————————————         \nSubjects were instructed to perform a kinaesthetic motor imagery of the right hand and to find their own strategy to control and bring the ball to the target.\nThe experimental protocol consisted of 6 EEG-fMRI runs with a 20s block design alternating rest and task\nmotor localizer run (task-motorloc) - 8 blocks X (20s rest+20 s task)\nmotor imagery run without NF (task-MIpre) -5 blocks X (20s rest+20 s task)\nthree NF runs with different NF conditions (task-eegNF, task-fmriNF, task-eegfmriNF) occurring in random order- 10 blocks X (20s rest+20 s task)\nmotor imagery run without NF (task-MIpost) - 5 blocks X (20s rest+20 s task)\n\n\n————————————————————————————————\nEEG DATA\n————————————————————————————————\nEEG data was recorded using a 64-channel MR compatible solution from Brain Products (Brain Products GmbH, Gilching, Germany).\n\nRAW EEG DATA\n\nEEG was sampled at 5kHz with FCz as the reference electrode and AFz as the ground electrode, and a resolution of 0.5 microV. Following the BIDs arborescence, raw eeg data for each task can be found for each subject in\n\nXP1/sub-xp1*/eeg\n\nin Brain Vision Recorder format (File Version 1.0). Each raw EEG recording includes three files: the data file (*.eeg), the header file (*.vhdr) and the marker file (*.vmrk). \nThe header file contains information about acquisition parameters and amplifier setup. For each electrode, the impedance at the beginning of the recording  is also specified. For all subjects, channel 32 is the ECG channel. The 63 other channels are EEG channels.\n\nThe marker file contains the list of markers assigned to the EEG recordings and their properties (marker type, marker ID and position in data points). Three type of markers are relevant for the EEG processing:\nR128 (Response): is the fMRI volume marker to correct for the gradient artifact\nS 99 (Stimulus): is the protocol marker indicating the start of the Rest block\nS  2 (Stimulus): is the protocol marker indicating the start of the Task (Motor Execution Motor Imagery or Neurofeedback)  \nWarning : in few EEG data, the first S99 marker might be missing, but can be easily “added” 20 s before the first S 2.  \n\nPREPROCESSED EEG DATA\n\nFollowing the BIDs arborescence, processed eeg data for each task and subject in the pre-processed data folder :\n\nXP1/derivatives/sub-xp1*/eeg_pp/*eeg_pp.*\n\nand following the Brain Analyzer format. Each processed EEG recording includes three files: the data file (*.dat), the header file (*.vhdr) and the marker file (*.vmrk), containing information similar to those described for raw data. In the header file of preprocessed data channels location are also specified. In the marker file the location in data points of the identified heart pulse (R marker) are specified as well. \n\nEEG data were pre-processed using BrainVision Analyzer II Software, with the following steps:\nAutomatic gradient artifact correction using the artifact template subtraction method (Sliding average calculation with 21 intervals for sliding average and all channels enabled for correction.\nDownsampling with factor: 25 (200 Hz)\nLow Pass FIR Filter:Cut-off Frequency: 50 Hz.\nBallistocardiogram (pulse) artifact correction using a semiautomatic procedure (Pulse Template searched between 40 s and 240 s in the ECG channel with the following parameters:Coherence Trigger = 0.5, Minimal Amplitude = 0.5, Maximal Amplitude = 1.3. The identified pulses were marked with R.\nSegmentation relative to the first block marker (S 99) for all the length of the training protocol (las S 2 + 20 s).\n\nEEG NF SCORES\n\nNeurofeedback scores can be found in the .mat structures in\n\nXP1/derivatives/sub-xp1*/NF_eeg/d_sub*NFeeg_scores.mat\n\nStructures names NF_eeg are composed of the following subfields:\n\nNF_eeg\n→ .nf_laterality (NF score computed as for real-time calculation - equation (1))              \n→ .filteegpow_left (Bandpower of the filtered eeg signal in C1)\n→ .filteegpow_right (Bandpower of the filtered eeg signal in C2)\n→ .nf (vector of NF scores -4 per s- computed as in eq 3) for comparison with XP2\n→ .smoothed\n→ .eegdata (64 X 200 X 400 matrix, with the pre-processed EEG signals according to the steps described above)\n→ .method\n\nWhere the subfield method contains information about the laplacian filtered used and the frequency band of interest.\n\n\n————————————————————————————————\nBOLD fMRI DATA\n————————————————————————————————\nAll DICOM files were converted to Nifti-1 and then in BIDs format (version 2.1.4) using the software dcm2niix (version v1.0.20190720 GVV7.4.0)\n\nfMRI acquisitions were performed using echo- planar imaging (EPI) and covering the entire brain with the following parameters \n\n3T Siemens Verio\nEPI sequence\nTR=2 s\nTE=23 ms\nResolution 2x2x4 mm3\nFOV = 210×210mm2\nN of slices: 32\nNo slice gap\n\n\nAs specified in the relative task event files in XP1\\ *events.tsv files onset, the scanner began the EPI pulse sequence two seconds prior to the start of the protocol (first rest block), so the the first two TRs should be discarded. \nThe useful TRs for the runs are therefore\n\ntask-motorloc: 320 s (2 to 322)\ntask-MIpre and task-MIpost: 200 s (2 to 202)\ntask-eegNF, task-fmriNF, task-eegfmriNF: 400 s (2 to 402)\n\nIn task events files for the different tasks, each column represents:\n\n- 'onset': onset time (sec) of an event\n- 'duration': duration (sec) of the event\n- 'trial_type': trial (block) type: rest or task (Rest, Task-ME, Task-MI, Task-NF)\n- ''stim_file’: image presented in a stimulus block: during Rest, Motor Imagery (Task-MI) or Motor execution (Task-ME) instructions were presented. On the other hand, during Neurofeedback blocks (Task-NF) the image presented was a ball moving in a square that the subject could control self-regulating his EEG and/or fMRI brain activity.\n\nFollowing the BIDs arborescence, the functional data and relative metadata are found for each subject in the following directory\n\nXP1/sub-xp1*/func\n\nBOLD-NF SCORES\n\nFor each subject and NF session, a matlab structure with BOLD-NF features can be found in \n\nXP1/derivatives/sub-xp1*/NF_bold/\n\nFor each subject and NF session, a Matlab structure with BOLD-NF features can be found in\n \nXP1/derivatives/sub-xp1*/NF_bold/\n \nIn view of BOLD-NF scores computation, fMRI data were preprocessed using SPM8 and with the following steps: slice-time correction, spatial realignment and coregistration with the anatomical scan, spatial smoothing with a 6 mm Gaussian kernel and normalization to the Montreal Neurological Institute (MNI) template.\nFor each session, a first level general linear model analysis was then performed. The resulting activation maps (voxel-wise Family-Wise error corrected at p < 0.05) were used to define two ROIs (9x9x3 voxels) around the maximum of activation in the left and right motor cortex. The BOLD-NF scores (fMRI laterality index) were calculated as the difference between percentage signal change in the left and right motor ROIs as for the online NF calculation. A smoothed and normalized version of the NF scores over the precedent three volumes was also computed. To allow for comparison and aggregation of the two datasets XP1 and XP2 we also computed NF scores considering the left motor cortex and a background as for online NF calculation in XP2.\n \nIn the NF_bold folder, the Matlab files sub-xp1*_task-*_NFbold_scores.mat  have therefore the following structure :\n \nNF_bold\n→ .nf_laterality (calculated as for online NF calculation)\n→ .smoothnf_laterality\n→ .normnf_laterality\n→ .nf (calculated as for online NF calculation in XP2)\n→ .roimean_left (averaged BOLD signal in the left motor ROI)\n→ .roimean_right (averaged BOLD signal in the right motor ROI)\n→ .bgmean (averaged BOLD signal in the background slice)\n→ .method\n \nWhere the subfield \".method\" contains information about the ROI size (.roisize), the background mask (.bgmask) and ROI masks (.roimask_left,.roimask_right ). More details about signal processing and NF calculation can be found in Perronnet et al. 2017 and Perronnet et al. 2018.\n\n\n————————————————————————————————\nANATOMICAL MRI DATA\n————————————————————————————————\nAs a structural reference for the fMRI analysis, a high resolution 3D T1 MPRAGE sequence was acquired with the following parameters\n\n3T Siemens Verio\n3D T1 MPRAGE\nTR=1.9 s\nTE=22.6 ms\nResolution 1x1x1 mm3\nFOV = 256×256 mm2\nN of slices: 176\n\nDefacing of MPRAGE T1 images was performed by the submitter using pydeface (https://github.com/poldracklab/pydeface) \n\nFollowing the BIDs arborescence, the functional data and relative metadata are found for each subject in the following directory\n\nXP1/sub-xp1*/anat\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds002336",
    "exists": true,
    "description": null,
    "created_at": "2019-12-04T15:26:30+00:00",
    "updated_at": "2025-02-21T02:05:36+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}