{
  "dataset_id": "ds002338",
  "date_retrieved": "2025-07-31T00:22:13.656057+00:00",
  "dataset_description": {
    "ReferencesAndLinks": [
      "Perronnet, Lorraine, L Anatole, Marsel Mano, Maureen Clerc, Fabien Lotte, and Christian Barillot. 2018. “Learning 2-in-1 : Towards Integrated EEG-FMRI-Neurofeedback.” BioRxiv, no. 397729. https://doi.org/10.1101/397729."
    ],
    "DatasetDOI": "10.18112/openneuro.ds002338.v2.0.1",
    "Funding": [
      "This work was supported by the French Natinal Research Agency under the reference ANR-10-LABX-07-01"
    ],
    "Name": "A multi-modal human neuroimaging dataset for data integration: simultaneous EEG and fMRI acquisition during a motor imagery neurofeedback task: XP2",
    "License": "CC0",
    "BIDSVersion": "1.2.0",
    "Authors": [
      "Giulia Lioi",
      "Claire Cury",
      "Lorraine Perronnet",
      "Marsel Mano",
      "Elise Bannier",
      "Anatole Lecuyer",
      "Christian Barillot"
    ],
    "Acknowledgments": "MRI data acquisition was supported by the Neurinfo MRI research facility at the University Hospital of Rennes, which is granted by the European Union and the French Gouvernment.",
    "HowToAcknowledge": ""
  },
  "readme_content": "————————————————————————————————\nORIGINAL PAPERS\n————————————————————————————————\nLioi, G., Cury, C., Perronnet, L., Mano, M., Bannier, E., Lécuyer, A., & Barillot, C. (2019). Simultaneous MRI-EEG during a motor imagery neurofeedback task: an open access brain imaging dataset for multi-modal data integration Authors. Accepted for publication in Scientific Data. https://doi.org/https://doi.org/10.1101/862375\nMano, Marsel, Anatole Lécuyer, Elise Bannier, Lorraine Perronnet, Saman Noorzadeh, and Christian Barillot. 2017. “How to Build a Hybrid Neurofeedback Platform Combining EEG and FMRI.” Frontiers in Neuroscience 11 (140). https://doi.org/10.3389/fnins.2017.00140\nLorraine Perronnet, Anatole Lecuyer, Marsel Mano, Mathis Fleury, Giulia Lioi, Claire Cury, Maureen Clerc, Fabien Lotte, and Christian Barillot. 2018. “Learning 2-in-1 : Towards Integrated EEG-FMRI-Neurofeedback.” BioRxiv, no. 397729. https://doi.org/10.1101/397729.\n\n————————————————————————————————\nOVERVIEW\n————————————————————————————————\nThis dataset XP2 can be pull together with the dataset XP1, available here : https://openneuro.org/datasets/ds002336.\nData acquisition methods have been described in Perronnet et al. (2017, Frontiers in Human Neuroscience).\nSimultaneous 64 channel EEG and fMRI during right-hand motor imagery and neurofeedback (NF) were acquired in this study (as well as in XP1). This study involved 16 subjects randomly assigned to two groups: in a first group they performed bimodal EEG-fMRI NF with a bi-dimensional feedback metaphor, in the second group the same task was executed with a mono-dimensional feedback.\n\n————————————————————————————————\nEXPERIMENTAL PARADIGM\n————————————————————————————————\n\nThe experimental protocol consisted of 5 EEG-fMRI runs with a 20s block design alternating rest and task. 1 block = 20s rest + 20s task. Task description :\n_task-MIpre : motor imagery run without NF. 8 blocks.\n_task-1dNF or _task-2dNF : bimodal neurofeedback, with either a mono-dimensional neurofeedback display (mean of EEG NF and fMRI NF scores), either a bi-dimensional display (one modality per dimension). The list of subjects with 1d or 2d is given above.\nEach subjects had 3 runs. 8 blocks per run.\n_task-MIpost : motor imagery run without NF. 8 blocks.\nSubjects with mono-dimensional feedback display :\nxp201 : 1D\nxp202 : 1D\nxp203 : 1D\nxp206 : 1D\nxp211 : 1D\nxp218 : 1D\nxp219 : 1D\nxp220 : 1D\nxp222 : 1D\n\nSubjects with bi-dimensional feedback display :\nxp204 : 2D\nxp205 : 2D\nxp207 : 2D\nxp210:  2D\nxp213 : 2D\nxp216 : 2D\nxp217 : 2D\nxp221 : 2D\n\n————————————————————————————————\nEEG DATA\n————————————————————————————————\nEEG data was recorded using a 64-channel MR compatible solution from Brain Products (Brain Products GmbH, Gilching, Germany).\n\nRAW EEG DATA\n\nEEG was sampled at 5kHz with FCz as the reference electrode and AFz as the ground electrode, and a resolution of 0.5 microV. Following the BIDs arborescence, raw eeg data for each task can be found for each subject in\n\nXP2/sub-xp2*/eeg\n\nin Brain Vision Recorder format (File Version 1.0). Each raw EEG recording includes three files: the data file (*.eeg), the header file (*.vhdr) and the marker file (*.vmrk). \nThe header file contains information about acquisition parameters and amplifier setup. For each electrode, the impedance at the beginning of the recording  is also specified. For all subjects, channel 32 is the ECG channel. The 63 other channels are EEG channels.\n\nThe marker file contains the list of markers assigned to the EEG recordings and their properties (marker type, marker ID and position in data points). Three type of markers are relevant for the EEG processing:\nR128 (Response): is the fMRI volume marker to correct for the gradient artifact\nS 99 (Stimulus): is the protocol marker indicating the start of the Rest block\nS  2 (Stimulus): is the protocol marker indicating the start of the Task (Motor Execution Motor Imagery or Neurofeedback)  \nWarning : in few EEG data, the first S99 marker might be missing, but can be easily “added” 20 s before the first S 2.  \n\nPREPROCESSED EEG DATA\n\nFollowing the BIDs arborescence, processed eeg data for each task can be found for each subject in\n\nXP2/derivatives/sub-xp2*/eeg_pp/*eeg_pp.*\n\nand following the Brain Analyzer format. Each processed EEG recording includes three files: the data file (*.dat), the header file (*.vhdr) and the marker file (*.vmrk), containing information similar to those described for raw data. In the header file of preprocessed data channels location are also specified. In the marker file the location in data points of the identified heart pulse (R marker) are specified as well. \n\nEEG data were pre-processed using BrainVision Analyzer II Software, with the following steps:\nAutomatic gradient artifact correction using the artifact template subtraction method (Sliding average calculation with 21 intervals for sliding average and all channels enabled for correction.\nDownsampling with factor: 25 (200 Hz)\nLow Pass FIR Filter:Cut-off Frequency: 50 Hz.\nBallistocardiogram (pulse) artifact correction using a semiautomatic procedure (Pulse Template searched between 40 s and 240 s in the ECG channel with the following parameters:Coherence Trigger = 0.5, Minimal Amplitude = 0.5, Maximal Amplitude = 1.3). A Pulse Artifact marker  R was associated to each identified pulse.\nSegmentation relative to the first block marker (S 99) for all the length of the training protocol (las S 2 + 20 s).\n\nEEG-NF SCORES\n\nNeurofeedback scores can be found in the .mat structures in\n\nXP2/derivatives/sub-xp2*/NF_eeg/d_sub*NFeeg_scores.mat\n\nStructures names NF_eeg are composed by the following subfields:\nID : Subject ID, for example sub-xp201\nlapC3_ERD : a 1x1280 vector of neurofeedback scores. 4 scores per secondes, for the whole session.\neeg : a 64x80200 matrix, with the pre-processed EEG signals with the step described above, filtered between 8 and 30 Hz.\nlapC3_bandpower_8Hz_30Hz : 1x1280 vector. Bandpower of the filtered signal with a laplacian centred on C3, used to estimate the lapC3_ERD.\nlapC3_filter : 1x64 vector. Laplacian filter centred above C3 channel.\n————————————————————————————————\nBOLD fMRI DATA\n————————————————————————————————\nAll DICOM files were converted to Nifti-1 and then in BIDs format (version 2.1.4) using the software dcm2niix (version v1.0.20190720 GVV7.4.0)\n\nfMRI acquisitions were performed using echo- planar imaging (EPI) and covered the superior half of the brain with the following parameters \n3T Siemens Verio\nEPI sequence\nTR=1 s\nTE=23 ms\nResolution 2x2x4 mm\nN of slices: 16\nNo slice gap\n\n\nAs specified in the relative task event files in XP2\\ *events.tsv files onset, the scanner began the EPI pulse sequence two seconds prior to the start of the protocol (first rest block), so the the first two TRs should be discarded. \n\nThe useful TRs for the runs are therefore\n\n-task-MIpre and task-MIpost: 320 s (2 to 302)\n-task-1dNF and task-2dNF:  320 s (2 to 302)\n\nIn task events files for the different tasks, each column represents:\n\n- 'onset': onset time (sec) of an event\n- 'duration': duration (sec) of the event\n- 'trial_type': trial (block) type: rest or task (Rest, Task-MI, Task-NF)\n- 'stim_file': image presented in a stimulus block. During Rest or  Motor Imagery (Task-MI) instructions were presented to the subject. On the other hand, during Neurofeedback blocks (Task-NF) the image presented was a ball moving in a square for the bidimensional NF (task-2dNF) or a ball moving along a gauge for the unidimensional NF (task-1dNF)  that the subject could control self-regulating his EEG and fMRI brain activity.\n\nFollowing the BIDs arborescence, the functional data and relative metadata are found for each subject in the following directory\n\nXP2/sub-xp2*/func\n\nBOLD-NF SCORES\n\nFor each subject and NF session, a matlab structure with BOLD-NF features can be found in \n\nXP2/derivatives/sub-xp2*/NF_bold/\n\nIn view of BOLD-NF scores computation, fMRI data were preprocessed using AutoMRI, a software based on spm8 and with the following steps: slice-time correction, spatial realignment and coregistration with the anatomical scan, spatial smoothing with a 8 mm Gaussian kernel and normalization to the Montreal Neurological Institute template \nFor each session, a first level general linear model analysis modeling was then performed. The resulting activation maps  (voxel-wise Family-Wise error corrected at p < 0.05)  were used to define two ROIs  (9x9x3 voxels) around the maximum of activation in the ipsilesional primary motor area (M1) and supplementary motor area (SMA) respectively. \n\nThe BOLD-NF scores were calculated as the difference between percentage signal change in the two ROIs (SMA and M1) and a large deep background region (slice 3 out of 16) whose activity is not correlated with the NF task. A smoothed version of the NF scores over the precedent three volumes was also computed. \n\nThe NF_boldi structure has the  following structure\n\nNF_bold\n                  → .m1→ .nf \n                              → .smoothnf    \n                              → .roimean   (averaged BOLD signal in the ROI) \n                              → .bgmean  (averaged BOLD signal in the background slice)\n                              → .method    \nNFscores.fmri\n                  → .sma→ .nf\n                              → .smoothnf    \n                              → .roimean   (averaged BOLD signal in the ROI) \n                              → .bgmean  (averaged BOLD signal in the background slice)\n                              → .method    \n\n\nWhere the subfield method contains information about the ROI size (.roisize), the background mask (.bgmask) and ROI mask (.roimask).\n\nMore details about signal processing and NF calculation can be found in Perronnet et al. 2017 and Perronnet et al. 2018.\n\n\n————————————————————————————————\nANATOMICAL MRI DATA\n————————————————————————————————\nAs a structural reference for the fMRI analysis, a high resolution 3D T1 MPRAGE sequence was acquired with the following parameters\n\n3T Siemens Verio\n3D T1 MPRAGE\nTR=1.9 s\nTE=22.6 ms\nResolution 1x1x1 mm3\nFOV = 256×256 mm2\nN of slices: 176\n\nDefacing of MPRAGE T1 images was performed by the submitter using pydeface (https://github.com/poldracklab/pydeface) \n\nFollowing the BIDs arborescence, the anatomical data and relative metadata are found for each subject in the following directory\n\nXP2/sub-xp2*/anat\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds002338",
    "exists": true,
    "description": null,
    "created_at": "2019-12-04T15:40:14+00:00",
    "updated_at": "2023-05-16T04:46:34+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}