{
  "dataset_id": "ds005343",
  "date_retrieved": "2025-07-31T00:19:54.591498+00:00",
  "dataset_description": {
    "ReferencesAndLinks": [
      "https://github.com/gaffreylab"
    ],
    "Authors": [
      "Armen Bagdasarov",
      "Michael S. Gaffrey"
    ],
    "Name": "Gaffrey Lab Infant Microstates and Attention",
    "License": "CC0",
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "Funding": [
      "Charles Lafitte Foundation"
    ],
    "EthicsApprovals": [
      "All research was approved by the Duke University Health System Institutional Review Board."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005343.v1.0.0"
  },
  "readme_content": "Participants were 43, 5-10-month-old infants. Their caregivers provided informed consent and compensation was provided for their participation. Infant-caregiver dyads were part of a larger study investigating the impact of bias and discrimination on prenatal and postnatal maternal health and infant development. All research was approved by the Duke University Health System Institutional Review Board and carried out in accordance with the Declaration of Helsinki. Infants sat on their caregiver’s lap and watched up to 15 minutes of relaxing videos with sound (i.e., 10, 90-second videos separated by breaks during which caregivers could play with their infant). Before each video started, an attention grabber (i.e., three-second video of a noisy rattle) directed the infant’s attention to the screen. Videos were presented with E-Prime software (Psychological Software Tools, Pittsburgh, PA). Caregivers were instructed to silently sit still during videos. If infants shifted their attention away from the screen, caregivers were permitted to re-direct their attention only by pointing to the screen. EEG was recorded at 1000 Hertz (Hz) and referenced to the vertex (channel Cz) using a 128-channel HydroCel Geodesic Sensor Net (Electrical Geodesics, Eugene, OR). Impedances were maintained below 50 kilohms throughout the EEG session. For more information, visit: https://github.com/gaffreylab/",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005343",
    "exists": true,
    "description": "OpenNeuro dataset - Gaffrey Lab Infant Microstates and Attention",
    "created_at": "2025-02-27T15:14:25+00:00",
    "updated_at": "2025-02-27T15:31:12+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}