{
  "dataset_id": "ds003421",
  "date_retrieved": "2025-07-31T00:12:46.588262+00:00",
  "dataset_description": {
    "Acknowledgements": "The dataset 2 has received a French government support granted to the CominLabs excellence laboratory and managed by the National Research Agency in the Investing for the Future program under reference ANR-10-LABX-07-01. We also thank the European Research Council for the ERC-2011-ADG - Grant Agreement N 290901 ? Acronym NEUCOD. Dataset 1 and dataset 2 were also supported by the Rennes University Hospital (dataset 1 COREC Project named conneXion, 2012-14; dataset 2: COREC Project named BrainGraph, 2015-17). The study was also funded by the National Council for Scientific Research (CNRS) in Lebanon. Authors would also like to thank the Lebanese Association for Scientific Research (LASER) for its support and the Institute of Clinical Neuroscience of Rennes (project named EEGCog).",
    "Authors": [
      "Ahmad Mheich",
      "Olivier Dufor",
      "Sahar Yassine",
      "Aya Kabbara",
      "Arnaud Biraben",
      "Fabrice Wendling",
      "Mahmoud Hassan"
    ],
    "BIDSVersion": "1.2",
    "KeyWords": [
      "Electroencephalography",
      "resting State",
      "Naming",
      "Audio",
      "Memory"
    ],
    "Name": "HD-EEGtask(Dataset 2)",
    "ReferencesAndLinks": [
      "Kabbara, A., Falou, W. E., Khalil, M., Wendling, F. & Hassan, M. The dynamic functional core network of the human brain at rest. Sci. Rep. 7, 2936 (2017)",
      "Hassan, M. et al. Dynamic reorganization of functional brain networks during picture naming. Cortex 73, 276?288 (2015).",
      "Mheich, A. et al. Spatiotemporal analysis of brain functional connectivity. in 6th European Conference of the International Federation for Medical and Biological Engineering 934?937 (Springer, 2015).",
      "Mheich, A. et al. SimiNet A Novel Method for Quantifying Brain Network Similarity. IEEE Trans. Pattern Anal. Mach. Intell. 40, 2238?2249 (2018).",
      "Rizkallah, J. et al. Dynamic reshaping of functional brain networks during visual object recognition. J. Neural Eng. 15, 056022 (2018)."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003421.v1.0.2",
    "License": "CC0"
  },
  "readme_content": "#    Dataset 2\n\n##   Presentation\n\n     This dataset was collected between 2014 and 2017 in Rennes (France) during four conditions (resting state, visual naming, auditory naming and working memory tasks).\n     All participants provided a written informed consent to participate in this study which was approved\n     by an independent ethics committee and authorized by the IRB \"Comite de Protection des Personnes\n     dans la Recherche Biomedicale Ouest V\" (CCPPRB-Ouest V). \n     The study name was \"Braingraph\" and study agreement number was 2014-A01461-46.\n     Its promoter was the Rennes University Hospital.\n\n     \n###  Participants\n\n     Twenty right-handed healthy volunteers (10 females, 10 males, mean age 23 years) participated \n     in this experiment. (See participants.json and participants.tsv for more details)\n\n\n#### Experiment\n\n     * The experiment begins with the verification of inclusion/exclusion criteria.\n     * The participants read the information notice and the consent form. \n     * Then they sign two questionnaires. \n     * One subject -->four conditions (resting state, visual naming, auditory naming and working memory).\n     * Resting state--> subject asked to relax for 10 min with their eyes open.\n     * Visual naming-->subject asked to name 80 pictures. 40 scrambled pictures were presented and participantس were asked to say nothing.\n     * Auditory naming--> subject asked to name 80 different sounds.\n     * Memory--> 80 pictures were displayed of which 40 have already been shown in the naming task. New pictures and already seen pictures randomly appeared on the screen and participants have to indicate if they have seen them before by pressing a button or not. \n\n\n\n#### EEG acquisition\n\n     * HD-EEG system (EGI, Electrical Geodesic Inc., 256 electrodes) \n     * Sampling frequency: 1000Hz\n     * Impedances were kept below 5k\n\n\n## Contact\n     * If you have any questions or comments, please contact: \n     * Ahmad Mheich: mheich.ahmad@gmail.com\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003421",
    "exists": true,
    "description": null,
    "created_at": "2020-12-09T00:08:04+00:00",
    "updated_at": "2020-12-13T17:42:16+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}