{
  "dataset_id": "ds004621",
  "date_retrieved": "2025-07-31T00:25:45.848768+00:00",
  "dataset_description": {
    "Name": "The Nencki-Symfonia EEG/ERP dataset",
    "BIDSVersion": "1.0.2",
    "License": "CC0",
    "Authors": [
      "Dzianok Patrycja",
      "Antonova Ingrida",
      "Wojciechowski Jakub",
      "Dreszer Joanna",
      "Kublik Ewa"
    ],
    "HowToAcknowledge": "Please cite this paper https://pubmed.ncbi.nlm.nih.gov/35254424/",
    "Funding": [
      "Polish National Science Center (NCN) grant no. 2016/20/W/NZ4/00354"
    ],
    "EthicsApprovals": [
      "This study was approved by the Research Ethics Committee, Faculty of Humanities, Nicolaus Copernicus University in Torun, Poland (No. 6/2018)"
    ],
    "ReferencesAndLinks": [
      "Dzianok P, Antonova I, Wojciechowski J, Dreszer J, Kublik E. Supporting data for 'The Nencki-Symfonia EEG/ERP dataset: Multiple cognitive tasks and resting-state data collected in a sample of healthy adults'. GigaScience Database, 2022. http://doi.org/10.5524/100990",
      "Dzianok P, Antonova I, Wojciechowski J, Dreszer J, Kublik E. The Nencki-Symfonia electroencephalography/event-related potential dataset: Multiple cognitive tasks and resting-state data collected in a sample of healthy adults. Gigascience. 2022 Mar 7;11:giac015. doi: 10.1093/gigascience/giac015"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004621.v1.0.4"
  },
  "readme_content": "The Nencki-Symfonia EEG/ERP dataset (dataset DOI: doi.org/10.5524/100990)\n\nIMPORTANT NOTE: The dataset contains no errors (BIDS-1). The numerous warnings currently displayed are a result of OpenNeuro updating its validator to BIDS-2. The OpenNeuro team is actively working on refining the validator to display only meaningful warnings (more information on OpenNeuro GitHub page). At this time, as dataset owners, we are unable to take any action to resolve these warnings.\n\nDescription: mixed cognitive tasks [(i) an extended multi-source interference task, MSIT+; (ii) a 3-stimuli oddball task; (iii) a control, simple reaction task, SRT; and (iv) a resting-state protocol]\n\nPlease cite the following references if you use these data:\n1. Dzianok P, Antonova I, Wojciechowski J, Dreszer J, Kublik E. The Nencki-Symfonia electroencephalography/event-related potential dataset: Multiple cognitive tasks and resting-state data collected in a sample of healthy adults. Gigascience. 2022 Mar 7;11:giac015. doi: 10.1093/gigascience/giac015.\n2. Dzianok P, Antonova I, Wojciechowski J, Dreszer J, Kublik E. Supporting data for \"The Nencki-Symfonia EEG/ERP dataset: Multiple cognitive tasks and resting-state data collected in a sample of healthy adults\" GigaScience Database, 2022. http://doi.org/10.5524/100990\n\nRelease history:\n\n26/01/2022: Initial release (GigaDB)\n\n15/06/2023: Added to OpenNeuro; updated README and dataset_description.json; minor updated to .json files related with BIDS errors/warnings. Updated events files (ms changed to s).\n\n12/10/2023: public release on OpenNeuro after deleting some additional, not needed system information from raw logfiles\n\n10/2024: minor correction of logfiles in the /sourcedata directory (MSIT and SRT) for sub-01 to sub-03\n\n02/2025 (v1.0.3): corrections to REST files for subjects sub-20 and sub-23 (EEG and .tsv files) – corrected marker names and removed redundant markers",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004621",
    "exists": true,
    "description": "OpenNeuro dataset - The Nencki-Symfonia EEG/ERP dataset",
    "created_at": "2023-10-12T13:02:00+00:00",
    "updated_at": "2025-06-21T10:57:12+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}