{
  "dataset_id": "ds003708",
  "date_retrieved": "2025-07-31T00:11:28.558516+00:00",
  "dataset_description": {
    "Name": "Basis profile curve identification to understand electrical stimulation effects in human brain networks",
    "BIDSVersion": "v 1.3.0",
    "License": "CC0",
    "Authors": [
      "Dora Hermes",
      "Gabriella Ojeda",
      "Kai J. Miller",
      "Multimodal Neuroimaging Laboratory at Mayo Clinic"
    ],
    "Acknowledgements": "Nicholas Gregg, Brian Lundstom, Kai Miller, Gregory Worrell, Cindy Nelson",
    "HowToAcknowledge": "This dataset is part of the paper on 'Basis profile curve identification to understand electrical stimulation effects in human brain networks' by Miller, Mueller and Hermes, 2021, https://www.biorxiv.org/content/10.1101/2021.01.24.428020v1.full. This project is funded by the National Institute Of Mental Health of the National Institutes of Health under Award Number R01MH122258 to Dora Hermes (Mayo Clinic). The data was collected by Dora Hermes (Mayo Clinic), Nick Gregg (Mayo Clinic), Brian Lundstrom (Mayo Clinic) and Cindy Nelson (Mayo Clinic). The BIDS formatting was performed by Dora Hermes (Mayo Clinic) and Gabriella Ojeda Valencia (Mayo Clinic). The iEEG data collection was facilitated by Gregory Worrell and Kai J. Miller (Mayo Clinic)",
    "Funding": [
      "R01 MH122258 CRCNS: Processing speed in the human connectome across the lifespan"
    ],
    "ReferencesAndLinks": [
      "https://doi.org/10.1101/2021.01.24.428020"
    ],
    "DatasetDOI": "10.18112/openneuro.ds003708.v1.0.0"
  },
  "readme_content": "--------\nThis dataset contains intracranial EEG recordings from one patient during single pulse electrical stimulation. These data were recorded at the Mayo Clinic in Rochester, MN, as part of the NIH Brain Initiative supported project R01 MH122258 \"CRCNS: Processing speed in the human connectome across the lifespan\". \n\nThe overarching goal of this project is to develop a large database of single pulse stimulation data and develop tools to advance our understanding of the human connectome across the lifespan. \n\n\nCiting this dataset\n-------------------\nThis dataset is part of the paper on 'Basis profile curve identification to understand electrical stimulation effects in human brain networks' by Miller, Mueller and Hermes, 2021, https://www.biorxiv.org/content/10.1101/2021.01.24.428020v1.full. This project was funded by the National Institute Of Mental Health of the National Institutes of Health under Award Number R01MH122258 to Dora Hermes (Mayo Clinic). The data was collected by Dora Hermes, Nick Gregg, Brian Lundstrom, Cindy Nelson, Gregg Worrell and Kai J. Miller. The BIDS formatting was performed by Dora Hermes and Gabriella Ojeda Valencia. \n\n\n\nFormat\n------\nIt is formatted according to BIDS version 1.3.0\n\n\nDetails about the single pulse stimulation experiment\n----------------------------\nPatients were resting in the hospital bed, while single pulse stimulation was performed with a frequency of ~0.2 Hz. The stimulation had a duration of 200 microseconds, was biphasic and had an amplitude of 6mA. On the motor cortex stimulation amplitude was sometimes reduced to 1 or 2mA to minimize movement artifacts.  \n\n\nContact\n----------------------------\nPlease contact Dora Hermes (hermes.dora@mayo.edu) for questions. \n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003708",
    "exists": true,
    "description": null,
    "created_at": "2021-06-23T18:55:59+00:00",
    "updated_at": "2021-06-23T18:56:12+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}