{
  "dataset_id": "ds003710",
  "date_retrieved": "2025-07-31T00:16:55.901729+00:00",
  "dataset_description": {
    "Name": "APPLESEED Example Dataset",
    "BIDSVersion": "v1.6.0",
    "License": "CC0",
    "Authors": [
      "Cabell L. Williams",
      "Meghan H. Puglia"
    ],
    "HowToAcknowledge": "Please cite: Puglia, M.H., Slobin, J.S., & Williams, C.L., 2021. The Automated Preprocessing Pipe-Line for the Estimation of Scale-wise Entropy from EEG Data (APPLESEED): Development and validation for use in pediatric populations. bioRxiv. https://doi.org/10.1101/2021.07.10.450198., and Puglia, M.H., Krol, K.M., Missana, M., Williams, C.L., Lillard, T.S., Morris, J.P., Connelly, J.J., & Grossmann, T. (2020). Epigenetic tuning of brain signal entropy in emergent human social behavior. BMC medicine, 18(1), 1-24. https://doi.org/10.1186/s12916-020-01683-x",
    "DatasetDOI": "doi:10.18112/openneuro.ds003710.v1.0.2",
    "DatasetType": "raw"
  },
  "readme_content": "The APPLESEED Example Dataset\n\nThis dataset consists of longitudinal EEG recordings from 13 infants at 4, 8, and 12 months of age. Test-retest reliability was assessed at 4 months of age via two appointments (session 1 & 2) that occurred within 1 week of each other. Session 3 data was recorded at 8 months of age and session 4 data was recorded at 12 months of age. Two participants did not return for longitudinal testing at sessions 3 & 4. Therefore, the complete dataset consists of 48 recording sessions, with reliability and longitudinal data (sessions 1-4) for 11 infants (6 F), and reliability data only (sessions 1 & 2) for an additional 2 infants. A channel location file and bin file for analysis are included in the \"code\" directory.\n\nThis dataset was used to develop and validate the Automated Preprocessing Pipe-Line for the Estimation of Scale-wise Entropy from EEG Data (APPLESEED) and is provided as an example dataset to accompany Puglia, M.H., Slobin, J.S., & Williams, C.L., 2022. The Automated Preprocessing Pipe-Line for the Estimation of Scale-wise Entropy from EEG Data (APPLESEED): Development and validation for use in pediatric populations. Developmental Cognitive Neuroscience, 101163.\n\nAPPLESEED code is available to download from https://github.com/mhpuglia/APPLESEED.\n\nThis dataset is part of a larger, ongoing longitudinal study initially described in Puglia, M.H., Krol, K.M., Missana, M., Williams, C.L., Lillard, T.S., Morris, J.P., Connelly, J.J. and Grossmann, T.,  2020. Epigenetic tuning of brain signal entropy in emergent human social behavior. BMC medicine, 18(1), pp.1-24. https://doi.org/10.1186/s12916-020-01683-x.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003710",
    "exists": true,
    "description": null,
    "created_at": "2021-07-12T19:50:52+00:00",
    "updated_at": "2022-10-24T20:01:12+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}