{
  "dataset_id": "ds004706",
  "date_retrieved": "2025-07-31T00:18:09.318851+00:00",
  "dataset_description": {
    "Name": "Spatial memory and non-invasive closed-loop stimulus timing",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Joseph H. Rudoler",
      "Matthew R. Dougherty",
      "Brandon S. Katerman",
      "James P. Bruska",
      "Woohyeuk Chang",
      "David J. Halpern",
      "Nicholas B. Diamond",
      "Michael J. Kahana"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004706.v1.0.0",
    "License": "CC0"
  },
  "readme_content": "﻿This dataset contains behavioral events and electrophysiological recordings from an experiment run in the Computational Memory Lab at the University of Pennsylvania from 2021-2022 with funding from U.S. Army Medical Research and Development Command (USAMRDC) through the Medical Technology Enterprise Consortium (MTEC) project MTEC-20-06-MOM-013, \"Restoring memory with task-independent semi-chronic closed-loop direct brain stimulation and non-invasive closed-loop stimulus timing optimization\". This experiment constitutes the non-invasive portion of the project, which targeted memory improvement through classifier-based stimulus presentation. \n\nThe experiment is a hybrid spatial-navigation and free recall paradigm in which subjects play the role of a courier delivering items to stores across a virtual town, and are subsequently asked to recall their deliveries. There are two phases - \"read-only\" and \"closed-loop\". In read-only sessions, there is no classifier-based timing manipulation and participants simply perform the task in order to generate training data for the models used in subsequent closed-loop sessions. After collecting sufficient training data, classifier models predict recall in closed-loop sessions and the stimulus presentation is timed to coincide with predicted good or bad memory encoding.   \n\nTwo publications are based on this experiment:\n[\"Neural correlates of memory in an immersive spatiotemporal context\"](https://www.biorxiv.org/content/10.1101/2022.11.30.518606) studies the navigation and memory dynamics in read-only sessions, and \"Optimizing learning via real-time neural decoding\" (link pending) explores the results of the closed-loop manipulation.\n\nNote: memory dynamics in closed-loop sessions are potentially influenced by the closed-loop timing manipulation, and so may be biased in a way that precludes them from analyses of general mnemonic function. The read-only sessions, however, were not subject to this manipulation and therefore can be used for studying spatial and episodic memory (as in the first paper mentioned above).\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004706",
    "exists": true,
    "description": "OpenNeuro dataset - Spatial memory and non-invasive closed-loop stimulus timing",
    "created_at": "2023-08-23T16:36:16+00:00",
    "updated_at": "2023-08-24T02:01:50+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}