{
  "dataset_id": "ds004483",
  "date_retrieved": "2025-07-31T00:25:11.566856+00:00",
  "dataset_description": {
    "Name": "ABSeqMEG",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Samuel Planton*",
      "Fosca Al Roumi*",
      "Liping Wang",
      "Stanislas Dehaene"
    ],
    "Acknowledgements": "",
    "HowToAcknowledge": "Please cite our preprint at https://www.biorxiv.org/content/10.1101/2022.10.15.512361v1 or the published version of this paper",
    "Funding": [
      "European Research Council (ERC, https://erc.europa.eu/) grant to S.D. (NeuroSyntax, ID: 695403)."
    ],
    "ReferencesAndLinks": [
      ""
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004483.v1.0.0",
    "License": "CC0"
  },
  "readme_content": "This dataset contains the MEG data from the article entitled Compression of binary sound sequences in human working memory https://www.biorxiv.org/content/10.1101/2022.10.15.512361v1 \n\nAccording to the language of thought hypothesis, regular sequences are compressed in human working memory using recursive loops akin to a mental program that predicts future items. We tested this theory by probing working memory for 16-item sequences made of two sounds. We recorded brain activity with functional MRI and magneto-encephalography (MEG) while participants listened to a hierarchy of sequences of variable complexity, whose minimal description required transition probabilities, chunking, or nested structures. Occasional deviant sounds probed the participants’ knowledge of the sequence. We predicted that task difficulty and brain activity would be proportional to minimal description length (MDL) in our formal language. Furthermore, activity should increase with MDL for learned sequences, and decrease with MDL for deviants. These predictions were upheld in both fMRI and MEG, indicating that sequence predictions are highly dependent on sequence structure and become weaker and delayed as complexity increases. The proposed language recruited bilateral superior temporal, precentral, anterior intraparietal and cerebellar cortices. These regions overlapped extensively with a localizer for mathematical calculation, and much less with spoken or written language processing. We propose that these areas collectively encode regular sequences as repetitions with variations and their recursive composition into nested structures.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004483",
    "exists": true,
    "description": "OpenNeuro dataset",
    "created_at": "2023-07-07T16:31:18+00:00",
    "updated_at": "2023-07-07T16:31:18+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}