{
  "dataset_id": "ds004951",
  "date_retrieved": "2025-07-31T00:27:02.793992+00:00",
  "dataset_description": {
    "Name": "Braille letters - EEG",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "Authors": [
      "Marleen Haupt",
      "Monika Graumann",
      "Santani Teng",
      "Carina Kaltenbach",
      "Radoslaw M. Cichy"
    ],
    "Funding": [
      "CI241/1-1",
      "CI241/3-1",
      "CI241/7-1",
      "ERC-StG-2018-803370"
    ],
    "License": "CC0",
    "DatasetDOI": "doi:10.18112/openneuro.ds004951.v1.0.0"
  },
  "readme_content": "This dataset contains the raw EEG data accompanying the paper \"The transformation of sensory to perceptual braille letter representations in the visually deprived brain\". Please cite the above paper if you use this data.\n\nThe dataset includes:\n\nBrainvision files (.eeg, .vhdr, .vmrk) for all participants.\n\nPlease note, for some participants the EEG decording had to be stopped and restarted within a session. In this case, the different files are indicated as separate runs. In addition, some participants completed a second session.\n\nThe events files contain the onsets, durations, trial types and values for all trials in the corresponding run. Stimuli are Braille letters (B,C,D,L,M,N,V,Z) presented on Braille cells under the left and right index fingers of participants. Triggers S1-8 are letters presented to the left hand, triggers S9-16 are letters presented to the right hand. \n\nOther triggers:\n\nstarttrigger         = S100;\ntrialonset           = S101;\nstimulusonset        = S222;\ncatchtrial           = S200;\npedalpress_correct   = S253;\npedalpress_incorrect = S254;\nendtrigger           = S255;\n\n\nFor a full description of the paradigm and the employed procedures please see the paper.  \n\nReferences for MNE BIDS conversion\n----------\nAppelhoff, S., Sanderson, M., Brooks, T., Vliet, M., Quentin, R., Holdgraf, C., Chaumon, M., Mikulan, E., Tavabi, K., Höchenberger, R., Welke, D., Brunner, C., Rockhill, A., Larson, E., Gramfort, A. and Jas, M. (2019). MNE-BIDS: Organizing electrophysiological data into the BIDS format and facilitating their analysis. Journal of Open Source Software 4: (1896). https://doi.org/10.21105/joss.01896\n\nPernet, C. R., Appelhoff, S., Gorgolewski, K. J., Flandin, G., Phillips, C., Delorme, A., Oostenveld, R. (2019). EEG-BIDS, an extension to the brain imaging data structure for electroencephalography. Scientific Data, 6, 103. https://doi.org/10.1038/s41597-019-0104-8\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004951",
    "exists": true,
    "description": "OpenNeuro dataset - Braille letters - EEG",
    "created_at": "2024-02-12T14:43:23+00:00",
    "updated_at": "2024-02-12T14:52:51+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}