{
  "dataset_id": "ds005261",
  "date_retrieved": "2025-07-31T00:16:59.202773+00:00",
  "dataset_description": {
    "Name": "Gloups_MEG",
    "BIDSVersion": "1.7.0",
    "License": "CC0",
    "DatasetType": "raw",
    "Authors": [
      "Snezana Todorovic",
      "Elin Runnqvist",
      "Valerie Chanoine",
      "Jean-Michel Badier"
    ],
    "Acknowledgements": "MEG data acquisition was performed in the MEG Centre (Timone Hospital, Marseille, France)",
    "Funding": [
      "This research has been supported by funding from the Institute of Convergence ILCB (France 2030, ANR-16-CONV-0002) and the Excellence Initiative of Aix-Marseille University A*MIDEX (ANR-11-IDEX-0001-02)"
    ],
    "ReferencesAndLinks": [
      "a data paper",
      "a resource to be cited when using the data"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005261.v3.0.0",
    "GeneratedBy": [
      {
        "Name": "MNE-BIDS",
        "Version": "0.14",
        "Description": "MNE-BIDS is a Python package that allows you to read and write BIDS-compatible datasets with the help of MNE-Python."
      }
    ],
    "SourceDatasets": [
      {
        "DOI": "doi:10.18112/openneuro.ds005261.v2.0.0",
        "URL": "https://openneuro.org/datasets/ds005261",
        "Version": "2.0.0"
      }
    ]
  },
  "readme_content": "\nREADME\n\nSeventeen adult participants completed a learning task and a resting-state condition during MEG recording (4D NeuroImaging system with 248 magnetometer channels).\n\nCurrent dataset: OpenNeuro MEG Dataset ds005261 (Gloups_MEG, https://openneuro.org/datasets/ds005261/versions/2.0.0; see Todorović et al., in revision).\n\n\nThe same participants performed an identical learning task during fMRI scanning.\n\nRelated dataset: OpenNeuro fMRI Dataset ds004597 (Gloups, https://openneuro.org/datasets/ds004597/versions/2.0.0; see Todorović et al., 2023).\n\n\nNote: Participant identifiers differ between the fMRI and MEG datasets. For details, refer to Table 1 in Todorović et al., in revision.\n\n\n\n\n﻿References MNE-BIDS\n-------------------\nAppelhoff, S., Sanderson, M., Brooks, T., Vliet, M., Quentin, R., Holdgraf, C., Chaumon, M., Mikulan, E., Tavabi, K., Höchenberger, R., Welke, D., Brunner, C., Rockhill, A., Larson, E., Gramfort, A. and Jas, M. (2019). MNE-BIDS: Organizing electrophysiological data into the BIDS format and facilitating their analysis. Journal of Open Source Software 4: (1896). https://doi.org/10.21105/joss.01896\n\nNiso, G., Gorgolewski, K. J., Bock, E., Brooks, T. L., Flandin, G., Gramfort, A., Henson, R. N., Jas, M., Litvak, V., Moreau, J., Oostenveld, R., Schoffelen, J., Tadel, F., Wexler, J., Baillet, S. (2018). MEG-BIDS, the brain imaging data structure extended to magnetoencephalography. Scientific Data, 5, 180110. https://doi.org/10.1038/sdata.2018.110\n\nTodorović, S., Anton, J.-L., Sein, J., Nazarian, B., Chanoine, V., Rauchbauer, B., Kotz, S. A., & Runnqvist, E. (2023). Cortico-Cerebellar Monitoring of Speech Sequence Production. Neurobiology of Language, 1–21.\n\nTodorović, S., Chanoine, V., Nazarian, B., Badier, J-M., Kanzari, K., Brovelli, A., Kotz, S. A., & Runnqvist, E. (in revision). Dataset for Evaluating the Production of Phonotactically Legal and Illegal Pseudowords. Scientific Data.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005261",
    "exists": true,
    "description": "OpenNeuro dataset - Gloups_MEG",
    "created_at": "2024-10-09T16:33:46+00:00",
    "updated_at": "2025-05-12T07:28:14+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}