{
  "dataset_id": "ds003082",
  "date_retrieved": "2025-07-31T00:22:31.700207+00:00",
  "dataset_description": {
    "Name": "Auditory Cortex Mapping Dataset",
    "BIDSVersion": "1.2.0",
    "License": "CC0",
    "Authors": [
      "Jonathan Cote",
      "Etienne de Villers-Sidani"
    ],
    "HowToAcknowledge": "please  acknowledge its authors (Jonathan Cote, Jean-Pierre R. Falet, Veronica Tarka , Zaida-Escila Martinez-Moreno and Etienne de Villers-Sidani) and cite the mapping  technique publication (under review).",
    "Funding": [
      "This work was funded in part by grants from the Natural Sciences and Engineering Research Council of Canada (NSERC), the Centre for Research on Brain, Language and Music (CRBLM), and the Reseau quebecois de recherche sur le vieillissement (RQRV)."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003082.v1.0.0"
  },
  "readme_content": "# Brainstorm - Auditory Cortex Mapping Dataset\r\n\r\n## License\r\n\r\nThis dataset (MEG and MRI data) was collected by Jonathan Cote of the Neuroplasticity and Sensory Biomarking Lab, Montreal Neurological Institute, McGill University, Canada. Its purpose is to serve as a data example to be used with our MEG-based auditory cortex mapping technique. It is presently released in the Public Domain, and is not subject to copyright in any jurisdiction.\r\n\r\nWe would appreciate though that you reference this dataset in your publications: please acknowledge its authors (Jonathan Cote and Etienne de Villers-Sidani) and cite the mapping technique publication (under review)\r\n \r\nThis dataset will first be a single subject, but might be expanded up to the 10 participants in the future.\r\n\r\n## Presentation of the experiment\r\n\r\n#### Experiment\r\n\r\n* One subject, one acquisition run of around 12 minutes\r\n* Subject stimulated binaurally with intra-aural earphones (air tubes+transducers)\r\n* The run contains:\r\n    * 1795 iso-intensity pure tones (IIPT)\r\n    * The frequency of these ranges between 100 Hz and 21527 Hz, spaced by 1/4 octave.\r\n* Random inter-stimulus interval: randomized but averaging at a presentation rate of 3Hz\r\n* The subject passively listened while looking at a fixation cross\r\n* Auditory stimuli generated with the Matlab Psychophysics toolbox\r\n\r\n\r\n#### MEG acquisition\r\n\r\n* Acquisition at **120000Hz**, with a **CTF 275** system, subject in seating position\r\n* Recorded at the Montreal Neurological Institute in January 2015\r\n* Anti-aliasing low-pass filter at 3000Hz, files saved with the 3rd order gradient\r\n* Recorded channels (340):\r\n    * 1 Trigger channel indicating the presentation times of the audio stimuli: UADC001 (#306)\r\n    * 26 MEG reference sensors (#4-#29)\r\n    * 272 MEG axial gradiometers (#30-#302)\r\n    * 1 ECG bipolar (#303)\r\n    * 2 EOG bipolar (vertical #304, horizontal #305)\r\n    * 3 Unused channels (#1-#3)\r\n* 3 datasets:\r\n    * **sub-0001_ses-0001_task-mapping_run-01_meg.ds**: Run #1, 653s, 1795 IIPT, sampled at 12000 Hz\r\n\r\n    * **sub-emptyroom_ses-0001_emptyroom_run-01_meg.ds**: Empty room recording, 120s long, sampled at 12000 Hz\r\n\r\n    * **sub-emptyroom_ses-0001_emptyroom_run-02_meg.ds**: Empty room recording, 120s long, sampled at 2400 Hz\r\n\r\n* Use of the .ds, not the AUX (standard at the MNI) because they are easier to manipulate in FieldTrip\r\n\r\n#### Stimulation delays\r\n\r\n\r\n* **Delay #1**: Transmission of the sound.   \r\nBetween when the sound card plays the sound and when the subject receives the sound in the ears. This is the time it takes for the transducer to convert the analog audio signal into a sound, plus the time it takes to the sound to travel through the air tubes from the transducer to the subject's ears. This delay cannot be estimated from the recorded signals: before the acquisition, we placed a sound meter at the extremity of the tubes to record when the sound is delivered. Delay **between 4.8ms and 5.0ms** (std = 0.08ms). At a sampling rate of 2400Hz, this delay can be considered **constant**, we will not compensate for it.\r\n* **Delay #2**: Recording of the signals.   \r\nThe CTF MEG systems have a constant delay of **4 samples** between the MEG/EEG channels and the analog channels (such as the audio signal UADC001), because of an anti-aliasing filtered that is applied to the first and not the second. This translate here to a **constant delay** of **1.7ms**.\r\n* **Uncorrected delays**: We will  keep the delays. We decide not to compensate for these delays because they do not introduce any jitter in the responses and they are not going to change anything in the interpretation of the data.\r\n\r\n#### Head shape and fiducial points\r\n\r\n* 3D digitization using a Polhemus Fastrak device driven by Brainstorm (S01_20131218_*.pos)\r\n* More information: [Digitize EEG electrodes and head shape][1]\r\n* The output file is copied to each .ds folder and contains the following entries:\r\n    * The position of the center of CTF coils\r\n    * The position of the anatomical references we use in Brainstorm: Nasion and connections tragus/helix, as illustrated [here][2].\r\n\r\n* Around 150 head points distributed on the hard parts of the head (no soft tissues)\r\n\r\n#### Subject anatomy\r\n* Subject with 1.5T MRI\r\n* Processed with FreeSurfer 5.3\r\n\r\n\r\n[1]: http://neuroimage.usc.edu/brainstorm/Tutorials/TutDigitize\r\n[2]: http://neuroimage.usc.edu/brainstorm/CoordinateSystems#Pre-auricular_points_.28LPA.2C_RPA.29",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003082",
    "exists": true,
    "description": null,
    "created_at": "2020-11-30T22:13:31+00:00",
    "updated_at": "2020-11-30T22:13:44+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}