{
  "dataset_id": "ds004572",
  "date_retrieved": "2025-07-31T00:18:42.088050+00:00",
  "dataset_description": {
    "Name": "The effects of sham hypnosis techniques",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Zoltan Kekecs",
      "Yeganeh Farahzadi",
      "Kyra Girán",
      "Vanda Vizkievicz",
      "Anna Lutoskin"
    ],
    "Funding": [
      "Hungarian National Research, Development and Innovation Office (NKFIH, Grant No.: FK 132248)"
    ],
    "License": "CC0",
    "DatasetDOI": "doi:10.18112/openneuro.ds004572.v1.3.0"
  },
  "readme_content": "52 participants (39 females) took part in this study and their brain electrophysiological activity were being recorded using 64-channel EasyCap from Brain Products. After mounting the EEG electrode cap, the study protocol started with 5 minutes of closed-eyes rest (Pre-hypnosis Baseline), followed by four experimental conditions (Experimental Blocks), and ended with another 5 minutes of closed-eyes rest (Post-hypnosis Baseline). Throughout the four Experimental Blocks, participants were exposed to either conventional or unconventional (placebo) hypnotic inductions described either as hypnosis or as simple relaxation technique in a 2 x 2 balanced placebo design. In other words, each participant underwent four trials, in which they were exposed to a conventional hypnosis induction presented as “hypnosis”; a conventional hypnosis induction presented as “control”; an unconventional hypnosis induction presented as “hypnosis”; and an unconventional hypnosis induction presented as “control” in a randomized order.\n\nFor detailed information on our data collection methods, refer to the public trial registry on the Open Science Framework: https://doi.org/10.17605/OSF.IO/WVHDA.\n\nPublications based on this dataset:\n- https://www.nature.com/articles/s41598-024-56633-x\n\n- https://osf.io/preprints/psyarxiv/k3h5f",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004572",
    "exists": true,
    "description": "OpenNeuro dataset - The effects of sham hypnosis techniques",
    "created_at": "2023-05-25T11:00:02+00:00",
    "updated_at": "2025-04-29T22:36:37+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}