{
  "dataset_id": "ds003690",
  "date_retrieved": "2025-07-31T00:11:38.880020+00:00",
  "dataset_description": {
    "Name": "EEG, ECG and pupil data from young and older adults: rest and auditory cued reaction time tasks",
    "ReferencesAndLinks": [
      "Ribeiro M.J. and Castelo-Branco M. 2019 Age-related differences in event-related potentials and pupillary responses in cued reaction time tasks. Neurobiology of Aging. Vol. 73: 177-189 PMID: 30366291 DOI: 10.1016/j.neurobiolaging.2018.09.028 ",
      "Ribeiro MJ, Castelo-Branco M. 2019. Neural correlates of anticipatory cardiac deceleration and its association with the speed of perceptual decision-making, in young and older adults. Neuroimage. Jun 5;199:521-533. PMID: 31173904 DOI: 10.1016/j.neuroimage.2019.06.004"
    ],
    "BIDSVersion": "v1.2.1",
    "License": "CC0",
    "Authors": [
      "Maria J. Ribeiro",
      "Miguel Castelo-Branco"
    ],
    "HowToAcknowledge": "For EEG and pupil data, please cite: Ribeiro M.J. and Castelo-Branco M. 2019 Age-related differences in event-related potentials and pupillary responses in cued reaction time tasks. Neurobiology of Aging. Vol. 73: 177-189 PMID: 30366291 DOI: 10.1016/j.neurobiolaging.2018.09.028. For ECG data, please cite: Ribeiro MJ, Castelo-Branco M. 2019. Neural correlates of anticipatory cardiac deceleration and its association with the speed of perceptual decision-making, in young and older adults. Neuroimage. Jun 5;199:521-533. PMID: 31173904 DOI: 10.1016/j.neuroimage.2019.06.004",
    "Funding": [
      "This work was funded by Fundação para a Ciência e a Tecnologia (Grants: SFRH/BPD/102188/2014 and UID/NEU/04539/2013-COMPETE, POCI-01-0145-FEDER-00 7440, PACeMEDPERSYST, POCI-01-0145-FEDER-30852, POCI-01-0145-FEDER-016428, BIGDATIMAGE, CENTRO-01-0145-FEDER-000016, financed by Centro 2020 FEDER, COMPETE)."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003690.v1.0.0"
  },
  "readme_content": "Age-related differences in EEG, ECG and pupilography during auditory cued reaction time tasks\n\nIn this study, we acquired the electroencephalogram (EEG), pupilogram and electrocardiogram (ECG) while a group of young (N = 36) and a group of older (N = 39) adults were engaged in auditory cued reaction time tasks (active tasks) or passively listening to the auditory stimulus used as temporal cue, presented with the same frequency as in the active tasks (passive task - 4 minutes acquired at the beginning of the session).\n\nThe active tasks were a cued simple reaction time task and a cued go/no-go task. In the active tasks, 16% of the trials were cue only trials (the cue was presented but no target followed).\n\nThe order of the active tasks was counterbalanced across participants and were acquired in two runs of 8 minutes per task. In each task, we acquired 120 trials. In the simple reaction time task, 100 trials were cue-target trials and 20 trials were cue-only. In the go/no-go task, 80 trials were cue-go trials, 20 were cue-no-go trials, and 20 trials were cue-only trials.\n\nParticipants were fixating a grey computer screen with a lighter grey fixation cross at the center. The auditory stimuli were single-frequency signals (pure tones) with duration 250 ms, with the following frequencies: cue 1500 Hz; go stimulus 1700 Hz; no-go stimulus 1300 Hz; and error feedback signal 1000 Hz.\n\nThe sounds were played at around 67 dB(A) from a hi-fi speakers system. All stimuli were suprathreshold.\n\nEEG signal was recorded using a 64-channel Neuroscan system with scalp electrodes placed according to the International 10-20 electrode placement standard, with reference between the electrodes CPz and Cz and ground between FPz and Fz. Acquisition rate was 500 Hz. Vertical and horizontal electrooculograms were recorded to monitor eye movements and blinks. Bipolar electrocardiogram (ECG) electrodes were placed on the chest. During data acquisition, the participants head was stabilized with a chin and forehead rest. Consequently, the electrodes on the forehead, FP1, FPz, and FP2, displayed signal fluctuation artifacts due to the pressure on the forehead rest. These were excluded from the recordings.\n\nElectrode positions were measured using a 3D-digitizer Fastrak (Polhemus, VT, USA) and imported into the EEGLAB files.\n\nPupil data was acquired with iView X Hi-Speed 1250 system from SMI with a sampling rate of 240 Hz. Pupil data was imported into the EEG dataset with the EYE-EEG EEGLAB plugin.\n\nSynchronized EEG, ECG and pupil data are included in separate channels in the EEGLAB .set files.\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003690",
    "exists": true,
    "description": null,
    "created_at": "2021-06-10T09:04:26+00:00",
    "updated_at": "2021-06-10T09:04:45+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}