{
  "dataset_id": "ds003195",
  "date_retrieved": "2025-07-31T00:18:26.141324+00:00",
  "dataset_description": {
    "Name": "Placebo Neuroepo multisession",
    "BIDSVersion": "1.2.0",
    "Authors": [
      "Maria Luisa Bringas Vega",
      "Lilia Morales Chacon ",
      "Ivonne Pedroso Ibanez"
    ],
    "DatasetDOI": "10.18112/openneuro.ds003195.v1.0.3",
    "License": "CC0",
    "Funding": [
      "National Nature and Science Foundation of China (NSFC) No. 61871105, 61673090, 81330032",
      "CNS Program of UESTC (No. Y0301902610100201)"
    ],
    "Acknowledgements": "The authors will like to thank Centro Internacional de Restauracion Neurologica for the recruitment and neurophysiological evaluation of the patients and the support of the Ministry of Public Health of the Republic of Cuba. The authors are in debt with all the PD patients and their caretakers who volunteered to participate in our study. "
  },
  "readme_content": "The quest for neuroprotection in Parkinson’s disease (PD) has been for new compounds to slow disease progression and stable and non-invasive biomarkers to document their benefits. Neuroepo, a new formulation of EPO with low content of sialic acid reported good results in animal model and tolerance in healthy participants and PD patients. \nIn a double-blind randomized placebo (https://clinicaltrials.gov/ number NCT04110678) twenty-five PD patients were assigned randomly to Neuroepo (n=15) or placebo (n=10) groups we reported the tolerance of the drug. We recorded resting-state EEG before and six months after the administration of the drug. The qualitative analysis of the abnormalities of the EEG was evaluated by two experts using a Likert-type scale and a multivariate item response theory (MIRT) approach was employed to stablish the differences between groups in the two times. The quantitative EEG (qEEG) analysis was performed at the sources looking for generators of the neural activity using software VARETA and co-registering the results using the Montreal Neurological Institute Atlas. The statistical analysis between the sources was conducted using a permutation test and later a contrast method using the surfstat software between groups and before vs after condition, with Bonferroni correction for multiple comparisons.\nHere in this repository we placed the raw EEG in BIDS format  (Pernet, C. R. et al. EEG-BIDS, an extension to the brain imaging data structure for electroencephalography. Sci. data 6, 103 (2019). For the use of VARETA the qEEG program you can use (Bosch-Bayard, J. et al. A Quantitative EEG Toolbox for the MNI Neuroinformatics Ecosystem: Normative SPM of EEG Source Spectra. Front. Neuroinform. 14, (2020).)\nThe EEG dataset from the different stages of processing can be requested to the authors. \n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003195",
    "exists": true,
    "description": null,
    "created_at": "2020-10-13T00:44:33+00:00",
    "updated_at": "2020-10-13T02:53:49+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}