{
  "dataset_id": "ds004944",
  "date_retrieved": "2025-07-31T00:27:06.043232+00:00",
  "dataset_description": {
    "Name": "Dataset of BCI2000-compatible intraoperative ECoG with neuromorphic encoding",
    "BIDSVersion": "1.4.0",
    "License": "CC0",
    "Authors": [
      "Filippo Costa",
      "Niklaus Krayenbühl",
      "Georgia Ramantani",
      "Ece Boran",
      "Kristina König",
      "Johannes Sarnthein"
    ],
    "Acknowledgements": "We thank V. Dimakopoulos for help in reformating the data to BIDS. We acknowledge a grant awarded by the Swiss National Science Foundation (funded by the SNSF 204651 to JS and GI with GR and NK as project partners). The funders had no role in the design or analysis of the study.",
    "HowToAcknowledge": "If using the raw data, please cite: Ece Boran, Georgia Ramantani, Niklaus Krayenbühl, Maxine Schreiber, Kristina König, Tommaso Fedele, Johannes Sarnthein **High-density ECoG improves the detection of high frequency oscillations that predict seizure outcome**, _Clinical Neurophysiology_ [https://doi.org/10.1016/j.clinph.2019.07.008]\n\nIf using the derivatives, please cite: Filippo Costa, Eline Schaft, Geertjan Huiskamp, Erik Aarnoutse, Maryse van’t Klooster, Niklaus Krayenbühl, Georgia Ramantani, Maeike Zijlmans, Giacomo Indiveri, Johannes Sarnthein, **Robust compression and detection of epileptiform patterns in ECoG using a real-time spiking neural network hardware framework**, _Nature Communications_ [https://doi.org/10.1038/s41467-024-47495-y]",
    "Funding": [
      "Swiss National Science Foundation, SNSF 204651"
    ],
    "EthicsApprovals": [
      "The collection of patient data and their analysis was approved and performed in accordance with the guidelines",
      "and regulations of the local research ethics committee (Kantonale Ethikkommission Zürich 2018–02171).",
      "All patients and/or their parents provided informed consent to reuse their clinical data for research purposes."
    ],
    "ReferencesAndLinks": [
      "Ece Boran, Georgia Ramantani, Niklaus Krayenbühl, Maxine Schreiber, Kristina König, Tommaso Fedele, Johannes Sarnthein **High-density ECoG improves the detection of high frequency oscillations that predict seizure outcome**, _Clinical Neurophysiology_ [https://doi.org/10.1016/j.clinph.2019.07.008]",
      "Filippo Costa, Eline Schaft, Geertjan Huiskamp, Erik Aarnoutse, Maryse van’t Klooster, Niklaus Krayenbühl, Georgia Ramantani, Maeike Zijlmans, Giacomo Indiveri, Johannes Sarnthein, **Robust compression and detection of epileptiform patterns in ECoG using a real-time spiking neural network hardware framework**, _Nature Communications_ [https://doi.org/10.1038/s41467-024-47495-y]"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004944.v1.1.0"
  },
  "readme_content": "## Overview\n\nThis dataset comprises recordings of intraoperative Electrocorticography (ECoG) from 22 patients undergoing resective epilepsy surgery.\nFor each patient, the dataset is organized into pre-resection recording (referred to as SITUATION1A) and post-resection recording (referred to as SITUATION2A).\n\nWe provide raw ECoG recordings for each patient and a derivative folder that contains all the main processing stages \nperformed with our neuromorphic processing pipeline: [https://doi.org/10.1038/s41467-024-47495-y](https://doi.org/10.1038/s41467-024-47495-y).\n\nThe pipeline preprocesses ECoG recordings in real-time and performs Asynchronous Delta Modulator (ADM) encoding with a custom BCI2000 module.\nThe ADM-encoded data are processed by a hardware Spiking Neural Network (SNN). The SNN-encoded data are then used to detect epileptiform patterns in the ECoG.\nThe code to perform preprocessing and ADM encoding in BCI2000, together with the code to detect epileptiform patterns from SNN-encoded data, are provided at [https://github.com/CostaFilippo/BCI2000_DYNAP-SE.git](https://github.com/CostaFilippo/BCI2000_DYNAP-SE.git). \n\nIn a previous publication, this dataset has been analyzed with a offline software algorithm: [https://doi.org/10.1016/j.clinph.2019.07.008](https://doi.org/10.1016/j.clinph.2019.07.008). \n\nThe annotations of the epileptiform patterns detected with the offline approach are provided at: sub-\\*/ses-SITUATION\\*/sub-\\*_ses-SITUATION\\*_task-acute_events.tsv.\n\nThe annotations of the epileptiform patterns detected with the online neuromorphic processing are provided at derivative/sub-\\*/ses-SITUATION\\*/sub-\\*_ses-SITUATION*_task-EV.csv.\n \n## Dataset Structure\n\nThe derivative folder is structured as follows:\n\n - sub-*\n  - ses-SITUATION1A\n    - *task-BCI.dat\n    - *task-ADM.csv\n    - *task-SNN.csv\n    - *task-EV.csv\n  - ses-SITUATION2A\n    - *task-BCI.dat\n    - *task-ADM.csv\n    - *task-SNN.csv\n    - *task-EV.csv\n\n### File Descriptions\n\n- derivative\n\n - **task-BCI.dat:* BCI2000-compatible file containing the ECoG recording.\n - **task-ADM.csv:* ADM encoding of the ECoG recording.\n - **task-SNN.csv:* SNN encoding of the ECoG recording.\n - **task-EV.cvs:*  Annotations of the detected epileptiform patterns in the ECoG recording.\n\n## Data Formats\n\nDetails of the neuromorphic processing pipeline can be found at [https://doi.org/10.1038/s41467-024-47495-y](https://doi.org/10.1038/s41467-024-47495-y).\n\n#### task-BCI.dat\n\nThe BCI2000-compatible file contains the raw ECoG recording.\n\nIt can be streamed in real-time using the 'FilePlayback' BCI2000 module.\n\n#### task-ADM.csv\n\nThe ADM file is formatted as follows:\n\n - _pulseType_: -1 for DN pulse, +1 for UP pulse.\n - _pulseTime_: Time at which the pulse occurred.\n - _channel_: Channel in which the pulse occurred.\n - _band_: 0 for EEG band, 1 for HFO band\n\n#### task-SNN.csv\n\nThe SNN file is formatted as follows:\n\n - _time_: Time at which the SNN neuron activated.\n - _neuronId_: Number id of the SNN neuron (DYNAP-SE numbering from 0 to 1024). \n - _neuronCounter_: Number id of the SNN neuron (sequential numbering from 0 to 40).\n - _moduleName_: Population (ACC_4_0; ACC_0_4), band (EEG; HFO) and module number (ch 0-7) of the neuron.\n   - ACC_4_0 = ACC UP\n   - ACC_0_4 = ACC DN\n - _moduleId_: Module number (0-7).\n - _channelId_: Channel for which the SNN neuron activated.\n\n#### task-EV.csv\n\nThe EV file contains annotations of the detected epileptiform patterns with the following format:\n\n - _time_: time of the detected event.\n - _channelId_: channel id of the detected event.\n - _location_:  channel name of the detected event.\n\n## Contact Information\n\nFor inquiries or additional information, please contact Filippo.Costa@usz.ch or Johannes.Sarnthein@usz.ch\n\n## Acknowledgements\n\nWe thank V. Dimakopoulos for help in reformatting the data to BIDS. We acknowledge a grant awarded by the Swiss National Science Foundation (funded by the SNSF 204651 to JS and GI with GR and NK as project partners). The funder had no role in the design or analysis of the study.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004944",
    "exists": true,
    "description": "OpenNeuro dataset - Dataset of BCI2000-compatible intraoperative ECoG with neuromorphic encoding",
    "created_at": "2024-01-30T13:49:38+00:00",
    "updated_at": "2024-01-30T13:53:38+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}