{
  "dataset_id": "ds003670",
  "date_retrieved": "2025-07-31T00:17:29.119020+00:00",
  "dataset_description": {
    "Name": "Dataset of Concurrent EEG, ECG, and Behavior with Multiple Doses of transcranial Electrical Stimulation - BIDS",
    "ReferencesAndLinks": [
      "Gebodh, Nigel, Esmaeilpour, Zeinab, Datta, Abhishek, & Bikson, Marom. (2020). Dataset of Concurrent EEG, ECG, and Behavior with Multiple Doses of transcranial Electrical Stimulation (Version All) [Data set]. Zenodo. http://doi.org/10.5281/zenodo.3837212"
    ],
    "License": "CC0",
    "Authors": [
      "Nigel Gebodh",
      "Zeinab Esmaeilpour",
      "Abhishek Datta",
      "Marom Bikson"
    ],
    "BIDSVersion": "1.1.1",
    "Acknowledgements": "Portions of this study were funded by X (formerly Google X), the Moonshot Factory. The funding source had no influence on study conduction or result evaluation. MB is further supported by grants from the National Institutes of Health: R01NS101362, R01NS095123, R01NS112996, R01MH111896, R01MH109289, and (to NG) NIH-G-RISE T32GM136499.\n\nWe would like to thank Yuxin Xu and Michaela Chum for all their technical assistance. \n",
    "Funding": [
      "X (formerly Google X)",
      "NIH R01NS095123",
      "NIH R01NS101362",
      "NIH R01NS112996",
      "NIH R01MH111896",
      "NIH R01MH109289",
      "NIH-G-RISE T32GM136499"
    ],
    "HowToAcknowledge": "**Raw Data Use**\nGebodh, Nigel, Esmaeilpour, Zeinab, Datta, Abhishek, & Bikson, Marom. (2020). Dataset of Concurrent EEG, ECG, and Behavior with Multiple Doses of transcranial Electrical Stimulation (Version V2) [Data set]. Zenodo. http://doi.org/10.5281/zenodo.3837212",
    "DatasetDOI": "10.18112/openneuro.ds003670.v1.1.0"
  },
  "readme_content": "**Synopsis**\nThis is the **GX dataset** formatted to comply with [BIDS](https://bids.neuroimaging.io/) standard format. \n\nThe tES/EEG/CTT/Vigilance experiment contains 19 unique participants (some repeated experiments).\nOver a 70 min period EEG/ECG/EOG were recorded concurrently with a [CTT](https://sccn.ucsd.edu/~scott/pdf/COMPTRACK.pdf)\nwhere participants maintained a ball at the center of the screen\nand were periodically stimulated (with low-intensity noninvasive brain stimulation) for 30 secs with combinations of 9 stimulation montages.\n\nFor the **raw data** please see: https://zenodo.org/record/4456079 \n\nFor methodological details please see corresponding article titled:\n    **Dataset of concurrent EEG, ECG, and behavior with multiple doses of transcranial Electrical Stimulation**\n\n\n**Data Descriptor Abstract**\nWe present a dataset combining human-participant high-density electroencephalography (EEG) with physiological and continuous behavioral metrics during transcranial electrical stimulation (tES). Data include within participant application of nine High-Definition tES (HD-tES) types, targeting three cortical regions (frontal, motor, parietal) with three stimulation waveforms (DC, 5 Hz, 30 Hz); more than 783 total stimulation trials over 62 sessions with EEG, physiological (ECG, EOG), and continuous behavioral vigilance/alertness metrics. Experiment 1 and 2 consisted of participants performing a continuous vigilance/alertness task over three 70-minute and two 70.5-minute sessions, respectively. Demographic data were collected, as well as self-reported wellness questionnaires before and after each session. Participants received all 9 stimulation types in Experiment 1, with each session including three stimulation types, with 4 trials per type. Participants received 2 stimulation types in Experiment 2, with 20 trials of a given stimulation type per session. Within-participant reliability was tested by repeating select sessions. This unique dataset supports a range of hypothesis testing including interactions of tDCS/tACS location and frequency, brain-state, physiology, fatigue, and cognitive performance.\n\nFor more details please see the full data descriptor article.\n\n\nCode used to import and process this dataset can be found here:\n**GitHub** : https://github.com/ngebodh/GX_tES_EEG_Physio_Behavior\n\nFor downsampled data please see:\n**Experiment 1** : https://doi.org/10.5281/zenodo.3840615\n**Experiment 2** : https://doi.org/10.5281/zenodo.3840617\n\n\n\n- Nigel Gebodh (May 26th, 2021)",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003670",
    "exists": true,
    "description": null,
    "created_at": "2021-07-10T23:17:31+00:00",
    "updated_at": "2023-05-15T04:23:02+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}