{
  "dataset_id": "ds002034",
  "date_retrieved": "2025-07-31T00:14:24.250188+00:00",
  "dataset_description": {
    "Name": "Real-time EEG feedback on alpha power lateralization leads to behavioral improvements in a covert attention task",
    "BIDSVersion": "1.1.1",
    "License": "CC0",
    "Authors": [
      "Christoph Schneider",
      "Michael Pereira",
      "Luca Tonin",
      "Jose del R. Millan"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds002034.v1.0.3",
    "Funding": [
      "No external funding sources"
    ],
    "HowToAcknowledge": "If you reference this dataset in your publications, please acknowledge its authors and cite the paper specified under 'ReferenceAndLinks'. Also, please include the following message: 'This data was obtained from the Open Neuro database.'",
    "ReferencesAndLinks": [
      "Schneider, C., Pereira, M., Tonin, L. et al. Brain Topogr (2019). https://doi.org/10.1007/s10548-019-00725-9"
    ]
  },
  "readme_content": "This dataset contains the EEG recordings used in the paper: \"Real-time EEG Feedback on Alpha Power Lateralization Leads to Behavioral Improvements in a Covert Attention Task\" (Schneider, C., Pereira, M., Tonin, L. et al. Brain Topogr (2019). https://doi.org/10.1007/s10548-019-00725-9)\n\nParticipants:\nFourteen healthy subjects (seven female, seven male), age 23±1.52 years, with normal or corrected to normal vision took part in the study. All gave informed written consent and received course credits for their participation. The study was covered by the ethical protocol No PB_2017-00295 of the ethics commissions of the cantons of Vaud and Geneva, Switzerland and complied with the standards of the Declaration of Helsinki.\n\n\nExperimental paradigm: \nEach trial started with the presentation of a gray central fixation point at 0.5° visual angle and subjects were instructed to neither move nor blink until the trial was over. After 1 to 2 s (random duration), a cue—corresponding to the task to perform—was presented for 100 ms: half a circle (line width 0.1°, radius 2°) to the left or to the right indicated the side to attend to, a full circle around the fixation point indicated a central fixation trial (no covert attention shift). This was followed by the sustained attention phase—1 to 5 s—where subjects were instructed to covertly attend to the target placeholder indicated by the cue. Target placeholders were circles with an inscribed cross (line width 0.2°, radius 2°, centered at 12° extremity from the center point and at a downward angle of 30° from the horizontal midline; Fig. 1b). The target placeholder at the non-cued side is also called a distractor. To be consistent with the real-time feedback runs where color represented the decoded α-LI (see below), the color of both target placeholders varied randomly between isoluminant red and green (L*a*b color space (CIELAB), L and b constant, a varied between − 80 and 80). A trial ended when the inscribed cross disappeared in the to-attend target (valid cue) or on the opposite side (invalid cue). Subjects were instructed to react to the trial end as fast as possible with a button press using the right index finger. The inter-trial interval was 2–3 s long. In online runs, the min. and max. duration of the sustained attention period was between 2 and 20 s and inter-trial intervals ranged from 4-5 seconds.\n\n\nRecordings:\nThe EEG was recorded with an active 64 channel HIamp EEG amplifier (g.tec, Schiedlberg, Austria) at 512Hz and referenced to the linked ears. The electrodes were positioned according to the international 10-10 system with the ground electrode on FCz. For more details please refer to the paper.\nThe study involved recordings (sessions) on three different days. One recording session lasted approximately 90 min, including the technical setup. Time on task was less than 40 min per session, with breaks after each run (every 9–10 min). On the first recording day subjects practiced for one run to familiarize with the task. Then they performed four offline runs (no feedback, 80 trials each) to calibrate their individual decoder for the real-time feedback (Fig. 1a, \"Offline Paradigm\"). On day two and three the α-power lateralization index (α-LI) feedback was administered in a single-blinded crossover design. Subjects were randomly assigned to either receive real or sham α-LI feedback on day two and then switched the other feedback group on day three (\"Real-time feedback paradigm\" and \"Sham feedback\"). Therefore, both days had the same run structure: they started and ended with one offline run (80 trials each, including catch trials), while the real-time feedback was given during two middle runs (40 long trials each).\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds002034",
    "exists": true,
    "description": null,
    "created_at": "2019-08-24T11:04:03+00:00",
    "updated_at": "2023-08-28T22:09:06+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}