{
  "dataset_id": "ds005960",
  "date_retrieved": "2025-07-31T00:15:10.447406+00:00",
  "dataset_description": {
    "Name": "General Info: inst-comp-eeg",
    "ReferencesAndLinks": [
      "https://doi.org/10.1523/JNEUROSCI.1964-24.2025"
    ],
    "BIDSVersion": "v1.2.1",
    "License": "CC0",
    "Authors": [
      "Pena, P.",
      "Palenciano, A.F.",
      "González-García, C.",
      "Ruz, M."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005960.v1.0.0",
    "HEDVersion": "8.1.0",
    "GeneratedBy": [
      {
        "Name": "bids-matlab-tools",
        "Version": "8.0"
      }
    ],
    "EthicsApprovals": [
      "Local Ethics Committee of the University of Granada (reference 1584/CEIH/2020)"
    ],
    "Funding": [
      "This research was supported by grant PID2022-138940NB-100 awarded to MR and grant PID2023-151911NA-I00 awarded to AFP, funded by MCIN/EI/10.13039/501100011033/ and FEDER, UE. PP was supported by scholarship PREP2023-002013 funded by MCIN/AEI/10.13039/501100011033 and FSE+. AFP was supported by Grant PAIDI21_00207 of the Andalusian Autonomic Government. CCGP was supported by Project PID2020-116342GA-I00 funded by MCIN/AEI/10.13039/501100011033, and Grant RYC2021-033536-I funded by MCIN/AEI/10.13039/501100011033 and by the European Union NextGeneration EU/PRTR. The Mind, Brain and Behavior Research Center receives funding from grants CEX2023-001312-M by MCIN/AEI /10.13039/501100011033 and UCE-PP2023-11 by the University of Granada."
    ]
  },
  "readme_content": "The experiment consisted of two tasks: the main instruction-following task and an additional localizer task. The data of each participant was recorded in one session.\n \n \nFor the main instruction-following task, participants saw four sequential screens -screen display of 200 ms and 800 ms as interscreen interval- that contained the full instruction, after a pretarget interval, they were presented with the target images -two images framed by a colored shape, on display for 200 ms-. \nThey had to respond if the instruction was fulfilled or not by the targets.\n \nThe first two screens of the instruction indicated if the participant had to pay attention to both images -integration- or to just one -selection-, and which specific images were set to appear -animate or inanimate images per trial-.\nThe third instruction refered to the relevant feature they had to pay attention to, either the color or the shape surrounding the image.\nThe last instruction indicated the key to press if the instruction was fulfilled by the target images -either “A” or “L”-. \n \nEach trial consisted of a novel combination of the instruction components. \n \n \nAdditional catch trials were added, to ensure that participants were maintaining all information.\nIf any of the target images was different from the ones previously instructed, the participant had to indicate it by pressing both “A” and “L” simultaneously.\n \n \nThe localizer task was a 1-back task. Participants saw one target image per trial, and they had to indicate with a keypress -“A” and “L”- if the image was from the same subcategory as the image from the previous trial.\n \n \nEach block of the main instruction-following task consisted of 32 trials, with a total of 16 blocks. \nAll the conditions were fully counterbalanced to ensure no statistical dependencies within the blocks. \n \nEach of the 8 localizer blocks consisted of 40 trials.\n \nTo counterbalance the presentation of the blocks for the whole experiment session, the blocks of the main task were further divided according to the features -blocks of features 1 and blocks of features 2-,and then the sequence of main task and localizer blocks was counterbalanced.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005960",
    "exists": true,
    "description": "OpenNeuro dataset - General Info: inst-comp-eeg",
    "created_at": "2025-03-13T14:58:12+00:00",
    "updated_at": "2025-03-13T15:22:29+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}