{
  "dataset_id": "ds004703",
  "date_retrieved": "2025-07-31T00:12:40.441272+00:00",
  "dataset_description": {
    "Name": "sEEG Passive listening to natural speech",
    "BIDSVersion": "1.6.0",
    "Authors": [
      "Anna Mai",
      "Stephanie Ries",
      "Sharona Ben-Haim",
      "Jerry Shih",
      "Timothy Gentner"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004703.v1.1.0",
    "License": "CC0"
  },
  "readme_content": "CONTACT\r\n\r\nFor questions about this data set, please contact Anna Mai (anna.mai@mpi.nl; ORCiD 0000-0002-8343-9216). \r\n\r\nPERMISSIONS\r\n\r\nThese data may not be used for commericial purposes, including but not limited to use in any kind of training set for commercial machine learning applications.\r\n\r\nThese data may not be used in any way that either in part or in whole disambiguates participant identity, including but not limited to attempts at 3D facial reconstruction.\r\n\r\nRECORDING SETUP\r\n\r\nThese data were collected from June 2018 to August 2019.\r\n\r\nFor all patients, a scalp electrode was used for referencing and ground. These were 13mm, 2.5M single lead subdermal electrodes made by Rochester Electro-Medical with serial number S81025-A-24RM.\r\n\r\nDepth electrodes were manufactured by Ad-Tech and are Spencer Probe depth electrodes. Each electrode has 10 leads evenly spaced 3-7mm apart. \r\n\r\nWith the exception of patients SD012 and SD022, all implants are depth electrodes. Patients SD012 and SD022 had grid and strip electrodes implanted in addition to several depth electrodes.\r\n\r\nAny channel names beginning with ``C'' were not used and should be dropped from analyses.\r\n\r\nTASK\r\n\r\nParticipants passively listened to 30-45s passages of conversational speech and  verbally answered a 2AC content question after each passage. 6 blocks with 7 passages per block.\r\n\r\nMISSING DATA\r\n\r\nAnatomical scans for particpant SD012 are not available due to excessive movement artifacts.\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004703",
    "exists": true,
    "description": "OpenNeuro dataset - sEEG Passive listening to natural speech",
    "created_at": "2023-08-18T13:22:56+00:00",
    "updated_at": "2023-08-18T14:38:04+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}