{
  "dataset_id": "ds003505",
  "date_retrieved": "2025-07-31T00:26:26.504831+00:00",
  "dataset_description": {
    "Name": "VEPCON: Source imaging of high-density visual evoked potentials with multi-scale brain parcellations and connectomes",
    "BIDSVersion": "1.6.0",
    "License": "CC0",
    "Authors": [
      "David Pascucci",
      "Sebastien Tourbier",
      "Joan Rue-Queralt",
      "Margherita Carboni",
      "Patric Hagmann",
      "Gijs Plomp"
    ],
    "Acknowledgements": "",
    "HowToAcknowledge": "Please cite the associated scientific data paper: Pascucci, D., Tourbier, S., Rué-Queralt, J. et al. Source imaging of high-density visual evoked potentials with multi-scale brain parcellations and connectomes. Sci Data 9, 9 (2022). https://doi.org/10.1038/s41597-021-01116-1",
    "Funding": [
      "This research was supported by Swiss National Science Foundation grants PP00P1_183714, PP00P1_190065 and CRSII5-170873."
    ],
    "ReferencesAndLinks": [
      "https://doi.org/10.1038/s41597-021-01116-1",
      "https://www.biorxiv.org/content/10.1101/2021.03.16.435599v1"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds003505.v1.1.1",
    "EthicsApprovals": [
      ""
    ]
  },
  "readme_content": "# VEPCON: Source imaging of high-density visual evoked potentials with multi-scale brain parcellations and connectomes\n\n## Overview\n\nThe multimodal dataset VEPCON follows the BIDS standard and provides raw data of high-density EEG, structural MRI and diffusion weighted images (DWI) recorded in 20 participants.\n\nVisual evoked potentials were recorded while participants discriminated briefly presented faces from scrambled faces (`task-faces`), or coherently moving stimuli from incoherent ones (`task-motion`). Note that raw EEG data for `sub-05` (for both `task-faces` and `task-motion`) and for `sub-15` (for `task-motion`) were discarded because of excessive motion. MRI and DWI were recorded in a separate session from the same participants. \n\nVEPCON also contains data derivatives that follow as close as possible the BIDS derivatives specifications. It includes in particular: pre-processed EEG of single trials in each condition, behavioral measures, structural MRIs, Freesurfer `7.1.1` outputs of defaced MRIs, individual brain parcellations at 5 spatial resolutions (83 to 1015 regions), and corresponding structural connectomes based on fiber count, fiber density, average fractional anisotropy and mean diffusivity maps. In addition, Freesurfer's outputs include a `bem/` folder that contains all files generated by MNE to describe the Boundary Element Model (BEM) based on Freesurfer's surfaces estimated from the original undefaced structural MRIs. Finally, VEPCON also provides EEG inverse solutions for source imaging based on individual anatomy, and Python and Matlab code for deriving time-series of activity in each brain region, at each parcellation level.\n\nWe believe this dataset can contribute to multimodal methods development, studying structure-function relations, as well as unimodal optimization of source imaging and graph analysis, among many other possibilities.\n\nAll code supporting the dataset can be found in the `code/` folder.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003505",
    "exists": true,
    "description": null,
    "created_at": "2021-03-11T09:15:10+00:00",
    "updated_at": "2021-12-06T20:53:05+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}