{
  "dataset_id": "ds004770",
  "date_retrieved": "2025-07-31T00:17:15.758741+00:00",
  "dataset_description": {
    "Name": "iEEG on children during gameplay",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Riyo Ueda",
      "Kazuki Sakakura",
      "Takumi Mitsuhashi",
      " Masaki Sonoda",
      "Ethan Firestone",
      "Naoto Kuroda",
      "Yu Kitazawa",
      "Hiroshi Uda",
      "Aimee F. Luat ",
      "Elizabeth L. Johnson",
      "Noa Ofen",
      "Eishi Asano"
    ],
    "Acknowledgements": "",
    "HowToAcknowledge": "N/A",
    "Funding": [
      "N/A"
    ],
    "EthicsApprovals": [
      "IRB of Wayne State University"
    ],
    "ReferencesAndLinks": [
      "",
      "",
      ""
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004770.v1.0.0"
  },
  "readme_content": "Dataset of intracranial EEG from human epilepsy patients performing a visuospatial working memory task\n\nDescription:\n\nWe present an electrophysiological dataset recorded from ten subjects during a visuospatial working memory task. Subjects were epilepsy patients undergoing intracranial monitoring for localization of epileptic seizures. Subjects completed 60 trials (five sessions) of Memory Matrix - a visuospatial working memory game on the Lumosity platform (https://www.lumosity.com/; Lumos Labs, Inc, San Francisco, CA) - during interictal iEEG recording.\n\nRepository structure:\n\nMain directory (iEEG from children during gameplay)\nContains iEEG files of each participant in the study. Folders are explained below.\n\nSubfolders:\n\n1. sub-/: Contains folders for each subject, named sub- and session information.\n2. sub-/ses-: Contains folders for base and task. \n3. sub-/ses-/ieeg/: Contains the raw iEEG data in .edf format for each subject. Each subject performed 60 working memory trials (ses-task). Each *ieeg.edf file contains continuous iEEG data during the working memory task. Details about the channels are given in the corresponding .tsv file. We also provide the information on the timing of the stimulus onset and finger tapping on ieeg/edf file by specifying the start and end sample of each trial. (101 is for task display, 401 is for finger tapping to the successful grid, and 501 is for finger tapping to the failed grid). Each subject also had baseline periods (ses-base). To establish baseline, we selected 60 non-overlapping 2,000-ms time windows during periods of spontaneous, resting, eye-open wakefulness immediately preceding the game sessions.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004770",
    "exists": true,
    "description": "OpenNeuro dataset - iEEG on children during gameplay",
    "created_at": "2023-09-22T19:54:54+00:00",
    "updated_at": "2023-09-22T19:58:42+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}