{
  "dataset_id": "ds004738",
  "date_retrieved": "2025-07-31T00:25:52.528265+00:00",
  "dataset_description": {
    "Acknowledgements": "We thank Georg Bahners for his help with building the phantom and Pia Hartmann and Luisa Spallek for their assistance during recordings. EF gratefully acknowledges support by the Volkswagen Foundation (Lichtenberg program 89387). BHB gratefully acknowledges support by the Prof. Dr. Klaus Thiemann Foundation (Parkinson Fellowship 2022). RL gratefully acknowledges support by the Berlin Institute of Health (Clincian Scientist Programm 2021 2024).",
    "Authors": [
      "Bahne H. Bahners",
      "Roxanne Lofredi",
      "Tilmann Sander",
      "Alfons Schnitzler",
      "Andrea A. Kuhn",
      "Esther Florin"
    ],
    "BIDSVersion": "1.2.0",
    "DatasetType": "raw",
    "Funding": [
      "Funded by the Deutsche Forschungsgemeinschaft (DFG, German Research Foundation), Project ID 424778381, TRR 295."
    ],
    "HowToAcknowledge": "Please acknowledge the authors and cite the following reference: Bahne H Bahners, Roxanne Lofredi, Tilmann Sander, Alfons Schnitzler, Andrea A Kuhn, Esther Florin. Deep brain stimulation device-specific artefacts in MEG recordings. doi: tba",
    "Name": "sfb_meg_phantom (B04/C01)",
    "DatasetDOI": "doi:10.18112/openneuro.ds004738.v1.0.1",
    "License": "CC0"
  },
  "readme_content": "This dataset is a part of the data used for the study: 'Bahners B.H., Lofredi R. , Sander T., Schnitzler A., Kuhn A.A., Florin E. Deep brain stimulation device-specific artefacts in MEG recordings. 2023, submitted. doi: tba'\r\n\r\n\r\nPlease use the latest version of the dataset.\r\n \r\n\r\nFor detailed information about measurement protocol please refer to doi: tba. Additional information about Neuromag Phantom measurement is provided below. \r\n\r\n--------------\r\nNeuromag Phantom Measurement \r\nMovement onset is recorded with an accelerometer and captured with MISC006-MISC008",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004738",
    "exists": true,
    "description": "OpenNeuro dataset - sfb_meg_phantom (B04/C01)",
    "created_at": "2023-09-03T10:41:11+00:00",
    "updated_at": "2023-09-03T10:44:35+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}