{
  "dataset_id": "ds003420",
  "date_retrieved": "2025-07-31T00:12:24.285712+00:00",
  "dataset_description": {
    "Acknowledgements": "The dataset 1 has received a French government support granted to the CominLabs excellence laboratory and managed by the National Research Agency in the Investing for the Future program under reference ANR-10-LABX-07-01. We also thank the European Research Council for the ERC-2011-ADG - Grant Agreement N 290901 ? Acronym NEUCOD. Dataset 1 and dataset 2 were also supported by the Rennes University Hospital (dataset 1 COREC Project named conneXion, 2012-14; dataset 2: COREC Project named BrainGraph, 2015-17). The study was also funded by the National Council for Scientific Research (CNRS) in Lebanon. Authors would also like to thank the Lebanese Association for Scientific Research (LASER) for its support and the Institute of Clinical Neuroscience of Rennes (project named EEGCog).",
    "Authors": [
      "Ahmad Mheich",
      "Olivier Dufor",
      "Sahar Yassine",
      "Aya Kabbara",
      "Arnaud Biraben",
      "Fabrice Wendling",
      "Mahmoud Hassan"
    ],
    "BIDSVersion": "1.2",
    "KeyWords": [
      "Electroencephalography",
      "resting State",
      "Naming",
      "Audio",
      "Memory"
    ],
    "Name": "HD-EEGtask(Dataset 1)",
    "ReferencesAndLinks": [
      "Kabbara, A., Falou, W. E., Khalil, M., Wendling, F. & Hassan, M. The dynamic functional core network of the human brain at rest. Sci. Rep. 7, 2936 (2017)",
      "Hassan, M. et al. Dynamic reorganization of functional brain networks during picture naming. Cortex 73, 276?288 (2015).",
      "Mheich, A. et al. Spatiotemporal analysis of brain functional connectivity. in 6th European Conference of the International Federation for Medical and Biological Engineering 934?937 (Springer, 2015).",
      "Mheich, A. et al. SimiNet A Novel Method for Quantifying Brain Network Similarity. IEEE Trans. Pattern Anal. Mach. Intell. 40, 2238?2249 (2018).",
      "Rizkallah, J. et al. Dynamic reshaping of functional brain networks during visual object recognition. J. Neural Eng. 15, 056022 (2018)."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003420.v1.0.2",
    "License": "CC0"
  },
  "readme_content": "#    Dataset 1\r\n\r\n##   Presentation\r\n\r\n     This dataset was collected between 2012 and 2013 in Rennes (France) during two conditions (visual naming and spelling tasks).\r\n     The dataset consists of naming and spelling the names of visually presented objects. The data was collected in the Rennes University Hospital. This experiment was approved by an independent ethics committee and authorized by the French institutional review board (IRB): \"Comite de Protection des Personnes dans la Recherche Biomedicale Ouest V\" (CCPPRB-Ouest V).\r\n     This study was registered under the name \"conneXion\" and the agreement number: 2012- A01227-36.\r\n     \r\n\r\n###  Participants\r\n\r\n     Twenty-three right-handed healthy volunteers of whom 12 females, with an age range between\r\n     19 and 40 years (mean age 28 year),and 11 males with an age range between 19 and 33 years (mean age 23 years) participated in this study. (See participants.json and participants.tsv for more details)\r\n\r\n\r\n#### Experiment\r\n     * The experiment begins with the verification of inclusion/exclusion criteria.\r\n     * The participants read the information notice and the consent form. \r\n     * Then they sign two questionnaires. \r\n     * One subject -->Two conditions (naming and spelling)--> two runs for each condition.\r\n     * Each run contains 74 stimuli.\r\n     * The spelling task always follow the naming task and its instruction was not given before the naming task was completed to avoid any reminiscence of words orthographic structures\r\n     * Each run contains balanced numbers of animals and objects as well as long and short words.\r\n     * Pictures are presented on a screen using a computer and the experimental paradigm is presented using E-prime Psychology Software Tools. \r\n     * The responses produced by the participants were collected via a Logitech microphone and analyzed to detect onsets of speech using Praat v5.3.13(University of Amsterdam, 1012VT Amsterdam, The Netherlands).\r\n\r\n#### EEG acquisition\r\n\r\n     * HD-EEG system (EGI, Electrical Geodesic Inc., 256 electrodes) \r\n     * Sampling frequency: 1000Hz\r\n     * Impedances were kept below 5k\r\n\r\n\r\n## Contact\r\n     * If you have any questions or comments, please contact: \r\n     * Ahmad Mheich: mheich.ahmad@gmail.com",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003420",
    "exists": true,
    "description": null,
    "created_at": "2020-12-09T00:04:16+00:00",
    "updated_at": "2020-12-13T17:41:11+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}