{
  "dataset_id": "ds005868",
  "date_retrieved": "2025-07-31T00:11:09.985263+00:00",
  "dataset_description": {
    "Authors": [
      "Brennan Terhune-Cotter",
      "Phillip J. Holcomb",
      "Katherine J. Midgley",
      "Sofia E. Ortega",
      "Emily M. Akers",
      "Karen Emmorey"
    ],
    "Name": "Flankers-FAR",
    "License": "CC0",
    "ReferencesAndLinks": [
      ""
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "GeneratedBy": [
      {
        "Name": "bids-matlab-tools",
        "Version": "8.0"
      }
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005868.v1.0.1"
  },
  "readme_content": "Data collection took place at the NeuroCognition Laboratory (NCL) in San Diego, California under the supervision of Dr. Phillip Holcomb and Dr. Karen Emmorey. This project followed the San Diego State University’s IRB guidelines.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \nParticipants sat in a comfortable chair in a darkened, sound-attenuated room throughout the experiment. They were given a game controller for responding to stimuli. They were instructed to watch the 24in-LCD video monitor, which was placed at a viewing distance of 60 in (152 cm).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  \n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          \nParticipants were presented with 90 four-letter real words and 90 four-letter pseudowords in white New Courier font on a black background. Each letter subtended .41 degrees of visual angle. The flanker words were separated from the center target word by 3.28 degrees of empty space on both sides. All targets and flankers were content words under a 6th grade reading level; plural words and proper nouns were excluded. All words were presented once in each of the three conditions: no flanker, identical flankers, or different flankers. There were 270 trials. Trials started with a purple fixation cross for 1000ms, followed by a white fixation cross for 500ms to prepare participants for the presentation of the stimulus. The stimulus item was then presented for 150ms, followed by a blank screen shown until participants responded via the game controller. \u0000",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005868",
    "exists": true,
    "description": "OpenNeuro dataset - Flankers-FAR",
    "created_at": "2025-01-22T00:10:39+00:00",
    "updated_at": "2025-01-22T00:17:49+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}