{
  "dataset_id": "ds003768",
  "date_retrieved": "2025-07-31T00:16:01.363284+00:00",
  "dataset_description": {
    "Acknowledgements": "We would like to express special thanks to Dr. Thomas Beck and Dr. Josef Pfeuffer, Siemens AG, Healthcare Sector for providing us with the Advanced fMRI package WIP package. We would also like to thank Jack W. Williams and Youyou Yu for their help during the experiment. Data analysis were conducted using the computing resources provided by the Institute for Computational and Data Sciences at the Pennsylvania State University (https://icds.psu.edu).",
    "Authors": [
      "Yameng Gu",
      "Feng Han",
      "Lucas E. Sainburg",
      "Margeaux M. Schade",
      "Orfeu M. Buxton",
      "Jeff H. Duyn",
      "Xiao Liu"
    ],
    "BIDSVersion": "1.4.1",
    "DatasetDOI": "10.18112/openneuro.ds003768.v1.0.0",
    "Funding": [
      "National Institutes of Health Pathway to Independence Award K99/R00 (5R00NS092996-03)",
      "Brain Initiative Award (1RF1MH123247-01)",
      "National Institutes of Health R01 Award (1R01NS113889-01A1)"
    ],
    "HowToAcknowledge": "Please cite the paper",
    "License": "CC0",
    "Name": "Simultaneous EEG and fMRI signals during sleep from humans",
    "ReferencesAndLinks": [
      "An orderly sequence of autonomic and neural events at transient arousal changes, Yameng Gu, Feng Han, Lucas E. Sainburg, Margeaux M. Schade, Orfeu M. Buxton, Jeff H. Duyn, Xiao Liu, bioRxiv, 2021"
    ]
  },
  "readme_content": "\nThis dataset included 33 healthy participants collected at Penn State with informed consent. Simultaneously collected EEG and BOLD signals for each participant were recorded and organized at each folder. EEG data were collected using a 32 channel MR-compatible EEG system (Brain Products, Munich, Germany). R128 in the EEG signals corresponds to the BOLD fMRI volume trigger.\n\nEach scanning section consisted of an anatomical session, two 10-min resting-state sessions, and several 15-min sleep sessions. The first resting-state session was conducted before a visual-motor adaptation task (Albouy et al, Journal of Sleep Research, 2013) and the second resting-state session was conducted after a visual-motor adaptation task. The scored sleep stages for these 33 subjects were organized under sourcedata folder. Each TSV file contained the sleep stages for each 30-sec epoch across different sessions for each subject.\n\nFor more information or any questions about this dataset, please see the manuscript on bioRxiv or contact Yameng Gu (ymgu95@gmail.com)\n\n\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003768",
    "exists": true,
    "description": null,
    "created_at": "2021-08-17T17:52:39+00:00",
    "updated_at": "2021-08-17T17:52:52+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}