{
  "dataset_id": "ds006036",
  "date_retrieved": "2025-07-31T00:18:18.491694+00:00",
  "dataset_description": {
    "Name": "A complementary dataset of open-eyes EEG recordings in a photo-stimulation setting from: Alzheimer's disease, Frontotemporal dementia and Healthy subjects",
    "License": "CC0",
    "Authors": [
      "Aimilia Ntetska",
      "Andreas Miltiadous",
      "Alexandros T. Tzallas",
      "Katerina D. Tzimourta",
      "Theodora Afrantou",
      "Panagiotis Ioannidis",
      "Dimitrios G. Tsalikakis",
      "Nikolaos Grigoriadis",
      "Pantelis Angelidis",
      "Konstantinos Sakkas",
      "Emmanouil D. Oikonomou",
      "Nikolaos Giannakeas",
      "Markos G. Tsipouras"
    ],
    "ReferencesAndLinks": [
      "https://openneuro.org/datasets/ds004504",
      "Miltiadous, A., Tzimourta, K. D., Afrantou, T., Ioannidis, P., Grigoriadis, N., Tsalikakis, D. G., Angelidis, P., Tsipouras, M. G., Glavas, E., Giannakeas, N., & Tzallas, A. T. (2023). A Dataset of Scalp EEG Recordings of Alzheimer’s Disease, Frontotemporal Dementia and Healthy Subjects from Routine EEG. Data, 8(6), 95. doi: 10.3390/data8060095",
      "Miltiadous, A., Gionanidis, E., Tzimourta, K. D., Giannakeas, N., & Tzallas, A. T. (2023). DICE-net: A Novel Convolution-Transformer Architecture for Alzheimer Detection in EEG Signals. IEEE Access, 1–1. doi: 10.1109/ACCESS.2023.3294618"
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "GeneratedBy": [
      {
        "Name": "bids-matlab-tools",
        "Version": "8.0"
      }
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds006036.v1.0.5",
    "HowToAcknowledge": "Please cite this dataset, and the complementary data descriptor paper with doi: https://doi.org/10.3390/data10050064",
    "EthicsApprovals": [
      "The study was conducted in accordance with the Declaration of Helsinki and approved by the Scientific and Ethics Committee of AHEPA University Hospital, Aristotle University of Thessaloniki, under protocol number 142/12-04-2023."
    ]
  },
  "readme_content": "This dataset provides complementary material to the previously published dataset named “A dataset of EEG recordings from: Alzheimer's disease, Frontotemporal dementia and Healthy subjects” with doi:10.18112/openneuro.ds004504.v1.0.8.\r\nIt is consisted of eyes-open EEG recordings in multiple photic stimulation settings, according to the clinical protocol of the 2nd department of Neurology, AHEPA University of Thessaloniki, Greece. The participant numbers match the respective participant numbers of the aforementioned dataset. In the clinical protocol, the 1st datasets recordings came first, followed by the recordings of this dataset. The dataset is designed to complement a previously published dataset in which the same cohort underwent EEG recordings with their eyes closed. During the recordings, participants were seated with their eyes open while being exposed to photic stimulation. The stimulation was administered at incremental frequencies, beginning at 5 Hz, progressing to 10 Hz, 15 Hz, and in some cases, extending up to 30 Hz, with increments of 5 Hz at each level.\r\nThis study compared cognitive function in 36 individuals with Alzheimer's disease (AD), 23 with Frontotemporal Dementia (FTD), and 29 healthy controls (CN). Cognitive function was measured using the Mini-Mental State Examination (MMSE), where lower scores indicate greater cognitive impairment. The AD group had an average MMSE score of 17.75 (standard deviation of 4.5), the FTD group averaged 22.17 (standard deviation of 8.22), and the CN group scored 30. The average age was 66.4 (standard deviation of 7.9) for the AD group, 63.6 (standard deviation of 8.2) for the FTD group, and 67.9 (standard deviation of 5.4) for the CN group. The median disease duration was 25 months, with an interquartile range of 24 to 28.5 months. Notably, the AD group had no reported dementia-related comorbidities.\r\nRecordings: Recordings were aquired from the 2nd Department of Neurology of AHEPA General Hospital of Thessaloniki by an experienced team of neurologists. For recording, a Nihon Kohden EEG 2100 clinical device was used, with 19 scalp electrodes (Fp1, Fp2, F7, F3, Fz, F4, F8, T3, C3, Cz, C4, T4, T5, P3, Pz, P4, T6, O1, and O2) according to the 10-20 international system and 2 additional ectrodes (A1 and A2) placed on the mastoids for impendance check, according to the manual of the device. Each recording was performed according to the clinical protocol with participants being in a sitting position having their eyes closed. Before the initialization of each recording, the skin impedance value was ensured to be below 5k?. The sampling rate was 500 Hz with 10uV/mm resolution. The recording montages were anterior-posterior bipolar and referential montage using Cz as the common reference. The referential montage was included in this dataset. The recordings were received under the range of the following parameters of the amplifier: Sensitivity: 10uV/mm, time constant: 0.3s, and high frequency filter at 70 Hz. \r\nEach recording lasted approximately 4.86 minutes for AD group (min=1.30 minutes , max= 8.77 minutes), 4.42 minutes for FTD group (min=1.25 minutes, max=10.05 minutes) and 6.43 minutes for CN group (min=3.17 minutes, max= 9.17 minutes). In total, 174.94 minutes of AD, 101.56 minutes of FTD and 186.50 minutes of CN recordings were collected and are included in the dataset.\r\nPreprocessing: The EEG recordings were exported in .eeg format and are transformed to BIDS accepted .set format for the inclusion in the dataset. Automatic annotations of the Nihon Kohden EEG device marking artifacts (muscle activity, blinking, swallowing) have not been included for language compatibility purposes (If this is an issue, please use the preprocessed dataset in Folder: derivatives). The unprocessed EEG recordings are included in folders named: sub-0XX. Folders named sub-0XX in the subfolder derivatives contain the preprocessed and denoised EEG recordings. The preprocessing pipeline of the EEG signals is as follows. First, a Butterworth band-pass filter 0.5-45 Hz was applied and the signals were re-referenced to A1-A2. Then, the Artifact Subspace Reconstruction routine (ASR) which is an EEG artifact correction method included in the EEGLab Matlab software was applied to the signals, removing bad data periods which exceeded the max acceptable 0.5 second window standard deviation of 15, which is considered a conservative window. Next, the Independent Component Analysis (ICA) method (RunICA algorithm) was performed, transforming the 19 EEG signals to 19 ICA components. ICA components that were classified as “eye artifacts” or “jaw artifacts” by the automatic classification routine “ICLabel” in the EEGLAB platform were automatically rejected. It should be noted that, even though the recording was performed in a resting state, eyes-closed condition, eye artifacts of eye movement were still found at some EEG recordings.\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds006036",
    "exists": true,
    "description": "OpenNeuro dataset - A complementary dataset of open-eyes EEG recordings in a photo-stimulation setting from: Alzheimer's disease, Frontotemporal dementia and Healthy subjects",
    "created_at": "2025-03-24T07:44:35+00:00",
    "updated_at": "2025-05-13T14:26:26+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}