{
  "dataset_id": "ds003751",
  "date_retrieved": "2025-07-31T00:23:24.768433+00:00",
  "dataset_description": {
    "Name": "Dataset on Emotion with Naturalistic Stimuli (DENS)",
    "BIDSVersion": "1.4",
    "License": "CC0",
    "Authors": [
      "Sudhakar Mishra",
      "Md. Asif",
      "Uma Shanker Tiwary",
      "Narayanan Srinivasan"
    ],
    "Acknowledgements": "We wish to extend our sincere thanks to Prof. Narayanan Srinivasan, CBCS, University of Allahabad. He kindly gave the SM some very useful pieces of advice related to the ex- periment. Dr Sonia baloni ray, IIIT-Delhi, has introduced SM to the EEG technology and taught him how to use it. She demonstrated it to him by letting him participate in her attention study. Then, we would like to thank Mr Amit Ti- wary (then M.tech student), Mr Pravin Srivastav (then PhD candidate), and Ms Anandpreet Kaur (then PhD candidate) for helping us in conducting the validation study.",
    "HowToAcknowledge": "",
    "ReferencesAndLinks": [
      "Sonkusare, S., Breakspear, M., & Guo, C. (2019). Naturalistic stimuli in neuroscience: critically acclaimed. Trends in cognitive sciences, 23(8), 699-714."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003751.v1.0.2",
    "DatasetType": "raw"
  },
  "readme_content": "Overview\n--------\nThis is the \"Emotion\" dataset. The Dataset is recorded with naturalistic paradigm\n\nIn brief, it contains EEG, ECG and EMG data for 40 subjects emotionally stimulated using naturalistic emotion stimuli. The stimuli are multimedia videos providing context to understand the situated conceptualization of emotions.\nFor details, see the `Details about the experiment` section.\n\n\nCiting this dataset\n-------------------\nPlease cite as follows:\n\nFor more information, see the `dataset_description.json` file.\n\n\nLicense\n-------\nThis eeg_emotion dataset is made available under the Open Database\nLicense: See the LICENSE file. A human readable information can be found at:\n\nhttps://opendatacommons.org/licenses/odbl/summary/\n\nAny rights in individual contents of the database are licensed under the\nDatabase Contents License: http://opendatacommons.org/licenses/dbcl/1.0/\n\n\nDataset Description\n------\nDataset\\_description file described the metadata for the dataset. Participants related details are described in participants.json and participants.tsv files. Each subject directory contains two directories- beh and eeg. A tsv file inside beh folder having entries about the feedbacks given by subject on self-assessment scales-valence, arousal, dominance, liking, familiarity, relevance and emotion category. In addition, it contains the information about the time-stamp of mouse click and other details. The eeg folder inside subject directory contains the raw eeg data in .set \\& .fdt format along with the information about task events in \\_task-emotion\\_events.tsv file. The stimuli directory contains stimuli which were used during the experiment. In addition, feedback excel sheet participant\\_details.xlsx filled by participants is also added. The code directory contains the python code for data collection, python code for data validation and matlab file for pre-processing the raw data.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003751",
    "exists": true,
    "description": null,
    "created_at": "2021-08-08T03:29:50+00:00",
    "updated_at": "2021-08-15T09:20:57+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}