{
  "dataset_id": "ds004602",
  "date_retrieved": "2025-07-31T00:17:12.505480+00:00",
  "dataset_description": {
    "Name": "Registered Replication Report of ERN/Pe Psychometrics",
    "ReferencesAndLinks": [
      "https://osf.io/8cbua/"
    ],
    "BIDSVersion": "v1.8.0",
    "License": "CC0",
    "Authors": [
      "Peter E Clayson",
      "Michael J Larson"
    ],
    "HEDVersion": "8.1.0",
    "DatasetDOI": "doi:10.18112/openneuro.ds004602.v1.0.1",
    "HowToAcknowledge": "Please cite primary manuscript for the dataset: https://psyarxiv.com/465wq\n\nPeter E Clayson and Michael J Larson (2023). Registered Replication Report of ERN/Pe Psychometrics. OpenNeuro. [Dataset] doi:10.18112/openneuro.ds004602.v1.0.0"
  },
  "readme_content": "This dataset supports a registered replication report that is described at https://osf.io/8cbua/. Scripts used for data processing are posted there.\n\nAbstract\nIntact cognitive control is critical for goal-directed behavior and is widely studied in healthy and clinical populations using the error-related negativity (ERN). A common assumption in such studies is that ERNs recorded during different experimental paradigms reflect the same construct or functionally equivalent processes and that ERN is functionally distinct from other error-monitoring event-related potentials (ERPs; error positivity [Pe]), other neurophysiological indices of cognitive control (N2), and even other indices unrelated to cognitive control (visual N1). The present registered report represents a replication-plus-extension study of the psychometric validity of cognitive control ERPs (Riesel et al., 2013, Biological Psychology) and evaluated the convergent and divergent validity of ERN, Pe, N2, and visual N1 recorded during three paradigms (flanker, Stroop, Go/no-go). Data from 182 participants were collected from two study sites, and ERP psychometric reliability and validity were evaluated. Findings supported convergent and divergent validity of ERN, Pe, and delta-Pe (error minus correct)—these ERPs correlated more with themselves across tasks than with other ERPs measured during the same task. Convergent validity of delta-ERN was not replicated, despite high internal consistency. ERN was strongly correlated with N2 at levels similar or higher than those in support of convergent validity for other ERPs, and the present study failed to provide evidence of divergent validity for ERN and Pe from N2 or the theoretically unrelated N1. Present findings underscore the importance of considering the psychometric validity of ERPs as it provides a foundation for interpreting and comparing ERPs across different tasks and studies.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004602",
    "exists": true,
    "description": "OpenNeuro dataset - Registered Replication Report of ERN/Pe Psychometrics",
    "created_at": "2023-07-21T19:05:23+00:00",
    "updated_at": "2023-08-27T11:31:28+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}