{
  "dataset_id": "ds002723",
  "date_retrieved": "2025-07-31T00:20:37.981287+00:00",
  "dataset_description": {
    "Name": "A dataset recorded during development of an affective brain-computer music interface: testing session",
    "BIDSVersion": "1.0.2",
    "Authors": [
      "Ian Daly",
      "Nicoletta Nicolaou",
      "Duncan Williams",
      "Faustina Hwang",
      "Alexis Kirke",
      "Eduardo Miranda",
      "Slawomir J. Nasuto"
    ],
    "License": "CC0",
    "DatasetDOI": "10.18112/openneuro.ds002723.v1.1.0"
  },
  "readme_content": "0. Sections\r\n------------\r\n\r\n1. Project\r\n2. Dataset\r\n3. Terms of Use\r\n4. Contents\r\n5. Method and Processing\r\n\r\n1. PROJECT\r\n------------\r\n\r\nTitle: Brain-Computer Music Interface for Monitoring and Inducing Affective States (BCMI-MIdAS)\r\nDates: 2012-2017\r\nFunding organisation: Engineering and Physical Sciences Research Council (EPSRC)\r\nGrant no.: EP/J003077/1\r\n\r\n2. DATASET\r\n------------\r\n\r\nEEG data from an affective Music Brain-Computer: online real-time control.\r\n\r\nDescription: This dataset accompanies the publication by Daly et al. (2018) and has been analysed in Daly et al. (2016) (please see Section 5 for full references). The purpose of the research activity in which the data were collected was to investigate the performance of a real-time and online brain-computer interface that identified the user’s emotional state and modified music on-the-fly in order to induce a target emotional state. For this purpose, participants listened to 60 s music clips targeting different affective states, as defined by valence and arousal. The music clips were generated using a synthetic music generator. The dataset contains the EEG data from 8 healthy adult participants during real-time control of the system while listening to the music clips, together with the reported affective state (valence and arousal values).\r\n\r\nThis dataset is connected to 2 additional datasets:\r\n \r\n1.\tEEG data from an affective Music Brain-Computer Interface: system calibration. doi:\r\n2.\tEEG data from an affective Music Brain-Computer: offline training data to induce target emotional states. doi:\r\n\r\nPlease note that the number of participants varies between datasets; however, participant codes are the same across all three datasets.\r\n\r\nPublication Year: 2018\r\n\r\nCreators: Nicoletta Nicolaou, Ian Daly.\r\nContributors: Isil Poyraz Bilgin, James Weaver, Asad Malik, Alexis Kirke, Duncan Williams.\r\nPrincipal Investigator: Slawomir Nasuto (EP/J003077/1).\r\nCo-Investigator: Eduardo Miranda (EP/J002135/1).\r\nOrganisation: University of Reading\r\nRights-holders: University of Reading\r\nSource: The synthetic generator used to generate the music clips was presented in Williams et al., “Affective Calibration of Musical Feature Sets in an Emotionally Intelligent Music Composition System”, ACM Trans. Appl. Percept. 14, 3, Article 17 (May 2017), 13 pages. DOI: https://doi.org/10.1145/3059005. \r\n\r\n3. TERMS OF USE\r\n-----------------\r\n\r\nCopyright University of Reading, 2018. This dataset is licensed by the rights-holder(s) under a Creative Commons Attribution 4.0 International Licence: https://creativecommons.org/licenses/by/4.0/.\r\n\r\n4. CONTENTS\r\n------------\r\n\r\nThe dataset comprises data from 8 subjects. The sampling rate is 1 kHz and the music listening task corresponding to a music clip is 60 s long (clip duration). During the first 20 s, the music clip places the listener in emotional state A, while for the remaining 40 s the music clip targets the affective trajectory from emotional state B to C.\r\nWithin a 60s music listening epoch there are two target affective states. In the first 20s the music is generated to target one affective state (target A), for the next 20s the BCMI attempts to (a) work out what affective state the participant is actually in, and (b) generate music to move them from this affective state to the next targetted affective state (target B), which is targetted for the last 20s of the 60s music listening epoch.\r\n\r\n5. METHOD and PROCESSING\r\n--------------------------\r\n\r\nThis information is available in the following publications:\r\n\r\n[1] Daly, I., Nicolaou, N., Williams, D., Hwang, F., Kirke, A., Miranda, E., Nasuto, S.J., “Neural and physiological data from participants listening to affective music”, Scientific Data, 2018.\r\n[2] Daly, I., Williams, D., Hwang, F., Kirke, A., Malik, A., Weaver, J., Miranda, E. R., Nasuto, S. J., “Affective Brain-Computer Music Interfacing”, Journal of Neural Engineering, 13:4, July 2016. http://dx.doi.org/10.1088/1741-2560/13/4/046022\r\nIf you use this dataset in your study please cite these references, as well as the following reference:\r\n[3] Williams, D., Kirke, A., Miranda, E.R., Daly, I., Hwang, F., Weaver, J., Nasuto, S.J., “Affective Calibration of Musical Feature Sets in an Emotionally Intelligent Music Composition System”, ACM Trans. Appl. Percept. 14, 3, Article 17 (May 2017), 13 pages. DOI: https://doi.org/10.1145/3059005\r\n\r\nThank you for your interest in our work.\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds002723",
    "exists": true,
    "description": null,
    "created_at": "2020-04-24T15:35:53+00:00",
    "updated_at": "2023-08-16T10:40:21+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}