{
  "dataset_id": "ds003626",
  "date_retrieved": "2025-07-31T00:21:13.495169+00:00",
  "dataset_description": {
    "Name": "Inner Speech",
    "BIDSVersion": "1.4",
    "License": "CC0",
    "Authors": [
      "Nicolas Nieto",
      "Victoria Peterson",
      "Hugo Rufiner",
      "Juan Kamienkowski",
      "Ruben Spies"
    ],
    "HowToAcknowledge": "",
    "ReferencesAndLinks": [
      "https://www.biorxiv.org/content/10.1101/2021.04.19.440473v1"
    ],
    "DatasetDOI": "10.18112/openneuro.ds003626.v2.0.0",
    "DatasetType": "raw",
    "EthicsApprovals": [
      "Comité Asesor de Ética y Seguridad en el Trabajo Experimental (CEySTE), CCT-CONICET, Santa Fe,"
    ]
  },
  "readme_content": "Inner Speech Dataset.\n\nAuthor: Nicolas Nieto \n\nCode available at https://github.com/N-Nieto/Inner_Speech_Dataset\nPrepreint available at https://www.biorxiv.org/content/10.1101/2021.04.19.440473v1\n\nAbstract:\nSurface electroencephalography is a standard and noninvasive way to measure electrical brain activity. Recent advances in artificial intelligence led to significant improvements in the automatic detection of brain patterns, allowing increasingly faster, more reliable and accessible Brain-Computer Interfaces.\nDifferent paradigms have been used to enable the human-machine interaction and the last few years have broad a mark increase in the interest for interpreting and characterizing the \"inner voice\" phenomenon. This paradigm, called inner speech, raises the possibility of executing an order just by thinking about it, allowing a “natural” way of controlling external devices. Unfortunately, the lack of publicly available electroencephalography datasets, restricts the development of new techniques for inner speech recognition. A ten-subjects dataset acquired under this and two others related paradigms, obtain with an acquisition systems of 136 channels, is presented. The main purpose of this work is to provide the scientific community with an open-access multiclass electroencephalography database of inner speech commands that could be used for better understanding of the related brain mechanisms.  \n\nConditions = Inner Speech, Pronounced Speech, Visualized Condition\n\nClasses = \"Arriba/Up\", \"Abajo/Down\", \"Derecha/Right\", \"Izquierda/Left\"\n\nTotal Trials = 5640\n\n\nPlease contact us at this e-mail address if you have any doubts: nnieto@sinc.unl.edu.ar\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003626",
    "exists": true,
    "description": null,
    "created_at": "2021-04-17T20:00:28+00:00",
    "updated_at": "2025-05-09T03:11:19+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}