{
  "dataset_id": "ds003343",
  "date_retrieved": "2025-07-31T00:24:55.705717+00:00",
  "dataset_description": {
    "Acknowledgements": "We want to thank Techno Concept and especially Frederic Albert for sharing their extensive knowledge on the topic and for aiding with the technical setup for the tendon vibration. Further we appreciate the work Sophie Aebischer and Elise Marenghi put into reviewing corresponding literature for their bachelor thesis at the Haute ecole de travail social et de la sante (EESP) Lausanne.",
    "Authors": [
      "Christoph Schneider",
      "Renaud Marquis",
      "Jane Johr",
      "Marina Da Silva Lopes",
      "Philippe Ryvlin",
      "Andrea Serino",
      "Marzia De Lucia",
      "Karin Diserens"
    ],
    "BIDSVersion": "1.4.1",
    "DatasetDOI": "10.18112/openneuro.ds003343.v2.0.1",
    "Funding": [
      "This work was supported by the Fondation CHUV, Lausanne, Switzerland; the Loterie Romande, Lausanne, Switzerland; and Techno Concept, Mane, France."
    ],
    "HowToAcknowledge": "If you reference this dataset in your publications, please acknowledge its authors and cite the paper specified under 'ReferenceAndLinks'. Also, please include the following message: 'This data was obtained from the Open Neuro database.'",
    "License": "CC0",
    "Name": "Disentangling the percepts of illusory movement and sensory stimulation during tendon vibration in the EEG",
    "ReferencesAndLinks": [
      "Insert citation + paper doi"
    ]
  },
  "readme_content": "This dataset contains the EEG data used for the study: \"Disentangling the percepts of illusory movement and sensory stimulation during tendon vibration in the EEG\" (Schneider, C., Marquis, R., Jöhr, J., Da Lopes Silva, M., Ryvlin, P., Serino, A., De Lucia, M., Diserens, K. Unpublished [fill according to following pattern: Journal (Year). https://doi.org/....])\n\nParticipants:\nTwenty healthy participants (twelve female, eight male), age 24.6 ± 3.2 years, all right-handed. All subjects participated voluntarily and consented in writing to the experiment. The study was covered by the ethical protocol No. 142/09 from the Commission cantonale d'éthique de la recherche sur l'être humain (CER -VD) and in agreement with the Declaration of Helsinki.\n\nExperimental setup: \nThe subjects sat comfortably in a chair facing towards their right side so to not see the stimulated left arm, which could have hampered the illusion of movement created during the tendon vibration. While their right arm rested comfortably in the lap, the left arm was supported by a movable forearm rest which allowed two degrees of freedom in the horizontal plane. The reason for this was that proprioceptive feedback of the arm touching an immobile object can prevent the motor illusion from forming.\nSubjects wore an EEG cap with built-in wireless amplifier (g.tec Nautilus, g.tec medical engineering, Graz, Austria) with 16 electrodes covering the sensorimotor cortex in the international 10-10 system at positions (Fz, FC3, FC2, FCz, FC2, FC4, C3, C1, Cz, C2, C4, CP3, CP1, CPz, CP2, CP4). The signals were recorded at 500Hz with a hardware-implemented bandpass filter between 0.1 and 100 Hz and sent to a computer in the same room. The reference electrode was placed on the right earlobe.\nTendon vibration was achieved with electromechanical wireless vibrators set into a soft, elastic brace on the left elbow joint (Vibramoov, Techno Concept, Manosque, France). The left arm was chosen since it was demonstrated that illusions start faster and are more vivid in the non-dominant extremity. One vibrator was sitting against the distal biceps tendon and the other against the distal triceps tendon on the same arm. Time information about the beginning of each stimulation was sent via a cable link to the computer and stored with the EEG data.\n\nStudy protocol:\nEEG was recorded continuously while delivering stimulation sequences consisting of two different vibration types. The first elicited an illusion of elbow extension and was produced by vibrating the distal biceps tendon at 90Hz and the distal triceps tendon at 50Hz. The second produced only a vibration sensation without any movement illusion and consisted of stimulating both tendons at 70Hz. So, the average frequency of stimulation delivered to the agonist-antagonist pair was the same between conditions, but one condition was designed to induce a clear illusion and the other no illusion at all (control).\nEach stimulation lasted three seconds and consisted of one second of linear frequency ramp-up, one second of a stable frequency interval and one second of linear frequency ramp-down. The linear ramps started and ended 10 Hz below the target frequency for each stimulation type. The amplitude of the vibration was 2-3 mm. These parameters were based on Romaiguère et al. (2003) and the perception of illusory movement across all subjects was ensured in a pre-screening procedure. This setting was kept constant throughout the whole recording session. \nEach subject underwent three blocks of 72 vibrations (36 illusion, 36 control), arranged randomly and different for each block. The same stimulus sequences were employed for each participant. Inter stimulus intervals varied between one and three seconds and were randomized within and between blocks in order to minimize stimulus onset anticipation.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003343",
    "exists": true,
    "description": null,
    "created_at": "2020-11-12T07:15:52+00:00",
    "updated_at": "2021-05-05T13:15:34+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}