{
  "dataset_id": "ds003568",
  "date_retrieved": "2025-07-31T00:23:13.552361+00:00",
  "dataset_description": {
    "Acknowledgements": "This research was supported by the Intramural Research Program of the National Institute of Mental Health National Institutes of Health (NIH). This work used the computational resources of the NIH HPC (high-performance computing) Biowulf cluster (http://hpc.nih.gov).",
    "Authors": [
      "Lucrezia Liuzzi",
      "Katharine Chang",
      "Hanna Keren",
      "Charles Zheng",
      "Dipta Saha",
      "Dylan Nielson",
      "Argyris Stringaris"
    ],
    "BIDSVersion": "1.2.0",
    "DatasetDOI": "10.18112/openneuro.ds003568.v1.0.2",
    "Funding": [
      "Intramural Research Program of the National Institute of Mental Health National Institutes of Health (NIH) (Grant No. ZIA-MH002957-01 [to AS])"
    ],
    "HowToAcknowledge": "Please cite: Lucrezia Liuzzi, Katharine Chang, Hanna Keren, Charles Zheng, Dipta Saha,Dylan Nielson and Argyris Stringaris, Electrophysiological correlates of mood and reward dynamics in human adolescents, BioRxiv 2021",
    "License": "CC0",
    "Name": "Mood induction in MDD and healthy adolescents",
    "ReferencesAndLinks": [
      "https://www.biorxiv.org/content/10.1101/2021.03.04.433969v1"
    ],
    "EthicsApprovals": [
      "NIH Institutional Review Board"
    ]
  },
  "readme_content": "This dataset contains the MEG and structural MRI data from the \"Electrophysiological correlates of mood and reward dynamics in human adolescents\" pre-registered analysis (https://www.biorxiv.org/content/10.1101/2021.03.04.433969v1).\n  \nThe task-mmi3 data corresponds to the monetary gambling mood induction task described in the paper. Task-mmi3 data has been pre-processed marking bad channels and bad segments (motion > 5mm or/and noise artifacts). \nTask-rest data is unprocessed 10 minutes resting state scan acquired during the same scanning session. \n\nAnatomical MRIs have been defaced and co-registered fiducial coordinates are available in the anatomical json files. \n\nData from four confirmatory subjects are not made available because of missing data sharing consent.\nsub-22658 and sub-24247 do not have an available structural scan. \n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003568",
    "exists": true,
    "description": null,
    "created_at": "2021-03-16T23:53:32+00:00",
    "updated_at": "2021-03-18T16:32:44+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}