{
  "dataset_id": "ds004024",
  "date_retrieved": "2025-07-31T00:13:28.922616+00:00",
  "dataset_description": {
    "Name": "TMS-EEG-MRI-fMRI-DWI data on paired associative stimulation and connectivity (Shirley Ryan AbilityLab, Chicago, IL)",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Julio Cesar Hernandez Pavon",
      "Nils Schneider Garces",
      "John Patrick Begnoche",
      "Lee Miller",
      "Tommi Raij"
    ],
    "Description": "These cortico-cortical paired associative stimulation (ccPAS) data were collected in a bi-focal MRI-navigated TMS-EEG study where the left and right hemisphere primary motor (M1) cortices were stimulated with TMS while EEG was recorded. EEG was collected from 64 channels in DC mode (REF = right mastoid). The EEG electrode locations were recorded to allow EEG source analysis. The M1 targets were the first dorsal interossei (FDI) hand muscle representation in each hemisphere. During the ccPAS run (ccPAS) for modulating left->right M1 connectivity, the left hemisphere M1 was always stimulated first at t = 0 ms, and the right hemisphere M1 was stimulated slightly later, at t = 4 ms (asynchrony = 4 ms), at 9 ms (asynchrony = 9 ms), or at 14 ms (asynchrony = 14 ms), in three separate sessions at least 1 week apart. To observe the effects of ccPAS modulation in each session, unifocal single-pulse TMS (spTMS) was delivered immediately before ccPAS (spTMS-Before), 10 minutes after ccPAS (spTMS-After 10), and 60 minutes after ccPAS (spTMS-After 60), targeting either the left or the right hemisphere M1 in separate runs, leading to a total of 6 EEG runs with spTMS. spTMS intensity was 100% rMT (spTMS runs 01-06, collected in all sessions) or 110% rMT (spTMS runs 07-12, not collected in all sessions). In addition, resting-state EEG data (eyes open, fixation cross) without TMS pulses were collected at the beginning of the session (resting-Control), immediately before ccPAS (resting-Before), 10 minutes after ccPAS (resting-After 10), and 60 minutes after ccPAS (resting After 60), leading to a total of 4 runs with resting-state EEG data (in some sessions resting-Control is missing, in which case there are only 3 resting-state runs). Some subjects did not participate in all 3 EEG sessions, leading to that EEG data is missing from some of the asynchrony 4/9/14 ms conditions. All subjects also participated in an MRI session where at least a T1w structural image was acquired; some subjects were additionally recorded with a resting-state fMRI scan and/or a high-angular-resolution (HARDI) diffusion scan (SMS 271 directions). Some subjects participated in additional TMS-EEG sessions without ccPAS where the left hemisphere M1 or DLPFC were stimulated with spTMS at various intensities.",
    "Acknowledgements": "We thank Mainak Jas for expert advice on BIDS.",
    "License": "CC0",
    "HowToAcknowledge": "Hernandez-Pavon JC, Schneider-Garces N, Begnoche JP, Miller LE, Raij T (2022) Targeted modulation of human brain interregional effective connectivity with spike-timing dependent plasticity. Neuromodulation: Technology at the Neural Interface. Accepted. ",
    "EthicsApprovals": [
      "STU00204239"
    ],
    "Funding": [
      "Dr. Ralph and Marian Falk Medical Research Trust"
    ],
    "ReferencesAndLinks": [
      "NCT03723434"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004024.v1.0.1"
  },
  "readme_content": "﻿References\n----------\nAppelhoff, S., Sanderson, M., Brooks, T., Vliet, M., Quentin, R., Holdgraf, C., Chaumon, M., Mikulan, E., Tavabi, K., Höchenberger, R., Welke, D., Brunner, C., Rockhill, A., Larson, E., Gramfort, A. and Jas, M. (2019). MNE-BIDS: Organizing electrophysiological data into the BIDS format and facilitating their analysis. Journal of Open Source Software 4: (1896). https://doi.org/10.21105/joss.01896\n\nPernet, C. R., Appelhoff, S., Gorgolewski, K. J., Flandin, G., Phillips, C., Delorme, A., Oostenveld, R. (2019). EEG-BIDS, an extension to the brain imaging data structure for electroencephalography. Scientific Data, 6, 103. https://doi.org/10.1038/s41597-019-0104-8\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004024",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds004024",
    "created_at": "2022-02-15T02:13:20+00:00",
    "updated_at": "2025-04-07T17:06:02+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}