{
  "dataset_id": "ds004166",
  "date_retrieved": "2025-07-31T00:18:45.285495+00:00",
  "dataset_description": {
    "Name": "Effects of Forward and Backward Span Trainings on Working Memory: Evidence from a Randomized, Controlled Trial",
    "BIDSVersion": "1.7.0",
    "HEDVersion": "8.0.0",
    "License": "CC0",
    "Authors": [
      "Yang Li (data and curation)",
      "Wenjin Fu (data)",
      "Qiumei Zhang (data)",
      "Xiongying Chen (data)",
      "Xiaohong Li (data)",
      "Boqi Du (data)",
      "Xiaoxiang Deng (data)",
      "Feng Ji (curation)",
      "Qi Dong (curation)",
      "Feng Ji (curation)",
      "Susanne M. Jaeggi (curation)",
      "Chuansheng Chen (curation)",
      "Jun Li (data and curation)"
    ],
    "Funding": [
      "This work was supported by grants from the National Natural Science Foundation of China (31771242). The authors declared that they have no conflict of interest."
    ],
    "References": [
      "Motter, J. N., Pimontel, M. A., Rindskopf, D., Devanand, D. P., Doraiswamy, P. M., & Sneed, J. R. (2016). Computerized cognitive training and functional recovery in major depressive disorder: A meta-analysis. J Affect Disord, 189, 184-191. doi:10.1016/j.jad.2015.09.022.",
      "A Hempel, F. L. G., Nohazarahit M Garcia Caraballo, Michael Amann, Heiko Meyer, Torsten Wustenberg, Marco Essig, Johannes Schroder. (2004). Plasticity of Cortical Activation Related to Working Memory During Training. American Journal of Psychiatry, 161(4), 745-747. doi:10.1176/appi.ajp.161.4.745.",
      "Alloway, T. P., Gathercole, S. E., Kirkwood, H., & Elliott, J. (2009). The cognitive and behavioral characteristics of children with low working memory. Child Dev, 80(2), 606-621. doi:10.1111/j.1467-8624.2009.01282.x.",
      "Alloway, T. P., Gathercole, S. E., Willis, C., & Adams, A. M. (2004). A structural analysis of working memory and related cognitive skills in young children. J Exp Child Psychol, 87(2), 85-106. doi:10.1016/j.jecp.2003.10.002."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004166.v1.0.0"
  },
  "readme_content": "## Effects of Forward and Backward Span Trainings on Working Memory: Evidence from a Randomized, Controlled Trial\r\n\r\n### Introduction\r\n\r\n**Overview:** Both forward and backward working memory span tasks have been used in cognitive training, but no study has\r\n been conducted to test whether the two types of trainings are equally effective. Based on data from a larger randomized\r\n controlled trial, this study tested the effects of backward span training, forward span training, and no intervention. \r\nEvent-related potential (ERP) signals were recorded at the pre-, mid-, and post-tests while the subjects were performing \r\na distractor version of the change detection task, which included three conditions (2 targets and 0 distractor [2T0D];\r\n 4 targets and 0 distractor [4T0D]; and 2 targets and 2 distractors [2T2D]). Behavioral data were collected from two additional\r\n tasks: a multi-object version of the change detection task, and a suppress task. Compared to no intervention, both forward \r\nand backward span trainings led to significantly greater improvement in working memory maintenance, based on indices from \r\nboth behavioral (Kmax) and ERP data (CDA_2T0D and CDA_4T0D). Backward span training also improved interference control based \r\non the ERP data (CDA_filtering efficiency) to a greater extent than did forward span training and no intervention, but the three groups \r\ndid not differ in terms of behavioral indices of interference control. These results have potential implications for optimizing the current \r\ncognitive training on working memory.\r\n\r\n### Methods   \r\n\r\n**Subjects:** Volunteers from university recruited through advertisements.  \r\n \r\n**Apparatus:**  At all three time points (pre-, mid-, and post-tests), we used a 64-channel Synamps RT system (Neuroscan, El Paso, USA) \r\nto record the electroencephalogram (EEG) signals. Subjects were required to sit in a comfortable chair inside a darkened, electrically shielded \r\nrecording chamber during the EEG recording. The electrode impedance was low (below 5kΩ). The reference electrode was on the left mastoid. \r\nElectrodes were set both below and above the right eye to record the vertical electrooculographies (EOGs). Electrodes were set at the outer canthi\r\n of each eye to record the horizontal EOGs. \r\n**EEG dataset:** Backward group (sub-01~sub020);  Forward group (sub-101~sub120); Control group (sub-201~sub220); Sudoku group (sub-301~sub320). \r\n                          Pre-test(ses-01); Mid-test(ses-01); Post-test(ses-01);\r\n\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004166",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds004166",
    "created_at": "2022-06-17T10:33:07+00:00",
    "updated_at": "2022-06-17T10:33:07+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}