{
  "dataset_id": "ds005385",
  "date_retrieved": "2025-07-31T00:11:13.382771+00:00",
  "dataset_description": {
    "Name": "Resting-state EEG data before and after cognitive activity across the adult lifespan and a 5-year follow-up",
    "BIDSVersion": "1.9.0",
    "License": "CC0",
    "Authors": [
      "Edmund Wascher",
      "Daniel Schneider",
      "Patrick D. Gajewski",
      "Stephan Getzmann"
    ],
    "Acknowledgements": "The study is endorsed by German Center for Mental Health (DZPG). Dataset created with the help of: bids-matlab (see References). We are grateful to the technical staff at IfADo for data collection and to all participants of the Dortmund Vital Study.",
    "HowToAcknowledge": "please cite:",
    "DatasetDOI": "doi:10.18112/openneuro.ds005385.v1.0.3",
    "Funding": [
      "The Dortmund Vital Study is funded by the institute’s budget (no grant number). Thus, the study design, collection, management, analysis, interpretation of data, writing of the report, and the decision to submit the report for publication is not influenced or biased by any sponsor."
    ],
    "ReferencesAndLinks": [
      "Gajewski, P. D., Getzmann, S., Bröde, P., Burke, M., ...Cadenas, C., Capellino, S., Claus, M., Genç, E., Golka, K., Hengstler, J. G., ...Kleinsorge, T., Marchan, R., Nitsche, M. A., Reinders, J., van Thriel, C., Watzl, C., ...& Wascher, E. (2022). Impact of Biological and Lifestyle Factors on Cognitive ...Aging and Work Ability in the Dortmund Vital Study: Protocol of an Interdisciplinary, ...Cross-sectional, and Longitudinal Study. JMIR Research Protocols, 11(3), e32352. https://doi.org/10.2196/32352",
      "Gau, R., Flandin, G., Janke, A. , Oostenveld, R., Madan, C., Niso Galán, G., Szczepanik, M., Mutsaerts, H., Beliy, N., Norgaard, M., Pernet, C., & Chrisophe, P. bids-matlab (Version 0.1.0) https://github.com/bids-standard/bids-matlab"
    ]
  },
  "readme_content": "# README\r\n\r\n## Details related to access to the data\r\n\r\n- [x] Data user agreement\r\n\r\nDataset publicly available under the Creative Commons CC0 license after a grace period of 36 months.\r\n\r\n- [x] Contact person\r\n\r\nEdmund Wascher, IfADo, wascher@ifado.de, ORCID: 0000-0003-3616-9767\r\nDaniel Schneider, IfADo, schneiderd@ifado.de, ORCID: 0000-0002-2867-2613\r\nPatrick D. Gajewski, IfADo, gajewski@ifado.de, ORCID: 0000-0001-8240-1702\r\nStephan Getzmann, IfADo, getzmann@ifado.de, ORCID: 0000-0002-6382-0183\r\n\r\n- [x] Practical information to access the data\r\n\r\nThe data are provided at OpenNeuro (dataset accession number: ds005385, DOI: https://doi.org/10.18112/openneuro.ds005385.v1.0.0) in BIDS format.\r\n\r\n## Overview\r\n\r\n- [x] Project name\r\n\r\nResting-state EEG activity before and after cognitive activity at baseline and a 5-years follow-up.\r\n\r\n- [x] Year(s) that the project ran\r\n\r\n2016-2024\r\n\r\n- [x] Brief overview of the tasks in the experiment\r\n\r\nResting-state EEG (rs-EEG) is a non-invasive measure of the spontaneous electrical activity of the brain, measured while remaining still and relaxed, and without performing any assigned cognitive tasks. Changes in rs-EEG are associated with numerous psychiatric disorders, but also with normal aging and with factors such as fatigue and motivation. Analyses of longitudinal rs-EEG measurements in healthy subjects over the entire adult lifespan could help to better understand the underlying brain processes, their development across the lifespan, and differences in brain activity between healthy and clinically relevant groups. The data set is part of the Dortmund Vital Study (ClinicalTrials.gov Identifier: NCT05155397), a prospective study on the determinants of healthy cognitive aging. The experiments comprised the recording of resting-state EEG data before and after a 2-hour block of cognitive experimental tasks. There are baseline measurements and about 5-years follow-up measurements of a subsample of healthy adult participants (for more information, Gajewski et al., 2022, doi: 10.2196/32352).\r\n\r\n- [x] Description of the contents of the dataset\r\n\r\nThe dataset consists of 64-channels resting-state EEG recordings of 608 participants aged between 20 and 70 years, measured for three minutes with eyes open and eyes closed before and after a 2-hour block of demanding cognitive experimental tasks. Additional follow-up measurements are available from 208 subjects who also took part in the baseline measurement. The baseline measurements took place between 2016 and 2023, the follow-up measurements at intervals of around 5 years, starting 2021. The years of the baseline and follow-up measurements are specified in the sub-xxx_sessions.tsv file for each subject. The procedure for this (ongoing) follow-up measurement is exactly the same as for the first measurement.\r\n\r\n- [x] Independent variables\r\n\r\nInformation on Age, Sex, Handeness of the participants are provided.\r\n\r\n- [x] Dependent variables\r\n\r\nSpontaneous EEG Activity is measured.\r\n\r\n- [ ] Control variables\r\n\r\nn/a\r\n\r\n- [x] Quality assessment of the data\r\n\r\nThe data was checked for completeness and includes the non-preprocessed raw EEG.\r\n\r\nAn estimate of the reliability of the rs-EEG data was provided by a study, in which the intra-class correlation (ICC) in absolute EEG alpha power (8-13 Hz) of all four recordings at the first measurement (session 1) was examined on selected frontal and parietal electrodes in a subgroup of 370 participants (Metzen et al., 2022, doi: 10.1007/s00429-021-02399-1). The ICC ranged between 0.92 and 0.94 in the eyes-closed condition and between 0.87 and 0.90 in the eyes-open condition, indicating good to excellent ratings of alpha power reliability. A recent analysis of the reliability of EEG microstate indicated good to excellent short-term retest-reliability of microstate durations, occurrences, and coverages in a subgroup of 583 participants, as well as good overall short, intermediate, and long-term re-test reliability of these microstate characteristics across session 1 and session 2, covering a period of more than half a year (Kleinert et al., 2024, doi: 10.1007/s10548-023-00982-9).\r\n\r\n## Methods\r\n\r\n### Subjects\r\n\r\nThe subject pool consists of participants in the Dortmund Vital Study and includes people of working age between 20 and 70 years. 61.8% of the subjects of the baseline measurement are female, 93.1% are right-handed. The participants reported to be healthy and free of medication that might affect their attention during the experimental sessions. In general, the study population can be considered as representative in terms of age distribution, genetics, cognitive performance parameters, and occupation, whereas there were differences in gender distribution and educational qualifications compared to the general population in Germany (for details, see Gajewski et al., 2022, doi: 10.2196/32352).\r\n\r\n- [x] Information about the recruitment procedure\r\n\r\nThe participants were recruited from local companies, and public institutions, and through advertisements in newspapers and public media.\r\n\r\n- [ ] Subject inclusion criteria (if relevant)\r\n- [x] Subject exclusion criteria (if relevant)\r\n\r\nExclusion criteria were history of severe diseases, namely neurological diseases (such as dementia, Parkinson disease, or stroke); cardiovascular, oncological, and eye diseases; psychiatric and affective disorders; head injuries, head surgery, and head implants; use of psychotropic drugs and neuroleptics; limited physical fitness and mobility.\r\n\r\n### Apparatus\r\n\r\nThe measurements took place in a quiet laboratory room while the subject was sitting. The resting-state EEG was recorded using a 64-channel elastic cap (actiCap system, Brain Products GmbH; Munich, Germany) arranged based on the 10-20 system with FCz electrode as on-line reference, and a BrainVision Brainamp DC amplifier and BrainVision Recorder software (BrainProducts GmbH). The EEG signal was recorded with 1000-Hz sampling rate and filtered online by a 250-Hz low-pass filter. Impedances were kept below 10 kOhm.\r\n\r\n### Initial setup\r\n\r\nAfter arriving at institute there was an introductory meeting to clarify the procedure and open questions, to explain the aim of the study, and to explain open questions regarding informed consent forms and anonymization of the data. In the next step the EEG cap was mounted, and the tasks explained. \r\n\r\n### Task organization\r\n\r\n- [x] Was task order counter-balanced?\r\n\r\nThe resting-state EEG was always recorded first with the eyes closed and then with the eyes open.\r\n\r\n- [x] What other activities were interspersed between tasks?\r\n\r\nThe resting-state EEG with eyes closed and eyes open was measured before and after a 2-hour block of cognitive tasks.\r\n\r\n- [x] In what order were the tasks and other activities performed?\r\n\r\nThe cognitive block comprised five tasks on visual attention, vigilance, stimulus-response conflict processing, updating and statistical learning, and speech-in-noise perception and auditory selective attention. The tasks were carried out one after the other with short breaks (for details, see Gajewski et al., 2022, doi: 10.2196/32352).\r\n\r\n### Task details\r\n\r\nRecordings consists of resting-state EEG epochs measured for three minutes with eyes open and eyes closed before and after a 2-hour block of cognitive experimental tasks. During the resting-state EEG measurement, the subjects should sit quietly and relaxed.\r\n\r\n### Additional data acquired\r\n\r\nn/a\r\n\r\n### Experimental location\r\n\r\nThe measurements took place at the Leibniz Research Centre for Working Environment and Human Factors at Dortmund University (IfADo) in Dortmund, Germany.\r\n\r\n### Missing data\r\n\r\n- Information on handeness is missing for two subjects.\r\n\r\n### Notes\r\n\r\nPlease note that the physical max/min specifications in the header of the EDF files may contain invalid values. These should be ignored.\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005385",
    "exists": true,
    "description": "OpenNeuro dataset - Resting-state EEG data before and after cognitive activity across the adult lifespan and a 5-year follow-up",
    "created_at": "2024-07-31T06:39:01+00:00",
    "updated_at": "2025-05-05T12:09:52+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}