{
  "dataset_id": "ds004796",
  "date_retrieved": "2025-07-31T00:14:20.859430+00:00",
  "dataset_description": {
    "Name": "A Polish Electroencephalography, Alzheimer’s Risk-genes, Lifestyle and Neuroimaging (PEARL-Neuro) Database",
    "BIDSVersion": "1.0.2",
    "License": "CC0",
    "Authors": [
      "Dzianok Patrycja",
      "Kublik Ewa"
    ],
    "HowToAcknowledge": "Dzianok P, Kublik E. PEARL-Neuro Database: EEG, fMRI, health and lifestyle data of middle-aged people at risk of dementia. Sci Data 11, 276 (2024). DOI: https://doi.org/10.1038/s41597-024-03106-5",
    "Funding": [
      "Polish National Science Center (NCN) grant no. 2018/31/N/HS6/03551"
    ],
    "EthicsApprovals": [
      "This study was approved by the Bioethics Committee of the Nicolaus Copernicus University in Toruń at the Ludwik Rydygier Collegium Medicum in Bydgoszcz, Poland (KB 684/2019)"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004796.v1.1.0",
    "Genetics": {
      "Dataset": "https://openneuro.org/datasets/ds004796",
      "Database": "https://openneuro.org/datasets/ds004796"
    },
    "ReferencesAndLinks": []
  },
  "readme_content": "## A Polish Electroencephalography, Alzheimer’s Risk-genes, Lifestyle and Neuroimaging (PEARL-Neuro) Database \n\nIMPORTANT NOTE: The dataset contains no errors (BIDS-1). The numerous warnings currently displayed are a result of OpenNeuro updating its validator to BIDS-2. The OpenNeuro team is actively working on refining the validator to display only meaningful warnings (more information on OpenNeuro GitHub page). At this time, as dataset owners, we are unable to take any action to resolve these warnings.\n\n### Data Descriptor:\n* doi.org/10.1038/s41597-024-03106-5 (https://www.nature.com/articles/s41597-024-03106-5)\n\n### Please cite the following reference if you use these data:\n* Dzianok P, Kublik E. PEARL-Neuro Database: EEG, fMRI, health and lifestyle data of middle-aged people at risk of dementia. Sci Data 11, 276 (2024). DOI: https://doi.org/10.1038/s41597-024-03106-5\n\n### Publications related to this dataset, reporting & additional data\n\n* https://github.com/PTDZ/PEARL-Neuro — updates, additional study details, and list of research outputs related to this dataset.\n\nIMPORTANT: Please inform us of any research outputs related to the shared data, including publications, preprints, posters, abstracts, talks, and any commercial usage. This is crucial for ensuring transparency and informing users about the analyses already performed on this dataset. Additionally, such information can foster collaboration.\n\n### Description of the database:\n\nFull cohort: 192 healthy middle-aged (50-63) individuals, balanced female and male ratio. \n\n* Genetic data (N = 192):\n\t* Apolipoprotein E (APOE) \n\t* Phosphatidylinositol binding clathrin assembly protein (PICALM)\n* Basic demographic and health data\n* Psychometric data (memory, intelligence, mood, personality, stress coping strategies)\n\nCohort subgroup: 79 healthy middle-aged (50-63) individuals, balanced female and male ratio.\n\n* Neuroimaging data:\n\t* Functional data — electroencefalography (EEG) and functional magnetic resonance imaging (fMRI):\n\t\t* Resting-state protocol (with two conditions: eyes open and eyes closed) \n\t\t* Cognitive tasks: multi-source interference task (MSIT) and Sternberg’s memory task\n* Blood tests data (blood count, lipid profile, HSV virus)\n\n### Release history:\n* 10/2023: Initial release\n* 02/2024: Public release\n* 06/2025, version: 1.1.0 — marker corrections in .tsv and .vmrk EEG resting-state files\n\nDuring EEG data acquisition, technical issues led to missing starting markers for the eyes-open and/or eyes-closed conditions in the resting-state protocol for some participants. As described in the Data Note, the S1 marker indicates the end of the instruction phase—when the participant presses \"Enter\" to begin a condition (either eyes-open or eyes-closed). Consequently, the first S1 marker coincides with the S2 marker (start of the eyes-open condition), and the second S1 marker aligns with the S4 marker (start of the eyes-closed condition).\n\nTo ensure consistency with Table 5 in the released Data Note, the missing markers were added to the relevant files (.tsv and .vmrk) for the following participants: 08, 09, 11, 12, 14, 15, 21, 22, 25, 35, 42, 54, 62, 64, 65, 67, 70, 71, 73, 75, and 79.\n\nFor participants 19 and 30, the S11 marker (indicating the end of the task and accompanying sound effect) was not saved, resulting in a slightly shorter eyes-closed recording duration (by approximately 30–60 seconds).\n\nFor participant 34, the S11 marker was also not recorded because he/she forgot to press \"Enter\" to mark the start of the eyes-closed condition, pressing it only after the condition had ended. However, he/she followed the instructions and kept his/her eyes closed during the condition. Therefore, the relevant markers (S1/S4) were manually adjusted to reflect the correct start time.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004796",
    "exists": true,
    "description": "OpenNeuro dataset - A Polish Electroencephalography, Alzheimer’s Risk-genes, Lifestyle and Neuroimaging (PEARL-Neuro) Database",
    "created_at": "2024-02-18T10:39:35+00:00",
    "updated_at": "2025-06-22T11:09:01+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}