{
  "dataset_id": "ds005586",
  "date_retrieved": "2025-07-31T00:24:42.989515+00:00",
  "dataset_description": {
    "Name": "Electroencephalographic responses to the number of objects in partially occluded and uncovered scenes",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "Authors": [
      "Cemre Baykan",
      "Alexander C. Schütz"
    ],
    "Acknowledgements": "ACS and CB were supported by the European Research Council (ERC) under the European Union's Horizon 2020 research and innovation programme (grant agreement No. 101001250). ACS was supported by The Adaptive Mind, funded by the Excellence Program of the Hessian Ministry of Higher Education, Science, Research and Art.",
    "DatasetDOI": "doi:10.18112/openneuro.ds005586.v2.0.0",
    "License": "CC0"
  },
  "readme_content": "﻿**Passing Viewing Task**\r\n\r\n23 participants took part in this study in return for a monetary incentive at University of Marburg. \r\n\r\nParticipants performed a passive viewing task in a dimly lit room. The visual scene consisted of a game board, game pieces and a mesh as an occluder. \r\n\r\nEach trial started with a fixation cross presentation for one second plus the duration of the drift correction procedure. The game board and occluder were presented for two seconds, while game pieces only appeared in the last one second of this presentation. Following the “partially occluded scene”, the occluder disappeared to uncover the hidden parts of the game board along with the visible game pieces leading to the “uncovered scene” phase. The uncovered scene was presented for one second. \r\n\r\nThe experiment consisted of eight blocks of 80 trials each. There were two conditions of initially visible game pieces: 4 or 32 pieces, each with 8 uncovered conditions: 0, 1, 2, 4, 28, 30, 31 or 32 uncovered game pieces. All 16 conditions were repeated 40 times during the experiment, summing up to 640 trials in total.\r\n\r\nParticipants 9, 10 and 15 were excluded from the analyses due to excessive head movements and equipment malfunction.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005586",
    "exists": true,
    "description": "OpenNeuro dataset - EEG responses to the number of objects in partially occluded and uncovered scenes",
    "created_at": "2024-10-24T11:51:39+00:00",
    "updated_at": "2024-11-02T10:49:22+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}