{
  "dataset_id": "ds004860",
  "date_retrieved": "2025-07-31T00:13:05.721702+00:00",
  "dataset_description": {
    "Name": "Investigating the cognitive conflict triggered by moral judgment of accidental harm : an event-related potentials study",
    "License": "CC0",
    "Authors": [
      "Flora Schwartz",
      "Radouane El-Yagoubi",
      "Julie Cayron",
      "Pierre-Vincent Paubel",
      "Bastien Tremoliere"
    ],
    "ReferencesAndLinks": [
      ""
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "",
    "DatasetDOI": "doi:10.18112/openneuro.ds004860.v1.0.0"
  },
  "readme_content": "EEG data collected from 31 participants as part of a research program on moral judgment.\r\nThe experiment consists of a third-party moral judgment task integrated into a semantic judgment task (N400). Participants listened to moral scenarios featuring either intentional or accidental harm transgressions. The last word of the scenario appeared as text (target) and participants had to respond whether the target was congruent with the scenario they just heard by pressing a response button. The target was congruent half of the time. The agent's intention and semantic congruency were manipulated orthogonally, leading to 4 within-subject conditions. For 20% of the moral scenarios, a moral judgment question (punishment) was presented immediately after the congruency judgment and participants indicated how much punishment the agent responsible for the moral transgression deserved using a joystick.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004860",
    "exists": true,
    "description": "OpenNeuro dataset - Investigating the cognitive conflict triggered by moral judgment of accidental harm : an event-related potentials study",
    "created_at": "2023-11-23T17:52:43+00:00",
    "updated_at": "2023-11-23T17:54:48+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}