{
  "dataset_id": "ds004942",
  "date_retrieved": "2025-07-31T00:23:54.929479+00:00",
  "dataset_description": {
    "ReferencesAndLinks": [
      "None"
    ],
    "Authors": [
      "Paul Kieffaber",
      "Makenna McGill"
    ],
    "Name": "SpatialMemory",
    "License": "CC0",
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "DatasetDOI": "doi:10.18112/openneuro.ds004942.v1.0.0"
  },
  "readme_content": "Visuo-spatial working memory (VSWM) for sequences is thought to be crucial for daily behaviors. Decades of research indicate that oscillations in the gamma and theta bands play important functional roles in the support of visuo-spatial working memory, but the vast majority of that research emphasizes measures of neural activity during memory retention. The primary aims of the present study were (1) to determine whether oscillatory dynamics in the Theta and Gamma ranges would reflect item-level sequence encoding during a computerized spatial span task, (2) to determine whether item-level sequence recall is also related to these neural oscillations, and (3) to determine the nature of potential changes to these processes in healthy cognitive aging. Results indicate that VSWM sequence encoding is related to later (~700 ms) gamma band oscillatory dynamics and may be preserved in healthy older adults; high gamma power over midline frontal and posterior sites increased monotonically as items were added to the spatial sequence in both age groups. Item-level oscillatory dynamics during the recall of VSWM sequences were related only to theta-gamma phase amplitude coupling (PAC), which increased monotonically with serial position in both age groups. Results suggest that, despite a general decrease in frontal theta power during VSWM sequence recall in older adults, gamma band dynamics during encoding and theta-gamma PAC during retrieval play unique roles in VSWM and that the processes they reflect may be spared in healthy aging.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004942",
    "exists": true,
    "description": "OpenNeuro dataset - SpatialMemory",
    "created_at": "2024-02-23T13:49:27+00:00",
    "updated_at": "2024-02-23T14:03:04+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}