{
  "dataset_id": "ds004356",
  "date_retrieved": "2025-07-31T00:21:54.388623+00:00",
  "dataset_description": {
    "Name": "Subcortical responses to music and speech are alike while cortical responses diverge",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Tong Shan",
      "Madeline S. Cappelloni",
      "Ross K. Maddox"
    ],
    "Funding": [
      "the Schmitt Program in Neuroscience"
    ],
    "EthicsApprovals": [
      "approved by the University of Rochester Subjects Review Board (#66988)"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004356.v2.2.1",
    "ReferencesAndLinks": [
      "Shan, T., Cappelloni, M.S. & Maddox, R.K. Subcortical responses to music and speech are alike while cortical responses diverge. Sci Rep 14, 789 (2024). https://doi.org/10.1038/s41598-023-50438-0"
    ]
  },
  "readme_content": "# README\n\n## Details related to access to the data\n\nPlease contact the following authors for further information:\n- Tong Shan (email: tshan@ur.rochester.edu)\n- Ross K. Maddox (email: rmaddox@ur.rochester.edu)\n\n## Overview\n\nThe goal of this study is to derive Auditory Brainstem Response (ABR) from continuous music and speech stimuli using deconvolution method. Data collected from Jun to Aug, 2021.\n\nThe details of the experiment can be found at Shan et al. (2024). There were two phases in this experiment. For the first phase, ten trials of one-minute clicks were presented to the subjects. For the second phase, the 12 types (six genres of music and six types of speech) of 12 s stimuli clips were presented. There were 40 trials \nfor each type with shuffled order. Between trials, there was a 0.5 s pause. \n\nThe code for stimulus preprocessing and EEG analysis is available on Github: \n\nhttps://github.com/maddoxlab/Music_vs_Speech_abr\n\n\n## Format\n\nThis dataset is formatted according to the EEG Brain Imaging Data Structure. It includes EEG recording from subject 001 to subject 024 (excluding subject 014 and subject 021) in raw brainvision format (including `.eeg`, `.vhdr`, and `.vmrk` triplet) and stimuli files in format of `.wav`. \n\nFor some subjects (sub-03 & sub-19), there are 2 \"runs\" of data that the first run (`run-01`) only contains the click phase (phase 1), and the second run includes the data for the ABR analysis. \n\nTriggers with values of \"1\" were recorded to the onset of the stimulus, and shortly after triggers with values of \"4\" or \"8\" were stamped to indicate the stimulus types and the trial number out of 40. This was done by converting the decimal trial number to bits, denoted b, then calculating 2 ** (b + 2). Triggers of \"999\" denote the start of a new segment of EEG. We've specified these trial numbers and more metadata of the events in each of the `*_eeg_events.tsv` file, which is sufficient to know which trial corresponded to which type of stimulus and which file.\n\n\n## Subjects\n\n24 subjects participated in this study.\n\n**Subject inclusion criteria**\n1. Age between 18-40.\n2. Normal hearing: audiometric thresholds of 20 dB HL or better from 500 to 8000 Hz.\n3. Speak English as their primary language.\n4. Self-reported normal or correctable to normal vision.\n\n**Subject exclusion criteria**\n1. Subject 014 self-withdrew partway through the experiment.\n2. Subject 021 was excluded because of technical problems during data collection that led to unusable data.\n\nTherefore, after excluding the two subjects, there were 22 subjects (11 male and 11 female) with an age of 22.7 ± 5.1 (mean ± SD) years that we included in the analysis. Please see `subjects.tsv` for more demography.\n\n## Apparatus\n\nSubjects were seated in a sound-isolating booth on a chair in front of a 24-inch BenQ monitor with a viewing distance of approximately 60 cm. Stimuli were presented at an average level of 65 dB SPL and a sampling rate of 48000 Hz through ER-2 insert earphones plugged into an RME Babyface Pro digital sound card. The stimulus presentation for the experiment was controlled by a python script using a custom package, `expyfun`. \n\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004356",
    "exists": true,
    "description": "OpenNeuro dataset - Subcortical responses to music and speech are alike while cortical responses diverge",
    "created_at": "2022-12-12T17:34:59+00:00",
    "updated_at": "2024-01-18T17:43:15+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}