{
  "dataset_id": "ds004389",
  "date_retrieved": "2025-07-31T00:18:06.240947+00:00",
  "dataset_description": {
    "Name": "Somatosensory evoked potentials in the human spinal cord to mixed and sensory nerve stimulation",
    "Authors": [
      "Birgit Nierula",
      "Tilman Stephani",
      "Merve Kaptan",
      "André Moruaux",
      "Burkhard Maess",
      "Gabriel Curio",
      "Vadim V. Nikulin",
      "Falk Eippert"
    ],
    "Acknowledgements": "This data was acquired with the help of our student research assistants Janek Haschke, Pia-Lena Baisch, Paula Kosel, Max Braune, Samuel Simeon, and Marleen Löffler.",
    "ReferencesAndLinks": [
      "https://osf.io/mjdha"
    ],
    "Funding": [
      "n/a"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004389.v1.0.0",
    "BIDSVersion": "1.6.0",
    "License": "CC0"
  },
  "readme_content": "Description\n--------\nThis is a data set consisting of simultaneous electroencephalography (EEG), electrospinography (ESG), electroneurography (ENG), and electromyography (EMG) recordings from 26 participants. There were nine different recording conditions: i) resting state with eyes open, ii) mixed median nerve stimulation (arm nerve), iii) mixed tibial nerve stimulation (leg nerve), iv) sensory nerve stimulation of the index finger, v) sensory nerve stimulation of the middle finger, vi) simultaneous senory nerve stimulation of the index and middle finger, vii) sensory nerve stimulation to the first toe, viii) sensory nerve stimulation to the second toe, ix) simultaneous senory nerve stimulation to the first and second toe. For each participant, there is i) the simultaneous EEG-ESG-ENG-EMG-recording which also includes electrocardiographic and respiratory signals, ii) ESG electrode positions. For a detailed description please see the following article: XXX. This study was pre-registered on OSF: https://osf.io/mjdha.\n\nCiting this dataset\n--------\nShould you make use of this data set in any publication, please cite the following article: XXXX\n\nLicense\n-------\nThis data set is made available under the Creative Commons CC0 license. For more information, see https://creativecommons.org/share-your-work/public-domain/cc0/\n\nData set\n-------\nThis data set is organized according to the Brain Imaging Data Structure specification. For more information on this data specification, see https://bids-specification.readthedocs.io/en/stable/\nEach participant's data are in one subdirectory (e.g., 'sub-001'), which contains the raw data in eeglab format.\nPlease note that the EEG channel Fz was referenced to i) the EEG reference (right mastoid, RM, channel name: Fz) and ii) the ESG reference (6th thoracic vertebra, TH6, channel name: Fz-TH6).\nShould you have any questions about this data set, please contact nierula@cbs.mpg.de or eippert@cbs.mpg.de.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004389",
    "exists": true,
    "description": "OpenNeuro dataset - Somatosensory evoked potentials in the human spinal cord to mixed and sensory nerve stimulation",
    "created_at": "2024-08-15T09:24:00+00:00",
    "updated_at": "2024-08-15T12:13:26+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}