{
  "dataset_id": "ds003816",
  "date_retrieved": "2025-07-31T00:16:42.979716+00:00",
  "dataset_description": {
    "Authors": [
      "SUN, Rui",
      "Ven WONG, Goon Fui",
      "GAO, Jungling"
    ],
    "BIDSVersion": "1.6",
    "DatasetType": "raw",
    "Funding": [
      "Faculty Research Fund of Faculty of Education in HKU"
    ],
    "Name": "The Effect of Buddhism Derived Loving Kindness Meditation on Modulating EEG: Long-term and Short-term Effect",
    "License": "CC0",
    "EthicsApprovals": [
      "The University of Hong Kong Human Research Ethics Committee approved the project, Reference Number: EA210145."
    ],
    "DatasetDOI": "10.18112/openneuro.ds003816.v1.0.1"
  },
  "readme_content": "This dataset contains Pre-rest ; Post-rest; Radiating LKM to Self; Radiating LKM to Other; Visualize Self and Visualize Other (eyes closed) states EEG and ECG recordings with 48 participants. Among of 48 participants, 15 participants were interested to participate as long-term practitioner. They were able to participate EEG and ECG data recording more than 10 times within two-month. For the rest of the participants recorded only once respectively.\n\nHigh-density EEG and one channel ECG were collected simultaneously by a bio-signal amplifier (actiCHamp, Brain Products, German) from the 48 participants during the whole LKM training session with a sampling frequency of 1000 Hz. 128 EEG electrodes were fixed on the participant’s scalp according to the International 10-20 System. One ECG electrode was fixed on V3 lead. All Electrodes’ impedance was kept under 20kohm to maintain a good signal- to-noise ratio.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003816",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds003816",
    "created_at": "2021-10-22T05:17:18+00:00",
    "updated_at": "2024-06-14T20:55:54+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}