{
  "dataset_id": "ds004505",
  "date_retrieved": "2025-07-31T00:20:56.700367+00:00",
  "dataset_description": {
    "Authors": [
      "Amanda Studnicki",
      "Daniel P. Ferris"
    ],
    "Name": "Real World Table Tennis",
    "License": "CC0",
    "ReferencesAndLinks": [
      "https://doi.org/10.3390/s22155867"
    ],
    "BIDSVersion": "1.1.1",
    "Funding": [
      "National Science Foundation Division of Behavioral and Cognitive Sciences (BCS-1835317)"
    ],
    "EthicsApprovals": [
      "University of Florida Institutional Review Board (IRB201801727)"
    ],
    "Acknowledgements": "Thank-you to the Human Neuromechanics Lab and to all the undergraduate research assistants who helped with data collections: Christina Collings, Corey Orlando, Sebastian Huerta, and Juan De La Espriella.",
    "DatasetDOI": "doi:10.18112/openneuro.ds004505.v1.0.4"
  },
  "readme_content": "Our dataset contains high-density, dual-layer electroencephalography (EEG), neck electromyography (EMG), inertial measurement unit (IMU) acceleration, T1 structural MR images, and video data from 25 participants playing real-world table tennis. Participants played 60 minutes of table tennis (in total) with a ball machine and a human player, with an additional 10 minutes of standing baseline. For 17 of the participants, we also include video data of all trials. The Adobe Premiere project files (linked to each video) have the timing of hit events marked.\r\n\r\nData in the main subject folders have been processed. We include the ICA decomposition and dipole model in EEG.etc. The components retained in our analyses are shown in EEG.etc.KeepComponents. The raw data can be found in the sourcedata folder.    \r\n\r\nPlease refer to our publication for more details. ",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004505",
    "exists": true,
    "description": "OpenNeuro dataset - Real World Table Tennis",
    "created_at": "2023-03-30T17:04:16+00:00",
    "updated_at": "2023-03-30T17:20:18+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}