{
  "dataset_id": "ds004696",
  "date_retrieved": "2025-07-31T00:17:46.968372+00:00",
  "dataset_description": {
    "Name": "HAPwave_bids",
    "BIDSVersion": "1.12.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Ojeda Valencia, G.",
      "Gregg, N.",
      "Huang, H.",
      "Lundstrom, B.",
      "Brinkmann, B.",
      "Pal Attia1, T.",
      " Van Gompel, J.",
      "Bernstein,M.",
      "In, M.",
      "Huston, J.",
      "Worrell1, G.",
      "Miller, K.",
      "Hermes, D."
    ],
    "HowToAcknowledge": "Please cite this paper: Ojeda Valencia G, Gregg N, Huang H, Lundstrom B, Brinkmann B, Pal Attia T, Van Gompel J, Bernstein M, In MH, Huston J, Worrell G, Miller KJ, and Hermes D. 2023. Signatures of electrical stimulation driven network interactions in the human limbic system. Journal of Neuroscience (in press).",
    "Acknowledgements": "Special thanks to the Mayo Clinic, particularly to the Multimodal Neuroimaging Laboratory (MNL), the Bioelectronics Neurophysiology and Engineering Laboratory (BNEL), the DERIVE Office and the Mayo Clinic Center for Biomedical Discovery",
    "Funding": [
      "NIH RO1MH122258",
      "The DERIVE Office and the Mayo Clinic Center for Biomedical Discovery"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004696.v1.0.1"
  },
  "readme_content": "# Information\nThis dataset contains intracranial EEG (iEEG) recordings from 8 patients during single pulse electrical stimulation used in the publication of:\nOjeda Valencia G, Gregg N, Huang H, Lundstrom B, Brinkmann B, Pal Attia T, Van Gompel J, Bernstein M, In MH, Huston J, Worrell G, Miller KJ, and Hermes D. 2023. Signatures of electrical stimulation driven network interactions in the human limbic system. Journal of Neuroscience (in press).\n\n# License\nThis dataset is made available under the Public Domain Dedication and License CC v1.0, whose full text can be found at \nhttps://creativecommons.org/publicdomain/zero/1.0/. \nWe hope that all users will follow the ODC Attribution/Share-Alike Community Norms (http://www.opendatacommons.org/norms/odc-by-sa/); \nin particular, while not legally required, we hope that all users of the data will acknowledge by citing the following in any publication:\n\nOjeda Valencia G, Gregg N, Huang H, Lundstrom B, Brinkmann B, Pal Attia T, Van Gompel J, Bernstein M, In MH, Huston J, Worrell G, Miller KJ, and Hermes D. 2023. Signatures of electrical stimulation driven network interactions in the human limbic system. Journal of Neuroscience. DOI: https://doi.org/10.1523/JNEUROSCI.2201-22.2023 \n\n# Task Description\nPatients were resting in the hospital bed, while single pulse stimulation was performed. The stimulation had a duration of 200 microseconds, was biphasic and had an amplitude of 6mA. For subject 7 stimulation amplitude was sometimes reduced to 4mA to minimize interictal responses.\n\n# Code\nCode to analyses these data is available at: https://github.com/MultimodalNeuroimagingLab/HAPwave\n\n# Dataset\nThis data is organized according to the Brain Imaging Data Structure specification (BIDS version 1.12.0). A community- driven specification for organizing neurophysiology data along with its metadata. For more information on this data specification, see https://bids-specification.readthedocs.io/en/stable/\nEach subject has their own folder (e.g., ‘sub-01’) containing intracranial EEG (iEEG) recordings from 8 patients during single pulse electrical stimulation, as well as the metadata needed to understand the raw data and event timing.\n\n# Acknowledgements\nThis project was funded by the National Institute Of Mental Health of the National Institutes of Health Brain Initiative under Award Number R01 MH122258, “CRCNS: Processing speed in the human connectome across the lifespan\". The overall goal of this project is to develop a large database of single pulse stimulation data and develop tools to advance our understanding of the human connectome across the lifespan. The data was collected by Dora Hermes, Nick Gregg, Brian Lundstrom, Cindy Nelson, Gabriela Ojeda Valencia, Gregg Worrell and Kai J. Miller. The BIDS formatting was performed by Dora Hermes and Gabriela Ojeda Valencia.\n\n# Contact\nPlease contact Dora Hermes (hermes.dora@mayo.edu) or Gabriela Ojeda Valencia (OjedaValencia.Alma@mayo.edu) for questions.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004696",
    "exists": true,
    "description": "OpenNeuro dataset - HAPwave_bids",
    "created_at": "2023-08-16T13:32:27+00:00",
    "updated_at": "2023-08-16T14:09:16+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}