{
  "dataset_id": "ds004587",
  "date_retrieved": "2025-07-31T00:26:32.877345+00:00",
  "dataset_description": {
    "Name": "IllusionGameEEG_data",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Makowski, Dominique",
      "Te, An-Shu",
      "Jiayi, Zhang",
      "Kirk, Stephanie",
      "Ngoi, Zi Liang"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004587.v1.0.0",
    "License": "CC0"
  },
  "readme_content": "# Overview\r\n\r\nThis dataset was collected in 2022-20233 and comprises electroencephalography, physiological and behavioural data acquired from 103 healthy individuals (ages: 21-45). The task was administered as part of a larger study.\r\n\r\n# Task Description\r\n## Illusion Game (IG)\r\nThe aim of this task is to investigate people's sensitivity to visual illusions as a general, common factor. Using Pyllusion, which enabled us to manipulate the objective parameters of visual illusions, we generated stimuli of varying task difficulty and illusion strength for 3 different classic illusions (Ebbinghaus, Müller-Lyer and Vertical-Horizontal). We then created an experimental task in which participants were instructed to make perceptual judgements about targets in the illusion as quickly as possible, ignoring its context, which biases their perception of the illusion. For instance, in the Müller-Lyer illusion, the same-length line segments (*targets*) appear to have different lengths if they end with inwards vs. outwards pointing arrows (*context*). The first series of the 3 illusion blocks (each comprising 64 trials) were first presented to participants in a randomized order, followed by a short break, after which participants performed the second series of blocks displayed in a newly randomized order. In total, each participant performed 384 illusion trials (6*64).\r\n\r\n## Resting State\r\nBefore the start of the illusion task, paricipants were instructed to keep their eyes closed for 8 minutes. At the end of the resting period, a 'beep' soundclip was played to cue participants to open their eyes. An adapted version of the Amsterdam Resting State Questionnaire (Diaz et al., 2014) was then administered to examine participants' subjective resting state experience.\r\n\r\n\r\n## NOTES\r\nDue to a technical error, sub-FFE111 and sub-FFE116 do not have any physiological data, and sub-FFE117, sub-FFE139 and sub-FFE146 do not have behavioural data for the illusion game task. \r\n\r\nEEG data collection was split into 6 runs corresponding to each block of illusion trials for sub-FFE111 and sub-FFE121 during pilot testing. \r\n\r\nEEG data collection was collected twice for sub-FFE007 due to a technical glitch that occcured in the middle of illusion task trials.\r\n\r\n# Data acquisition\r\n## EEG data acquisition\r\n\r\nEEG signals were recorded using the EasyCap 64-channel and BrainVision Recording system. Electrodes were placed on the EEG cap according to the standard 10-5 system of electrode placement (Oostenveld & Praamsrta, 2001) and impedance was kept below 12 kOhm for each subject. The ground electrode was placed on the forehead the Cz was used as the reference channel. During recording, the sampling rate was 10000Hz. Note that channels Tp9 and Tp10 were placed near the outer canthi of each eye, and POz as well as Oz were fixed above and below one of the eyes to measure the E0G.\r\n\r\n\r\n## Physiological data acquisition\r\n\r\nParticipants' physiological signals, that is their electrocardiogram (*ECG*), photoplethysmograph (PPG) and respiration signals (*RSP*), were obtained at a sampling frequency of 1000Hz. All physiological signals were recorded via the PLUX OpenSignals software and BITalino Toolkit. \r\n\r\nECG was collected using three ECG electrodes placed according to a modified Lead II configuration, and RSP was acquired using a respiration belt tightened over participants' upper abdomen. PPG sensors, which record changes in blood volume, were clipped on the tip of the index finger of participants' non-dominant hand to meaure heart rate and oxygen saturation.\r\n\r\n\r\nReferences\r\n----------\r\nDiaz, B. A., Van Der Sluis, S., Benjamins, J. S., Stoffers, D., Hardstone, R., Mansvelder, H. D., ... & Linkenkaer-Hansen, K. (2014). The ARSQ 2.0 reveals age and personality effects on mind-wandering experiences. Frontiers in psychology, 5, 271.\r\n\r\n\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004587",
    "exists": true,
    "description": "OpenNeuro dataset - IllusionGameEEG_data",
    "created_at": "2024-06-28T11:20:45+00:00",
    "updated_at": "2024-06-28T13:03:23+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}