{
  "dataset_id": "ds004563",
  "date_retrieved": "2025-07-31T00:24:02.820411+00:00",
  "dataset_description": {
    "Name": "Vicarious touch: overlapping neural patterns between seeing and feeling touch",
    "BIDSVersion": "v1.8.0",
    "License": "CC0",
    "Authors": [
      "Sophie Smit",
      "Denise Moerel",
      "Regine Zopf",
      "Anina N Rich"
    ],
    "HowToAcknowledge": "Smit, S., Moerel, D., Zopf, R., & Rich, A. N. (2023). Vicarious touch: overlapping neural patterns between seeing and feeling touch. bioRxiv (2023). https://doi.org/10.1101/2022.06.21.497107",
    "DatasetDOI": "doi:10.18112/openneuro.ds004563.v1.0.1"
  },
  "readme_content": "Data collection took place at Macquarie University in Sydney Australia. The study was approved by the Macquarie University Ethics Committee.\n\nWe used time-resolved multivariate pattern analysis on whole-brain EEG data from people with and without vicarious touch experiences to test whether seen touch evokes overlapping neural representations with the first-hand experience of touch. Participants felt touch to the fingers (tactile trials) or watched carefully matched videos of touch to another person’s fingers (visual trials). \n\nThere were 12 runs in total, divided into four blocks of 36 trials (with alternating sets of nine tactile and nine visual trials) resulting in a total of 1728 trials (864 tactile and 864 visual). There were an additional 240 target trials (20 per run), which were excluded from analysis.\n\nBetween trials there was an inter-trial-interval of 800ms. Each run lasted approximately 7-8 minutes with short breaks between blocks and runs.\n\nWhole brain 64-channel EEG data were recorded using an Active Two Biosemi system (Biosemi, Inc.) at 2048Hz and 10-20 standard caps. Stimuli were presented using MATLAB (MathWorks) and Psychtoolbox (Brainard and Vision). The experiment presentation script, all analysis code, and stimuli are made available (see code and stimuli folder). The data is made available both in raw form (see each participant's file) and after processing (see derivatives).",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004563",
    "exists": true,
    "description": "OpenNeuro dataset",
    "created_at": "2023-07-05T00:22:04+00:00",
    "updated_at": "2023-07-05T00:22:04+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}