{
  "dataset_id": "ds004517",
  "date_retrieved": "2025-07-31T00:22:03.715554+00:00",
  "dataset_description": {
    "Name": "EEG recordings for semantic decoding of imagined animals and tools during auditory imagery task",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "Authors": [
      "Milan Rybář",
      "Riccardo Poli",
      "Ian Daly"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004517.v1.0.2",
    "License": "CC0"
  },
  "readme_content": "﻿### Description\nThis dataset contains electroencephalography (EEG) signals recorded from 7 participants while performing an auditory imagery task. Participants were asked to imagine the sounds made by an object for 5 seconds.\n\n\n### EEG\nEEG data were acquired with a BioSemi ActiveTwo system with 64 electrodes positioned according to the international 10-20 system, plus one electrode on each earlobe as references ('EXG1' channel is the left ear electrode and 'EXG2' channel is the right ear electrode).\nElectrooculography (EOG) was also recorded to monitor eye movements. Two electrodes were placed above ('EXG7' channel) and below ('EXG8') the right eye to capture the vertical oculogram, while two more electrodes were placed near the canthus of each eye ('EXG5' by the left eye and 'EXG6' by the right eye) to record the horizontal oculogram.\nAdditionally, two electrodes were placed on the left ('EXG3') and right ('EXG4') wrists for additional physiological measurements (e.g., heart rate variability), and respiration was recorded using a belt placed around the waist ('Resp' channel).\nThe sampling rate was 2048 Hz.\n\n\n### Stimulus\nFolder 'stimuli' contains all images of the semantic categories of animals and tools presented to participants.\n\n\n### Example code\nWe have prepared an example script to demonstrate how to load the EEG data into Python using MNE and MNE-BIDS packages. This script is located in the 'code' directory.\n\n\n### References\nThis dataset was analyzed in the following publications:\n\n[1] Rybář, M., Poli, R. and Daly, I., 2024. Using data from cue presentations results in grossly overestimating semantic BCI performance. Scientific Reports, 14(1), p.28003.\n\n[2] Rybář, M., 2023. Towards EEG/fNIRS-based semantic brain-computer interfacing (Doctoral dissertation, University of Essex).\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004517",
    "exists": true,
    "description": "OpenNeuro dataset - EEG recordings for semantic decoding of imagined animals and tools during auditory imagery task",
    "created_at": "2025-02-28T21:40:11+00:00",
    "updated_at": "2025-04-03T23:41:57+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}