{
  "dataset_id": "ds005345",
  "date_retrieved": "2025-07-31T00:22:50.262553+00:00",
  "dataset_description": {
    "Name": "Le Petit Prince (LPP) Multi-talker: Naturalistic 7T fMRI and EEG Dataset",
    "BIDSVersion": "1.8.0",
    "License": "CC0",
    "Authors": [
      "Zhengwu Ma",
      "Nan Wang",
      "Jixing Li"
    ],
    "EthicsApprovals": [
      "The experimental procedures have been approved by the Ethics Committee of City University of Hong Kong and the Ninth People’s Hospital affiliated with Shanghai Jiao Tong University School of Medicine (EEG: SH9H-2019-T33-2; fMRI: SH9H-2022-T379-2)."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005345.v1.0.1"
  },
  "readme_content": "## Participants\n\nThis dataset includes 25 native Mandarin Chinese speakers (14 females, mean age = 24.04 ± 2.28 years) who participated in both EEG and fMRI experiments. The participants were all right-handed, with no reported history of neurological disorders. They were enrolled in undergraduate or graduate programs in Shanghai. All participants gave informed consent, and the experiments were approved by the Ethics Committee of the Ninth People's Hospital, affiliated with Shanghai Jiao Tong University School of Medicine (SH9H-2019-T33-2 and SH9H-2022-T379-2).\n\nIn the case of French participants, due to legal constraints, additional session considerations were taken into account, such as shorter session durations.\n\n## Experiment Procedure\n\nMRI Scanning Sessions\n\nParticipants underwent both EEG and fMRI experiments while listening to the Chinese version of *Le Petit Prince*. During the MRI session, participants were instructed to maintain fixation on a crosshair on the screen and minimize eye movements and head motions. The task involved attending to different talkers in the multitalker condition (single male, single female, mixed male, and mixed female talkers).\n\nSession Breakdown\n\n- The entire session lasted approximately 70 minutes for fMRI participants, including a series of 4 conditions (single-talker, mixed-attended, and mixed-unattended conditions).\n- Quiz questions were administered after each run to assess participants' comprehension of the narrative.\n\nIn the French cohort, due to legal time constraints, the experiment durations were adjusted.\n\n## Stimuli\n\nThe stimuli were selected excerpts from the Chinese version of *Le Petit Prince* (available at [xiaowangzi.org](http://www.xiaowangzi.org/)). These audio clips were previously used in both EEG (Li et al., 2024) and fMRI (Li et al., 2022) studies.\n\nThe English and Chinese versions were enhanced with visual stimuli (e.g., images of scenes from the book) to align with the storyline. However, visual stimuli were not presented in the French version to comply with legal restrictions. \n\n## Acquisition\n\nMRI Hardware & Scanning Parameters\n\n- EEG: Data were collected using a 64-channel actiCAP system, sampled at 500 Hz, and filtered between 0.016 and 80 Hz.\n- fMRI: Scanning was performed on a 7.0 T Terra Siemens MRI scanner at the Zhangjiang International Brain Imaging Centre. The scanning parameters differed slightly between the English/Chinese and French studies due to equipment availability.\n\n  - Functional MRI: 85 interleaved axial slices (1.6×1.6×1.6 mm voxel size, TR = 1000 ms, TE = 22.2 ms)\n  - Anatomical MRI: MP-RAGE sequence, T1-weighted images (voxel size = 0.7×0.7×0.7 mm).\n\n## Preprocessing\n\nMRI Data Processing\n\n1. DICOM to NIfTI Conversion: All raw MRI data were converted to NIfTI format using `dcm2niix` (version 1.0.20220505) and processed using the `fMRIPrep` pipeline (version 20.2.0).\n2. Anatomical Preprocessing:\n   - Skull stripping\n   - Segmentation into gray matter (GM), white matter (WM), and cerebrospinal fluid (CSF)\n   - Registration to the Montreal Neurological Institute (MNI) space using MNI152NLin2009cAsym:res-2 template.\n3. Functional Preprocessing:\n   - Motion correction\n   - Slice-timing correction\n   - Multi-echo ICA for denoising\n   - Voxel resampling to native and MNI spaces.\n\nNote: Visual stimuli processing for the English and Chinese conditions was handled separately to avoid potential biases in the analysis.\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005345",
    "exists": true,
    "description": "OpenNeuro dataset - Le Petit Prince (LPP) Multi-talker: Naturalistic 7T fMRI and EEG Dataset",
    "created_at": "2025-01-17T10:14:00+00:00",
    "updated_at": "2025-04-17T07:55:08+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}