{
  "dataset_id": "ds004771",
  "date_retrieved": "2025-07-31T00:16:04.676420+00:00",
  "dataset_description": {
    "Name": "EEG/ERP data from a Python Reading Task",
    "License": "CC0",
    "Authors": [
      "Chu-Hsuan Kuo",
      "Chantel S. Prat"
    ],
    "ReferencesAndLinks": [
      "See manuscript"
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "Acknowledgements": "Thank you to Mark Pettet for assistance with data analysis and the conversion of data to BIDS format.",
    "Funding": [
      "Office of Naval Research, Cognitive Science of Learning program (N00014-20-1-2393)"
    ],
    "EthicsApprovals": [
      "All experimental procedures were approved by the University of Washington Institutional Review Board"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004771.v1.0.0"
  },
  "readme_content": "EEG data for the Python reading task (acceptability judgments) described in [Kuo, C-H. and Prat, C.S. Programmers show distinct, language-like brain responses to violations in form and meaning when reading code], pending submission to Nature Communications.\n\nThis study recruited 62 total subjects. 1 subject did not complete the EEG session and was removed from all analyses and is not included in this dataset. The remaining 61 individuals' EEG data are included. The participants info file contains information regarding which individuals were included in the final analyses (per artifact rejection criteria detailed in the article).\n\nThe stimuli for this study was administered in Presentation; as such, the files are in the formats compatible with this program.\n\nThe provided code was used for processing the EEG data. All statistics were run in Jamovi, an R-based open source software; feel free to reach out for the original files if you are interested.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004771",
    "exists": true,
    "description": "OpenNeuro dataset - EEG/ERP data from a Python Reading Task",
    "created_at": "2023-09-25T03:49:00+00:00",
    "updated_at": "2024-09-20T08:42:16+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}