{
  "dataset_id": "ds004883",
  "date_retrieved": "2025-07-31T00:11:57.787417+00:00",
  "dataset_description": {
    "Name": "Registerd Report of ERN During Three Versions of a Flanker Task",
    "ReferencesAndLinks": [
      "https://osf.io/qt2zh/",
      "https://osf.io/preprints/psyarxiv/a3s42"
    ],
    "BIDSVersion": "v1.8.0",
    "License": "CC0",
    "Authors": [
      "Peter E. Clayson",
      "Michael J. Larson"
    ],
    "HEDVersion": "8.1.0",
    "Acknowledgements": "Please cite this repository and the associated preprint.",
    "DatasetDOI": "doi:10.18112/openneuro.ds004883.v1.0.0"
  },
  "readme_content": "This study is described at https://osf.io/qt2zh/. Scripts used for data processing are posted there.\n\nHere is the script from the manuscript that describes these data.\n\nError-related negativity is a widely used measure of error monitoring, and many projects are independently moving ERN recorded during a flanker task towards standardization, optimization, and eventual clinical application. However, each project uses a different version of the flanker task and tacitly assumes ERN is functionally equivalent across each version. The routine neglect of a rigorous test of this assumption undermines efforts to integrate ERN findings across tasks, optimize and standardize ERN assessment, and widely apply ERN in clinical trials. The purpose of this registered report was to determine whether ERN shows similar experimental effects (correct vs. error trials) and data quality (intraindividual variability) during three commonly-used versions of a flanker task. ERN was recorded from 172 participants during three versions of a flanker task across two study sites. ERN scores showed numerical differences between tasks, raising questions about the comparability of ERN findings across studies and tasks. Although ERN scores from all three versions of the flanker task yielded high data quality and internal consistency, one version did outperform the other two in terms of the size of experimental effects and the data quality. Exploratory analyses of the error positivity (Pe) provided tentative support for the other two versions of the task over the paradigm that appeared optimal for ERN. The present study provides a roadmap for how to statistically compare psychometric characteristics of ERP scores across paradigms and gives preliminary recommendations for flanker tasks to use for ERN- and Pe-focused studies. ",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004883",
    "exists": true,
    "description": "OpenNeuro dataset - Registerd Report of ERN During Three Versions of a Flanker Task",
    "created_at": "2023-12-21T12:36:19+00:00",
    "updated_at": "2023-12-21T13:43:40+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}