{
  "dataset_id": "ds005048",
  "date_retrieved": "2025-07-31T00:11:06.721030+00:00",
  "dataset_description": {
    "Authors": [
      "Mojtaba Lahijanian",
      "Hamid Aghajan",
      "Zahra Vahabi"
    ],
    "Name": "40Hz Auditory Entrainment",
    "License": "CC0",
    "ReferencesAndLinks": [
      "https://doi.org/10.1038/s41598-024-63727-z",
      "https://doi.org/10.1101/2021.09.30.462389"
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "GeneratedBy": [
      {
        "Name": "bids-matlab-tools",
        "Version": "8.0"
      }
    ],
    "Acknowledgements": "The authors wish to thank Ziaeian Hospital in Tehran for providing staff time and equipment for data collection in this study. We are grateful to the patients and their families who participated in this study.",
    "Funding": [
      "This work was partially funded by the Cognitive Sciences & Technologies Council of Iran and by the grant G970736 from Sharif University of Technology, which covered the cost of data collection. The funders had no role in the study conceptualization and design, data collection and analysis, decision to publish, or preparation of the manuscript."
    ],
    "EthicsApprovals": [
      "This study was approved by the Review Board of Tehran University of Medical Sciences (Approval ID: IR.TUMS.MEDICINE.REC.1398.524) and all participants provided informed consent before participating and were free to withdraw at any time."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds005048.v1.0.1",
    "HowToAcknowledge": "Please cite the following article as well as dataset DOI:\nLahijanian, M., Aghajan, H. & Vahabi, Z. Auditory gamma-band entrainment enhances default mode network connectivity in dementia patients. Sci Rep 14, 13153 (2024). https://doi.org/10.1038/s41598-024-63727-z"
  },
  "readme_content": "Introduction                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         \nThis experiment was designed to entrain the brain oscillations through synthetic auditory stimulation conducted on a group of elderly suffering from dementia. Recently, gamma entrainment has been proposed and shown effective in improving several symptoms of Alzheimer's Diseases (AD). The aim of this study is to investigate the effect of entrainment on brain oscillations using EEG signal recording during the auditory brain stimulation. This study was approved by the Review Board of Tehran University of Medical Sciences (Approval ID: IR.TUMS.MEDICINE.REC.1398.524). All methods were performed in accordance with the relevant guidelines and regulations, and all participants provided informed consent before participating and were free to withdraw at any time. To accommodate participants who preferred a shorter duration of data gathering, we designed both short and long sessions for entrainment. This approach aimed to minimize inconvenience for the participants who were less inclined to engage in lengthy procedures.                                                                                                                                                                                                                                                                                     \nEntrainment session and auditory stimulation                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         \nEach session involved the presentation of a multi-trial auditory stimulus while simultaneously recording EEG data from the participant. To deliver the auditory stimulus, two speakers were placed in front of the participant 50cm apart from each other and directly pointed at the participant’s ears at a distance of 50cm. The sound intensity was around -40dB within a fixed range for all participants. To ascertain adequate hearing ability of the participants and to ensure individual comfort, each participant was asked before commencing the task if the sound was at a comfortable level, and adjustments were made to the volume. The auditory stimulus was a 5kHz carrier tone amplitude modulated with a 40Hz rectangular wave (40Hz On and Off cycles). Since a 40Hz tone cannot be easily heard, the 5KHz carrier frequency was used to render the 40Hz pulse train audible. In order to minimize the effect of the carrier sound, the duty cycle of the modulating 40Hz waveform was set to 4% (1ms of the 25ms cycle was On). The auditory stimulant was generated in MATLAB and played as a .wav file. This file consisted of multiple trials, with each trial lasting 40sec and interleaved by 20sec of rest (silence). The short session included six trials, while the long session comprised ten trials of the stimulus.\nEEG recording and preprocessing                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      \nAll EEG data were recorded using 19 monopolar channels based on the standard 10/20 system. For the short session, the reference electrodes were placed on the earlobes, while for the long session, referencing was done to the FCz channel. Notably, referencing to the average was implemented during preprocessing, ensuring data integrity and minimizing potential interference. The sampling rate was set to 250Hz, and the impedance of the electrodes was kept under 20kΩ. During the experiment, participants were seated comfortably with open eyes in a quiet room, and they were instructed to relax their body to avoid muscle artifacts and to move their head as little as possible.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  \nData from all the participants were preprocessed identically following Makoto's preprocessing pipeline: Highpass filtering above 1Hz; removal of the line noise; rejecting potential bad channels; interpolating rejected channels; re-referencing data to the average; artifact subspace reconstruction (ASR); re-referencing data to the average again; estimating the brain source activity using independent component analysis (ICA); dipole fitting; rejecting bad dipoles (sources) for further cleaning the data. These preprocessing steps were performed using EEGLab toolbox in MATLAB.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               \u0000",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005048",
    "exists": true,
    "description": "OpenNeuro dataset - 40Hz Auditory Entrainment",
    "created_at": "2024-03-25T18:16:28+00:00",
    "updated_at": "2025-04-10T15:22:37+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}