{
  "dataset_id": "ds003004",
  "date_retrieved": "2025-07-31T00:21:51.263991+00:00",
  "dataset_description": {
    "ReferencesAndLinks": [
      "Onton J.A. and Makeig S. (2009). High-frequency broadband modulations of electroencephalographic spectra. Front. Hum. Neurosci. 3,:61. DOI: https://doi.org/10.3389/neuro.09.061.2009",
      "Onton J.A. and Makeig S. (2009). Independent modulators of regional EEG alpha sub-band power during a working memory task. Poster session presented to Cognitive Neuroscience Society; San Francisco, CA. https://sccn.ucsd.edu/~julie/AlphaIMposter.pdf",
      "Kothe C.A., Makeig S., and Onton J.A. (2013). Emotion Recognition from EEG during Self-Paced Emotional Imagery. 2013 Humaine Association Conference on Affective Computing and Intelligent Interaction. IEEE. 855-858, DOI: https://doi.org/10.1109/ACII.2013.160",
      "Hsu S.H., Lin Y., Onton J.A., Jung T.P., and Makeig S. (2022). Unsupervised learning of brain state dynamics during emotion imagination using high-density EEG. NeuroImage. 249:118873. DOI: https://doi.org/10.1016/j.neuroimage.2022.118873"
    ],
    "Authors": [
      "Julie Onton",
      "Scott Makeig"
    ],
    "Name": "Imagined Emotion Study",
    "License": "CC0",
    "BIDSVersion": "1.1.1",
    "DatasetDOI": "doi:10.18112/openneuro.ds003004.v1.1.1"
  },
  "readme_content": "**PARADIGM:** The study uses the method of guided imagery to induce resting, eyes-closed participants using voice-guided imagination to enter distinct 15 emotion states during acquisition of high-density EEG data. \r\n\r\nDuring the study, participants listen to 15 voice recordings that each suggest imagining a scenario in which they have experienced -- or would experience the named target emotion. Some target emotions have positive valence (e.g., joy, happiness), others negative valence (e.g., sadness, anger). Before and between the 15 emotion imagination periods, participants hear relaxation suggestions ('Now return to a neutral state by ...').\r\n\r\n**PROCEDURE:** When the participant first begins to feel the target emotion, they are asked to indicate this by pressing a handheld button. Participants are asked to continue feeling the emotion as long as possible.  To intensify and lengthen the periods of experienced emotion, participants are asked to interoceptively perceive and attend relevant somatosensory sensations. When the target feeling wanes (typically after 1 and 5 minutes), participants push the button again to leave the emotion imagination period and cue the relaxation instructions.\r\n\r\n**DATA HANDLING:** The raw data have been preprocessed to fix confusing event codes and to remove excessively noisy channels. In addition, a 1-Hz high pass filter  was applied to ready the data for ICA decomposition. Note: Unfortunately, the unfiltered data are no longer available.\r\n\r\n**NOTE:** Sub22 was a repeat subject, hence was removed from the dataset. ",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003004",
    "exists": true,
    "description": null,
    "created_at": "2020-07-10T00:31:09+00:00",
    "updated_at": "2023-08-16T17:41:54+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}