{
  "dataset_id": "ds003947",
  "date_retrieved": "2025-07-31T00:24:36.436621+00:00",
  "dataset_description": {
    "Name": "EEG: First Episode Psychosis vs. Control Resting Task 2",
    "ReferencesAndLinks": [
      "Phalen, H., Coffman, B.A., Ghuman, A., Sejdić, E. and Salisbury, D.F., 2020. Non-negative matrix factorization reveals resting-state cortical alpha network abnormalities in the first-episode schizophrenia spectrum. Biological Psychiatry: Cognitive Neuroscience and Neuroimaging, 5(10), pp.961-970., https://pubmed.ncbi.nlm.nih.gov/31451387/"
    ],
    "BIDSVersion": "v1.6.0",
    "License": "CC0",
    "Authors": [
      "Dean Salisbury",
      "Dylan Seebold",
      "Brian Coffman"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds003947.v1.0.1"
  },
  "readme_content": "Resting EEG and MEG data was gathered for two independently collected samples of healthy and First Episode Psychosis (FEP) individuals.\r\nTo obtain resting data, EEG channels were recorded for 5 minutes using an Elekta Neuromag Vectorview system.\r\nEEG was recorded using a low-impedance 10-10 system 60-channel cap. \r\nThe second collected sample of EEG data is provided here. This sample excludes a portion of subjects that have been included with the first acquisition (EEG: First Episode Psychosis vs. Control Resting Task 1), since they were collected using the same montage.\r\nThe subjects that have been excluded here and are included in Task 1 are: sub-2140A, sub-2170A, sub-2174A, sub-2176A, sub-2177A, sub-2184A, sub-2193A, sub-2214A, sub-2217A, sub-2221A.\r\n\r\nThe phenotype directory contains clinical assessment results and data divided by type for all subjects. The assessment results were categorized as follows:\r\nBPRS - Brief Psychiatric Rating Scale,\r\nSANS - Scale for Assessment of Negative Symptoms,\r\nSAPS - Scale for Assessment of Positive Symptoms,\r\nGAFGAS - Global Assessment of Functioning,\r\nSFS - Social Functioning Scale,\r\nMATRICS - MATRICS Consensus Cognitive Battery,\r\nWASI - Wechsler Abbreviated Scale of Intelligence, \r\nHollingshead - Hollingshead Four-Factor Index of Socioeconomic Status,\r\nMedications - Chlorpromazine equivalency of prescribed medication at time of EEG scan.\r\nValues/scores that were not collected and questions without given responses are denoted by n/a.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003947",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds003947",
    "created_at": "2022-01-24T19:04:45+00:00",
    "updated_at": "2025-04-07T17:05:00+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}