{
  "dataset_id": "ds003574",
  "date_retrieved": "2025-07-31T00:26:48.804914+00:00",
  "dataset_description": {
    "Acknowledgements": "This research was supported by the National Center of Competence in Research (NCCR) Affective Sciences financed by the Swiss National Science Foundation (grant number: 51NF40-104897) and hosted by the University of Geneva, and the Swiss National Science Foundation (grant numbers: 320030-159862 and 320030-135653), and the Mercier Foundation. Hee-Deok Yang work was supported by the National Research Foundation of Korea (NRF) grant funded by the Korea government (MSIT) (No. NRF-2017R1A2B4005305) We also thank Ben Meuleman for statistical advice.",
    "Authors": [
      "Virginie Sterpenich",
      "Mojca KM van Schie",
      "Maximilien Catsiyannis",
      "Avinash Ramyead",
      "Stephen Perrig",
      "Hee-Deok Yang",
      "Dimitri Van De Ville",
      "Sophie Schwartz"
    ],
    "BIDSVersion": "1.4.1",
    "DatasetDOI": "10.18112/openneuro.ds003574.v1.0.2",
    "Funding": [
      "Swiss National Science Foundation (51NF40-104897 - 320030-159862 - 320030-135653)",
      "Mercier Foundation",
      "National Research Foundation of Korea (NRF - 2017R1A2B4005305)"
    ],
    "HowToAcknowledge": "Please cite the paper",
    "License": "CC0",
    "Name": "Reward biases spontaneous neural reactivation during sleep",
    "ReferencesAndLinks": [
      "Reward biases spontaneous neural reactivation during sleep, Virginie Sterpenich,Mojca KM van Schie,Maximilien Catsiyannis,Avinash Ramyead,Stephen Perrig,Hee-Deok Yang,Dimitri Van De Ville,Sophie Schwartz, Nat. Comm., 2021"
    ]
  },
  "readme_content": "The data included 18 participants that played at 2 different games during wakefulness in the 3T MRI: the FACE and the MAZE game, intermixed with periods of REST and period of preparation of each game (game session). The tasks were manipulated and at the end of the game session, one game was won (Reward game) and the second was lost (No Reward game), randomly assigned for each participant. Next, during the sleep session, 64 electrodes were placed on the head of the participants, before they slept in the MRI with EEG for 1-2 hours (sleep session). Participants can be separated according to the won game (face or maze) and according sleep depth (whether they reached N3 sleep in the MRI or only N2 sleep). A decoding classifier was trained on the data from the game session at wake and applied to the MRI data acquired during sleep (sleep session). Finally, a memory test was performed the next day on the 2 tasks (face and maze).\r\nFor any question related to the methods, please see the manuscript or contact Virginie Sterpenich (Virginie.Sterpenich@unige.ch)\r\n\r\nFiles includes are\r\n1) 2 EPI sessions for the tasks\r\n2) 1 EPI session during resting including wake and sleep (sleep session)\r\n3) 1 EEG file corresponding to the sleep session (including wake and sleep in the MRI)\r\n4) 1 T1 anatomical image\r\n\r\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003574",
    "exists": true,
    "description": null,
    "created_at": "2021-03-26T13:43:46+00:00",
    "updated_at": "2021-06-07T09:57:29+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}