{
  "dataset_id": "ds004279",
  "date_retrieved": "2025-07-31T00:13:25.929122+00:00",
  "dataset_description": {
    "Name": "Large Spanish EEG\n",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Carlos Valle Araya",
      "Carolina Mendez-Orellana",
      "Maria Rodriguez-Fernandez"
    ],
    "Acknowledgements": "We thank Andrea Sanchez and Amaro silva for their help during data collection.",
    "Funding": [
      "Doctoral scholarship N 21211883 (2021)383 by Agencia Nacional de Investigacion y Desarrollo (ANID Chile)"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004279.v1.1.2",
    "License": "CC0"
  },
  "readme_content": "EEG: silent and perceive speech on 30 Spanish sentences\nLarge Spanish Speech EEG dataset \n\nAuthors\n<ul>\n  <li>Carlos Valle</li>\n  <li>Carolina Mendez-Orellana</li>\n  <li>María Rodríguez-Fernández</li>\n</ul>\n\n\nResources:\n<ul>\n    <li>Code availaible at: https://github.com/cgvalle/Large_Spanish_EEG</li>\n    <li>Publication: Valle, C., Mendez-Orellana, C., Herff, C., & Rodriguez-Fernandez, M. (2024). Identification of perceived sentences using deep neural networks in EEG. Journal of neural engineering, 21(5), 056044. </li>\n</ul>\n\nAbstract:\nDecoding speech from brain activity can enable communication for individuals with speech disorders. Deep neural networks have shown great potential for speech decoding applications, but the large data sets required for these models are usually not available for neural recordings of speech impaired subjects. Harnessing data from other participants would thus be ideal to create speech neuroprostheses without the need of patient-specific training data.\nIn this study, we recorded 60 sessions from 56 healthy participants using 64 EEG channels and developed a neural network capable of subject-independent classification of perceived sentences. We found that sentence identity can be decoded from subjects without prior training achieving higher accuracy than mixed-subject models.\nThe development of subject-independent models eliminates the need to collect data from a target subject, reducing time and data collection costs during deployment. These results open new avenues for creating speech neuroprostheses when subjects cannot provide training data.  \n\nExperiment Design:\nWe investigated the neural signals recorded using a 64-channel EEG system during speech perception and silent speech production tasks involving 30 daily use sentences in Spanish. The participants were instructed to listen to a spoken sentence from an audio recording and then silently repeat the sentence without any motor action.\n\nThe experimental design, a modified version of a previous study (Dash, et al), comprises four segments: rest, perception, preparation, and silent speech production. The rest segment lasted five seconds, presenting a fixation cross (+) before the stimulus onset.\n\nDuring the perception section, the participants listened to the stimulus. Prior to subject S18, the perception section lasted 4 s, with each sentence being repeated 7 times. From subject S19 onward, the duration of the perception segment was increased to 5 s to match the duration of the silent speech production segment and the number of repetitions per sentence was decreased to 6 in order to maintain the overall length of the experiment. The preparation segment lasted one second and presented a blank screen, serving as a separation marker between the perception and silent speech production tasks. In the silent speech production segment lasting five seconds, subjects were instructed to silently repeat the previously heard stimulus without motor action only once. It is important to note that this study exclusively focuses on the outcomes derived from the speech perception task.\n\nTrials for each block of the 30 stimuli were presented in a randomized order to prevent anticipation and learning biases.\n\nContact: \nPlease contact us at this e-mail address if you have any question: cgvalle@uc.cl\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004279",
    "exists": true,
    "description": "OpenNeuro dataset",
    "created_at": "2023-08-02T22:50:11+00:00",
    "updated_at": "2024-11-29T15:37:28+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}