{
  "dataset_id": "ds004577",
  "date_retrieved": "2025-07-31T00:24:46.373383+00:00",
  "dataset_description": {
    "Name": "Dataset containing resting EEG for a sample of 103 normal infants in the first year of life",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "Authors": [
      "Thalía Harmony (Neurodevelopment Research Unit; Instituto de Neurobiología; Universidad Nacional Autónoma de México)",
      "Gloria Otero-Ojeda (Facultad de Medicina; Universidad Autónoma del Estado de México)",
      "Eduardo Aubert (Centro de Neurociencias de Cuba)",
      "Thalía Fernández (Neurodevelopment Research Unit; Instituto de Neurobiología; Universidad Nacional Autónoma de México)",
      "Lourdes Cubero-Rego (Neurodevelopment Research Unit; Instituto de Neurobiología; Universidad Nacional Autónoma de México)"
    ],
    "Acknowledgements": "The authors acknowledge Teresa Álvarez-Vázquez, Héctor Belmont-Tamayo, and Paulina Álvarez-García for their collaboration",
    "Funding": [
      "Dirección General Del Personal Académico IT200223"
    ],
    "EthicsApprovals": [
      "Ethical permission was obtained from the Ethics Committee of the Instituto de Neurobiología of the Universidad Nacional Autónoma de México which also complied with the Ethical Principles for Medical Research Involving Human Subjects outlined in the Helsinki Declaration."
    ],
    "ReferencesAndLinks": [
      "Otero GA, Harmony T, Pliego-Rivero FB, Ricardo-Garcell J, Bosch-Bayard J, Porcayo-Mercado R, Fernández-Bouzas A, Díaz-Comas L, Galán L, Vieyra-Reyes P, Fernández T. QEEG norms for the first year of life. Early Hum Dev, 87: 691-703, 2011.DOI: 10.1016/j.earlhumdev.2011.05.010",
      "Bosch-Bayard Jorge, Valdés-Sosa Pedro A., Fernandez T., Otero G., Pliego Rivero B., Ricardo-Garcell J., González-Frankenberger B., Galán-García L., Fernandez-Bouzas A., Aubert-Vazquez E., Lage-Castellanos A., Rodríguez-Valdés R., Harmony, T. 3D Statistical Parametric Mapping of quiet sleep EEG in the first year of life. Neuroimage, 59: 3297–3308, 2012. DOI: 10.1016/j.neuroimage.2011.11.001",
      "Bosch-Bayard J, Biscay RJ, Fernandez T, Otero GA, Ricardo-Garcell J, Aubert-Vazquez E, Evans AC, Harmony T. EEG effective connectivity during the first year of life mirrors brain synaptogenesis, myelination, and early right hemisphere predominance. NeuroImage 252 (2022) 119035. https://doi.org/10.1016/j.neuroimage.2022.119035"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004577.v1.0.1",
    "License": "CC0"
  },
  "readme_content": "May 25th 2023\nNeurodevelopment Research Unit, Instituto de Neurobiología, Universidad Nacional Autónoma de México\n\nThis is a dataset containing resting EEG for a sample of 103 normal infants (41 female and 62 male) in the first year of life.\n\n81 subjects with 1 EEG recording\n18 subjects with 2 EEG recordings\n3 subjects with 3 EEG recording\n1 subject with 4 EEG recordings\n\n130 EEG recordings in total distributed in 4 sessions\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004577",
    "exists": true,
    "description": "OpenNeuro dataset - Dataset containing resting EEG for a sample of 103 normal infants in the first year of life",
    "created_at": "2023-05-25T16:05:40+00:00",
    "updated_at": "2023-05-25T16:12:00+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}