{
  "dataset_id": "ds004657",
  "date_retrieved": "2025-07-31T00:26:42.339244+00:00",
  "dataset_description": {
    "Name": "Driving with Autonomous Aids",
    "License": "CC0",
    "Authors": [
      "Jason Metcalfe",
      "Amar Marathe",
      "Tony Johnson",
      "Stephen Gordon",
      "Jon Touryan",
      "Kevin King"
    ],
    "ReferencesAndLinks": [
      ""
    ],
    "BIDSVersion": "1.8.0",
    "HEDVersion": "8.1.0",
    "DatasetDOI": "doi:10.18112/openneuro.ds004657.v1.0.3"
  },
  "readme_content": "TX20 dataset\n\nVehicle survivability is critically important in today’s military. Survivability is critically impacted by the performance of human operators – especially as it degrades with various factors. Significant DoD investments have focused on developing and integrating autonomous technologies to mitigate the effects of human error. However, simply implementing autonomy without having a clear plan for integrating with human operators can lead to relatively poor performance and thus low user acceptance. Human trust in automation (TiA) is a well-documented determinant of acceptance and use, but more important than achieving a certain level of trust is to find an appropriate match between the capabilities of the technology and the operator's trust. Finding means to calibrate TiA to elicit the desired use of the autonomy is an important goal, but requires reliable quantitative indicators that can be continuously monitored. Considerable research on interpersonal trust has revealed measurable patterns of physiological change that correlate significantly with changing levels of subjective trust and trust-based decision making. This research was aimed at facilitating the eventual real-time management of TiA by developing initial psychophysiology-based metrics for monitoring and predicting continuous changes in trust and/or trust-related behaviors.\n\nComplete a semi-automated driving task involving lane maintenance, following distance from a lead vehicle, and collision avoidance (with oncoming traffic and frequently appearing pedestrians). Under certain conditions, an automated driving assistant was available and could be engaged and disengaged at the discretion of the driver.  The automated assistant was capable of managing limited aspects of the driving task (maintainance of following distance alone or maintaining following distance and lane position), but was not capable of collision avoidance. Separate driver responses (button presses) were required to successfully avoid collisions with pedestrians.\n\nThis research was conducted to develop and validate methods for monitoring and predicting varying degrees of trust in automation (TiA) using both physiological and behavioral metrics characterizing real-time human-automation interactions. The overarching goal of this research was to develop and validate methods for measuring and drawing inferences about TiA, either directly or indirectly through correlated constructs. In particular, we examined operator trust in vehicle automation as it is reflected in changes observed in subjective reports as well as behavioral and physiological state variables during the execution of a shared human-autonomy driving task. The stated aims underlying this goal included:\nAim #1: To develop and experimentally validate metrics (dependent variables) that index changes in TiA. Rather than focusing on single-modality metrics, we will record and explore the patterns of correlation and co-variance among a variety of psychophysiological and behavioral variables and focus particularly on metrics that predict decisions around sharing vehicle control with the autonomy in each condition. State measures will be derived from EEG, EOG (electrooculography), ECG, EDA, and gaze position tracking as well as the subject vehicle control behaviors.\nAim #2: To develop an understanding of factors (independent variables and covariates) that influence the subject’s TiA. Whereas the Aim #1 targets the identification of metrics, or groups of metrics, that reliably predict trust-based decision-making, here we seek to gain insight as to which factors influence the likelihood and directionality of those same trust-based decisions. Such factors will include real-time tracking of variables such as task load, collision risk, and recent performance history or trending changes in success rate.\n\nSessions/Conditions\nSCPB: PractB\nSCMM: Manual driving\nSCFB: Full Bad autonomy\nSCFG: Full Good autonomy\nSCSB: Speed Bad autonomy\nSCSG: Speed Good autonomy. ",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004657",
    "exists": true,
    "description": "OpenNeuro dataset - Driving with Autonomous Aids",
    "created_at": "2023-08-05T03:11:27+00:00",
    "updated_at": "2023-08-05T03:34:47+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}