{
  "dataset_id": "ds003570",
  "date_retrieved": "2025-07-31T00:20:34.784610+00:00",
  "dataset_description": {
    "Name": "EEG: Improvisation and Musical Structures",
    "ReferencesAndLinks": [
      "Goldman, A., Jackson, T., & Sajda, P. (2020). Improvisation experience predicts how musicians categorize musical structures. Psychology of Music, 48(1), 18-34. https://doi.org/10.1177/0305735618779444",
      "Faller, J., Goldman, A. J., Lin, Y., McIntosh, J. R., & Sajda, P. (2021). Spatiospectral brain networks reflective of improvisational experience. bioRxiv. https://doi.org/10.1101/2021.02.25.432633"
    ],
    "License": "CC0",
    "Authors": [
      "Andrew Goldman",
      "Tyreek Jackson",
      "Paul Sajda"
    ],
    "Acknowledgements": "Sincere thanks to Josef Faller, Raphael Gerraty, Daphna Shohamy, George Lewis, Peter Gordon, Lori Custodero, the LIINC Lab, and the Learning Lab for supporting this project. Thanks also to the Presidential Scholars in Society and Neuroscience program.",
    "HowToAcknowledge": "Please cite this paper: https://doi.org/10.1177/0305735618779444",
    "Funding": [
      "Presidential Scholars in Society and Neuroscience program at Columbia University",
      "Army Research Laboratory under Cooperative Agreement Number W911NF-15-2-0074"
    ],
    "EthicsApprovals": [
      "Institutional Review Board of Columbia University, New York City, NY, USA"
    ],
    "BIDSVersion": "1.1.1",
    "DatasetDOI": "10.18112/openneuro.ds003570.v1.0.0"
  },
  "readme_content": "The musicians were instructed to listen to chord progressions, that each consisted of three chords. We refer to one instance of such a progression in the recording as a trial. Every one of the three chords in one trial sounded in sequence, each for 400 ms in piano timbre, after which each trial ended with another 400 ms silence. This resulted in a fixed, total trial length of 1600 ms. The only progressions used in the experiment were ii-IV-I, ii-V-I, ii-IV6-I and ii-V6-I. Each experimental block consisted of 180 trials. For each such block one of the four aforementioned progressions were chosen as \"standard\", resulting in four types of blocks. These \"block types\" were used to counterbalance the effect of other features of the individual progressions such as intervallic content that may have been in themselves salient. An experimental block always started with at least eight \"standard\" trials  for the purpose of  allowing participants to learn what type of progression would be the standard for the current block. There were two types of deviant trials that each occurred at a probability of 7.5% (in total 15%). Every deviant trial was followed by at least three standard trials. Deviant trials only differed from standard trials in terms of the middle chord: (1) Exemplar deviants, where the middle chord was replaced with a chord of identical notes but different inversion. For example, if the middle chord for a standard trial in that experimental block was V then the middle chord for the exemplar deviant in that block would be V6. For (2) function deviants, the middle chord was replaced by a chord from a different functional class. For example, if the middle chord for a standard was again V, then the middle chord for the corresponding function deviant in that block would be IV. Importantly, the key for each trial''s chord progression was picked at random. This meant that musicians needed to examine the second chord of every trial relative to the first and/or third to identify whether the trial was a standard or deviant. The order of standards and deviants within every one of the four types of experimental blocks was generated once only, and was thus identical across subjects within these block types. For the experiment, every one of the block types occurred twice, thus resulting in a total of eight blocks per subject. The order of the eight blocks was shuffled for every subject. In total, there were 1440 trials per subject of which 222 were functional and 218 were exemplar deviants.\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003570",
    "exists": true,
    "description": null,
    "created_at": "2021-03-20T08:34:00+00:00",
    "updated_at": "2022-07-19T21:10:16+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}