{
  "dataset_id": "ds004395",
  "date_retrieved": "2025-07-31T00:15:37.065603+00:00",
  "dataset_description": {
    "Name": "Penn Electrophysiology of Encoding and Retrieval Study (PEERS)",
    "BIDSVersion": "1.6.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Michael J. Kahana",
      "Joseph H. Rudoler",
      "Lynn J. Lohnas",
      "Karl Healey",
      "Ada Aka",
      "Adam Broitman",
      "Elizabeth Crutchley",
      "Patrick Crutchley",
      "Kylie H. Alm",
      "Brandon S. Katerman",
      "Nicole E. Miller",
      "Joel R. Kuhn",
      "Yuxuan Li",
      "Nicole M. Long",
      "Jonathan Miller",
      "Madison D. Paron",
      "Jesse K. Pazdera",
      "Isaac Pedisich",
      "Christoph T. Weidemann"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004395.v2.0.0"
  },
  "readme_content": "﻿The Penn Electrophysiology of Encoding and Retrieval Study (PEERS) aimed to characterize the behavioral and electrophysiological (EEG) correlates of memory encoding and retrieval in highly practiced individuals. Across five PEERS experiments, 300+ subjects contributed more than 7,000 90 minute memory testing sessions with recorded EEG data.\n\nSee the Computational Memory Lab's [wiki page](https://memory.psych.upenn.edu/PEERS) for more detailed information, and [this paper](https://psyarxiv.com/bu5x8/) for a discussion of the main findings and lessons learned from this large-scale study.\n\nThis dataset contains 3 experiments:\n* ltpFR (a.k.a. PEERS1-3)\n* ltpFR2 (a.k.a. PEERS4)\n* VFFR (a.k.a. PEERS5)\n\nElectroencephalogram (EEG) data were recorded with either a 129-channel Geodesic Sensor Net (either GSN 200 model or HydroCel GSN model) using the Netstation acquisition environment (Electrical Geodesics, Inc.; EGI) or with a 128-channel BioSemi headcap using the Biosemi ActiveTwo acquisition system. \n**Note:** subject-specific electrode layouts were NOT recorded. Despite being labeled as \"CapTrak\" space, the coordinates reflect a generic electrode layout for a given headcap and do NOT represent any individual's head shape. \n\n\nReferences\n----------\nAppelhoff, S., Sanderson, M., Brooks, T., Vliet, M., Quentin, R., Holdgraf, C., Chaumon, M., Mikulan, E., Tavabi, K., Höchenberger, R., Welke, D., Brunner, C., Rockhill, A., Larson, E., Gramfort, A. and Jas, M. (2019). MNE-BIDS: Organizing electrophysiological data into the BIDS format and facilitating their analysis. Journal of Open Source Software 4: (1896). https://doi.org/10.21105/joss.01896\n\nPernet, C. R., Appelhoff, S., Gorgolewski, K. J., Flandin, G., Phillips, C., Delorme, A., Oostenveld, R. (2019). EEG-BIDS, an extension to the brain imaging data structure for electroencephalography. Scientific Data, 6, 103. https://doi.org/10.1038/s41597-019-0104-8\n\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004395",
    "exists": true,
    "description": "OpenNeuro dataset - Penn Electrophysiology of Encoding and Retrieval Study (PEERS)",
    "created_at": "2023-06-01T03:00:28+00:00",
    "updated_at": "2024-10-24T20:15:36+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}