{
  "dataset_id": "ds004033",
  "date_retrieved": "2025-07-31T00:16:24.596978+00:00",
  "dataset_description": {
    "Name": "Electrode walking study",
    "BIDSVersion": "v2.0",
    "License": "CC0",
    "Authors": [
      "Joanna Scanlon",
      "Nadine Jacobsen",
      "Marike Maack",
      "Stefan Debener"
    ],
    "ReferencesAndLinks": [
      "article link follows:"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004033.v1.0.0"
  },
  "readme_content": "The electrode and synchronized walking study: Participants performed 3 tasks outside:\neyes open/eyes close, standing, walking alone & walking with experimenter oddball task, and 3 walking with experimenter tasks\nOnly part of the second task (standing and walking oddball) was used for the first paper.\nEach of 18 participants performed the task using both active (session 1) and passive (session 2) electrodes, in counterbalanced order \nTask 1: Eyes open / Eyes closed; 1. Participant stands facing a wall with eyes open (or closed) for 1 min. \nThen 1 min of eyes closed (or open). This is counterbalanced and repeated. 2X each type. Task 2: Oddball task: Standing / Walking alone / \nWalking together. Participants performed an oddball task in which they listened to the tones through headphones and silently counted the deviant tones. \nThe tones were 800 and 1000 Hz, with the standard/target status counterbalanced across participants. During the walking conditions, \nparticipants walked clockwise around an outdoor (roofed) basketball arena, following pylons. Each block was about 5-6 minutes. \nBlocks were counterbalanced and repeated 2X each. Task 3: Walking together: Natural / Control / Synchronize 3. Participants walked with \nthe experimenter for 6 minutes in 3 conditions. The experimenter listened to a metronome while walking, and synchronized their steps with it \n(also true during walking together oddball task). During Natural walking, participant is just asked to walk with the experimenter, with no other\ninstruction. In Control, participant is `blinded` using `side-blinders` which block their view of the experimenter. In Synchronize, participants \ntry to synchronize their steps with the experimenter. All walking & oddball conditions started with a countdown (this has a specific trigger for oddball conds,\nnot for task 3 conds. It plays during the first ~ 12 seconds of the 6 min trial\n\n- Joanna Scanlon (Feb 2022)",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004033",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds004033",
    "created_at": "2022-04-14T17:42:03+00:00",
    "updated_at": "2022-04-14T17:42:03+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}