{
  "dataset_id": "ds003969",
  "date_retrieved": "2025-07-31T00:11:35.399722+00:00",
  "dataset_description": {
    "Name": "Meditation vs thinking task",
    "ReferencesAndLinks": [
      "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0170647"
    ],
    "BIDSVersion": "v1.2.1",
    "License": "CC0",
    "Authors": [
      "Arnaud Delorme",
      "Claire Braboszcz"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds003969.v1.0.0"
  },
  "readme_content": "Data collection took place at the Meditation Research Institute (MRI) in Rishikesh, India, under the supervision of Arnaud Delorme, Ph.D. The project was approved by the local MRI Indian ethical committee and the ethical committee of the University of California San Diego (IRB project # 090731).\n\nParticipants sat either on a blanket on the floor or on a chair for both experimental periods depending on their personal preference. Participants were asked to keep their eyes closed, and all lighting in the room was turned off during data collection. An intercom allowed communication between the experimental and the recording room.\n\nParticipants performed four blocks, 2 meditation blocks interspaced by two thining blocks (in which they are instructed to think actively). Half of the participants start with a meditation block, and half of them start with a thinking block. The first meditation block is a breath counting meditation for all participants. The second block is a tradition-specific meditation - except for the control group, for which it is a breath counting meditation.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds003969",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds003969",
    "created_at": "2022-02-03T02:53:04+00:00",
    "updated_at": "2022-02-03T02:53:04+00:00",
    "default_branch": "master"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}