{
  "dataset_id": "ds005815",
  "date_retrieved": "2025-07-31T00:16:34.378055+00:00",
  "dataset_description": {
    "Name": "A Human EEG\nDataset for Multisensory Perception and Mental\nImagery",
    "BIDSVersion": "1.10.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Yan-Han Chang",
      "Hsi-An Chen",
      "Min-Jiun Tsai",
      "Chun-Lung Tseng",
      "Ching-Huei Lo",
      "Kuan-Chih Huang",
      "Chun-Shu Wei"
    ],
    "Acknowledgements": "This work was supported by the National Science and Technology Council (NSTC) under Contracts 109-2222-E-009-006-MY3.",
    "DatasetDOI": "doi:10.18112/openneuro.ds005815.v2.0.1",
    "GeneratedBy": [
      {
        "Name": "N/A",
        "Version": "N/A",
        "CodeURL": ""
      }
    ],
    "SourceDatasets": [
      {
        "URL": "N/A",
        "Version": "N/A"
      }
    ]
  },
  "readme_content": "The YOTO (You Only Think Once) dataset presents a human electroencephalography (EEG) resource for exploring multisensory perception and mental imagery. The study enrolled 20 participants who performed tasks involving both unimodal and multimodal stimuli. Researchers collected high-resolution EEG signals at a 1000 Hz sampling rate to capture high-temporal-resolution neural activity related to internal mental representations. The protocol incorporated visual, auditory, and combined cues to investigate the integration of multiple sensory modalities, and participants provided self-reported vividness ratings that indicate subjective perceptual strength. Technical validation involved event-related potentials (ERPs) and power spectral density (PSD) analyses, which demonstrated the reliability of the data and confirmed distinct neural responses across stimuli. This dataset aims to foster studies on neural decoding, perception, and cognitive modeling, and it is publicly accessible for researchers who seek to advance multimodal mental imagery research and related applications.",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds005815",
    "exists": true,
    "description": "OpenNeuro dataset - YOTO (You Only Think Once): An EEG Dataset for Tracking Spontaneous Cognitive Transitions and Multimodal Stimuli Responses in Resting-State and Task Phases",
    "created_at": "2025-01-12T16:18:57+00:00",
    "updated_at": "2025-06-17T11:32:47+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}