{
  "dataset_id": "ds004819",
  "date_retrieved": "2025-07-31T00:13:32.315916+00:00",
  "dataset_description": {
    "Name": "Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain",
    "BIDSVersion": "1.7.0",
    "DatasetType": "raw",
    "License": "CC0",
    "Authors": [
      "Keundong Lee",
      "Angelique C. Paulk",
      "Yun Goo Ro",
      "Daniel R. Cleary",
      "Karen J. Tonsfeldt",
      "Yoav Kfir",
      "John Pezaris",
      "Youngbin Tchoe",
      "Jihwan Lee",
      "Andrew M. Bourhis",
      "Ritwik Vatsyayan",
      "Joel R. Martin",
      "Samantha M. Russman",
      "Jimmy C. Yang",
      "Amy Baohan",
      "R. Mark Richardson",
      "Ziv M. Williams",
      "Shelley I. Fried",
      "Hoi Sang U",
      "Ahmed M. Raslan",
      "Sharona Ben-Haim",
      "Eric Halgren",
      "Sydney S. Cash",
      "Shadi. A. Dayeh"
    ],
    "Acknowledgements": "We are grateful for the technical support from the nano3 cleanroom facilities at UCSD’s Qualcomm Institute where the depth electrode fabrication was conducted. This work was performed, in part, at the San Diego Nanotechnology Infrastructure (SDNI) of UCSD, a member of the National Nanotechnology Coordinated Infrastructure, which is supported by the NSF (grant ECCS1542148). We thank Yangling Chou, Aaron Tripp, Fausto Minidio, Daniel J. Soper, and Alexandra O’Donnell for their help in collecting the data. ",
    "HowToAcknowledge": "This project contains the data for the publication Lee et al, \"Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain\". It contains the raw and preprocessed (epoched) intracranial EEG (iEEG) data files for multiple species to test novel high resolution micro-stereo-electrodes for recording neural activity in the brain. The data set involves the use of direct electrical stimulation to examine effects of stimulation in the brain. Contact: Shadi Dayeh (sdayeh@eng.ucsd.edu) or Angelique C. Paulk (apaulk@mgh.harvard.edu). If you use this data as a part of any publications, please use the following citation: Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain. Keundong Lee, Angelique C. Paulk, Yun Goo Ro, Daniel R. Cleary, Karen J. Tonsfeldt, Yoav Kfir, John Pezaris, Youngbin Tchoe, Jihwan Lee, Andrew M. Bourhis, Ritwik Vatsyayan, Joel R. Martin, Samantha M. Russman, Jimmy C. Yang, Amy Baohan, R. Mark Richardson, Ziv M. Williams, Shelley I. Fried, Hoi Sang U, Ahmed M. Raslan, Sharona Ben-Haim, Eric Halgren, Sydney S. Cash, Shadi. A. Dayeh. bioRxiv 2022.11.08.515705; doi: https://doi.org/10.1101/2022.11.08.515705.",
    "Funding": [
      "NIH UG3NS123723-01",
      "NIH R01NS123655-01",
      "NIH NBIB DP2-EB029757",
      "NIH MH120886-01",
      "NSF 1728497",
      "NSF 1351980",
      "NSF DGE-1650112",
      "NIH K24-NS088568",
      "NIH R01-NS062092",
      "Tiny Blue Dot Foundation",
      "NIH NS047101",
      "NIH K99 NS119291",
      "MGH - ECOR"
    ],
    "EthicsApprovals": [
      "All patients voluntarily participated after fully informed consent as monitored by the Partners Institutional Review Board covering Massachusetts General Hospital (MGH). Participants were informed that participation in the stimulation tests would not alter their clinical treatment in any way, and that they could withdraw at any time without jeopardizing their clinical care. All rodent and pig experiments were approved by the UCSD Institutional Animal Care and Use Committee (IACUC, protocol # S19030). For NHPs, all efforts were made to minimize discomfort, and the Institutional Animal Care and Use Committee at the Massachusetts General Hospital monitored care and approved all procedures. "
    ],
    "ReferencesAndLinks": [
      "Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain. Keundong Lee, Angelique C. Paulk, Yun Goo Ro, Daniel R. Cleary, Karen J. Tonsfeldt, Yoav Kfir, John Pezaris, Youngbin Tchoe, Jihwan Lee, Andrew M. Bourhis, Ritwik Vatsyayan, Joel R. Martin, Samantha M. Russman, Jimmy C. Yang, Amy Baohan, R. Mark Richardson, Ziv M. Williams, Shelley I. Fried, Hoi Sang U, Ahmed M. Raslan, Sharona Ben-Haim, Eric Halgren, Sydney S. Cash, Shadi. A. Dayeh. bioRxiv 2022.11.08.515705; doi:https://doi.org/10.1101/2022.11.08.515705."
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004819.v1.0.0"
  },
  "readme_content": "This project contains the data for the publication Lee et al, \"Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain\". It contains the raw and preprocessed (epoched) intracranial EEG (iEEG) data files for multiple species to test novel high resolution micro-stereo-electrodes for recording neural activity in the brain. The data set involves the use of direct electrical stimulation to examine effects of stimulation in the brain. \n\nData are in the iEEG-BIDS format with binary files and channel maps included in the related derivatives folder. ",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004819",
    "exists": true,
    "description": "OpenNeuro dataset - Flexible, Scalable, High Channel Count Stereo-Electrode for Recording in the Human Brain",
    "created_at": "2023-10-26T00:06:50+00:00",
    "updated_at": "2023-10-26T00:07:46+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}