{
  "dataset_id": "ds004511",
  "date_retrieved": "2025-07-31T00:19:29.021533+00:00",
  "dataset_description": {
    "Name": "Deception_data",
    "License": "CC0",
    "BIDSVersion": "1.8.0",
    "DatasetType": "raw",
    "Authors": [
      "Makowski, Dominique",
      "Pham, Tam",
      "Lau, Zen Juen"
    ],
    "Acknowledgements": "Special thanks to An-Shu Te for helping with formatting this dataset in BIDS",
    "DatasetDOI": "doi:10.18112/openneuro.ds004511.v1.0.2",
    "KeyWords": [
      "Electroencephalography",
      "Deception",
      "Decision making",
      "Cognitive Control",
      "Resting state"
    ]
  },
  "readme_content": "# Overview\n\nThis dataset was collected in 2020 and comprises electroencephalography, physiological and behavioural data. The dataset includes both resting-state (eyes closed) and task-related neurophysiological signals acquired from 44 healthy individuals (ages: 21-40). The tasks administered to subjects include a spontaneous deception task (Gambling Game; GG) as well as a task assessing cognitive control (CC).\n\n\n# Task Description\n## Spontaneous Deception Task (GG)\nParticipants were informed that the GG task aimed to study a player's behaviour during a gambling game. They were given SGD 50 at the start of the game. They were to undergo 144 rounds of making a prediction about the outcome of a dice roll. They were to also place a bet ranging from 10 cents to 80 cents for each prediction; they win the bet if the prediction was true and lose it if it was false.\n\nParticipants were also informed that they were the only ones who knew the outcome of the dice roll and were responsible for reporting if their predictions were true to the system, and were debriefed at the end regarding this cover story.\n\n## Cognitive Control (CC)\nParticipants performed 60 trials of a simple processing speed task, 80 trials of a simple response selection task, 160 trials of a response inhibition task, and 160 trials of a conflict resolution task. See details of the task https://github.com/neuropsychology/CognitiveControl. \n\n\n# Data acquisition\n## EEG data acquisition\n\nEEG signals were recorded using the TruScan 128 Research EEG system and TruScan Aquisition software (DeyMed Diagnostics s.r.o). Electrodes were placed on the EEG cap according to the standard 10-5 system of electrode placement (Oostenveld & Praamsrta, 2001) and impedance was kept below 20 kOhm for each subject. The ground electrode was placed on the zygomatic bone and two electrodes were fixed on the mastoids to be used as references. During recording, the sampling rate was 3000Hz. Note that channels 124 and 125 were placed above and below the eyes respectively for vertical EOG signals.\n\n### Note\nsub-S200203 does not have any EEG acquisition file pertaining to the Gambling Game task due to technical errors during the recording.\n\n\n## Physiological data acquisition\n\nParticipants' physiological signals, that is their electrocardiogram (*ECG*), respiration signals (*RSP*), electrodermal activity (*EDA*) and electromyography (*EMG*), were obtained at a sampling frequency of 4000Hz. All physiological signals were recorded via the BioPac MP160 system (BioPac Systems Inc., USA) and the AcqKnowledge 5.0 software.\n\nECG was collected using three ECG electrodes placed according to a modified Lead II configuration, and RSP was acquired using a respiration belt tightened over participants' upper abdomen. EDA, a measure of skin conductance, was acquired using electrodes placed on the middle and index fingers of subjects' non-dominant hands and EMG was obtained by measuring the electrical activity of the corrugator muscles.\n\n### Note\nWith regards to the Cognitive Control task, physiological data was collected over 2 sessions for sub-S200303 as a result of technical errors during the recording. \n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004511",
    "exists": true,
    "description": "OpenNeuro dataset - Deception_data",
    "created_at": "2023-02-24T09:56:31+00:00",
    "updated_at": "2023-06-01T11:48:08+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}