{
  "dataset_id": "ds004080",
  "date_retrieved": "2025-07-31T00:20:11.563333+00:00",
  "dataset_description": {
    "Name": "CCEP ECoG dataset across age 4-51",
    "BIDSVersion": "Brain Imaging Data Structure Specification v1.6.0",
    "License": "CC0",
    "Authors": [
      "D. van Blooijs",
      "M.A. van den Boom",
      "J.F. van der Aar",
      "G.J.M. Huiskamp",
      "G. Castegnaro",
      "M. Demuru",
      "W.J.E.M. Zweiphenning",
      "P. van Eijsden",
      "K. J. Miller",
      "F.S.S. Leijten",
      "D. Hermes"
    ],
    "Acknowledgements": "The SEIN-UMCU RESPect database group: C.J.J. van Asch, L. van de Berg, S. Blok, M.D. Bourez, K.P.J. Braun, J.W. Dankbaar, C.H. Ferrier, T.A. Gebbink, P.H. Gosselaar, R. van Griethuysen, M.G.G. Hobbelink, F.W.A. Hoefnagels, N.E.C. van Klink, M.A. van ‘t Klooster, G.A.P. de Kort, M.H.M. Mantione, A. Muhlebner, J.M. Ophorst, P.C. van Rijen, S.M.A. van der Salm, E.V. Schaft, M.M.J. van Schooneveld, H. Smeding, D. Sun, A. Velders, M.J.E. van Zandvoort, G.J.M. Zijlmans, E. Zuidhoek and J. Zwemmer",
    "HowToAcknowledge": "D. van Blooijs, M.A. van den Boom, J.F. van der Aar, G.J.M. Huiskamp, G. Castegnaro, M. Demuru, W.J.E.M. Zweiphenning, P. van Eijsden, K. J. Miller, F.S.S. Leijten, D. Hermes, Developmental trajectory of transmission speed in the human brain, Nature Neuroscience, 2023, https://doi.org/10.1038/s41593-023-01272-0",
    "Funding": [
      "NIMH R01MH122258",
      "Alexandre Suerman Stipendium 2015",
      "EpilepsieNL #17-07"
    ],
    "ReferencesAndLinks": [
      "see HowToAcknowledge"
    ],
    "EthicsApprovals": [
      "This study was approved by the Medical Ethical Committee from the UMC Utrecht, The Netherlands"
    ],
    "DatasetDOI": "doi:10.18112/openneuro.ds004080.v1.2.4"
  },
  "readme_content": "# Dataset description\nThis dataset consists of 74 patients age 4-51 years old where Cortico-Cortical Evoked Potentials (CCEPs) were measured with Electro-CorticoGraphy (ECoG) during single pulse electrical stimulation. For a detailed description see:\n\n- Developmental trajectory of transmission speed in the human brain. D. van Blooijs¹, M.A. van den Boom¹, J.F. van der Aar, G.J.M. Huiskamp, G. Castegnaro, M. Demuru, W.J.E.M. Zweiphenning, P. van Eijsden, K. J. Miller, F.S.S. Leijten, D. Hermes, Nature Neuroscience, 2023, https://doi.org/10.1038/s41593-023-01272-0  \n  ¹ these authors contributed equally.\n\nThis dataset is part of the RESPect (Registry for Epilepsy Surgery Patients) database, a dataset recorded at the University Medical Center of Utrecht, the Netherlands. The study was approved by the Medical Ethical Committee from the UMC Utrecht.\n\n## Contact \n- Dorien van Blooijs: D.vanBlooijs@umcutrecht.nl\n- Frans Leijten: F.S.S.leijten@umcutrecht.nl\n- Dora Hermes: hermes.dora@mayo.edu\n\n# Data organization\nThis data is organized according to the Brain Imaging Data Structure specification. A community-driven specification for organizing neurophysiology data along with its metadata. For more information on this data specification, see https://bids-specification.readthedocs.io/en/stable/ \n\nEach patient has their own folder (e.g., `sub-ccepAgeUMCU01` to `sub-ccepAgeUMCU74`) which contains the iEEG recordings data for that patient, as well as the metadata needed to understand the raw data and event timing.\n\nData are logically grouped in the same BIDS session and stored across runs that indicating the day and time point of recording during the monitoring period.\nIf extra electrodes were added/removed during this period, the session was divided into different sessions (e.g. ses-1a and ses-1b). \nWe use the optional run key-value pair to specify the day and the start time of the recording (e.g. run-021315, day 2 after implantation, which is day 1 of the monitoring period, at 13:15).\nThe task key-value pair in long-term iEEG recordings describes the patient's state during the recording of this file. The task label is “SPESclin“ since these files contain data collected during clinical single pulse electrical stimulation (SPES). \n\nElectrode positions include Destrieux atlas labels that were estimated by running Freesurfer on the individual subject MRI scan and taking the most common surface label within a sphere around the electrode. All shared electrode positions were then converted to MNI152 space using the Freesurfer surface based non-linear transformation. We note that this surface based transformation distorts the dimensions of the grids, but maintains the gyral anatomy.\n\n# License\nThis dataset is made available under the Public Domain Dedication and License CC v1.0, whose full text can be found at \nhttps://creativecommons.org/publicdomain/zero/1.0/. \nWe hope that all users will follow the ODC Attribution/Share-Alike Community Norms (http://www.opendatacommons.org/norms/odc-by-sa/); \nin particular, while not legally required, we hope that all users of the data will acknowledge by citing the following in any publication:\nDevelopmental trajectory of transmission speed in the human brain, D. van Blooijs, M.A. van den Boom, J.F. van der Aar, G.J.M. Huiskamp, G. Castegnaro, M. Demuru, W.J.E.M. Zweiphenning, P. van Eijsden, K. J. Miller, F.S.S. Leijten, D. Hermes, Nature Neuroscience, 2023, https://doi.org/10.1038/s41593-023-01272-0\n\n# Code\nCode to analyses these data is available at: https://github.com/MultimodalNeuroimagingLab/mnl_ccepAge\n\n# Acknowledgements \nWe thank the SEIN-UMCU RESPect database group (C.J.J. van Asch, L. van de Berg, S. Blok, M.D. Bourez, K.P.J. Braun, J.W. Dankbaar, C.H. Ferrier, T.A. Gebbink, P.H. Gosselaar, R. van Griethuysen, M.G.G. Hobbelink, F.W.A. Hoefnagels, N.E.C. van Klink, M.A. van ‘t Klooster, G.A.P. deKort, M.H.M. Mantione, A. Muhlebner, J.M. Ophorst, P.C. van Rijen, S.M.A. van der Salm, E.V. Schaft, M.M.J. van Schooneveld, H. Smeding, D. Sun, A. Velders, M.J.E. van Zandvoort, G.J.M. Zijlmans, E. Zuidhoek and J. Zwemmer) for their contributions and help in collecting the data, and G. Ojeda Valencia for proofreading the manuscript. \n\n# Funding\nResearch reported in this publication was supported by the National Institute of Mental Health of the National Institutes of Health under Award Number R01MH122258 (DH, FSSL, the content is solely the responsibility of the authors and does not necessarily represent the official views of the National Institutes of Health), the EpilepsieNL under Award Number NEF17-07 (DvB) and the UMC Utrecht Alexandre Suerman MD/PhD Stipendium 2015 (WZ).\n",
  "github_info": {
    "repository_url": "https://github.com/OpenNeuroDatasets/ds004080",
    "exists": true,
    "description": "OpenNeuro dataset available at https://openneuro.org/datasets/ds004080",
    "created_at": "2023-02-23T19:33:55+00:00",
    "updated_at": "2023-02-23T19:33:55+00:00",
    "default_branch": "main"
  },
  "retrieval_status": {
    "dataset_description": "not_found",
    "readme": "not_found",
    "repository": "success"
  }
}